{/* <li className="read__item">
            <h3 className="read__menu-title">ІІ-БӨЛІМ. СЫЗЫҚТЫҚ ОБЪЕКТІЛЕРДІ ТҰРҒЫЗУ</h3>
            <ul>
              <li>Point (Нүкте) командасы</li>
              <li>Line (Кесінді) командасы</li>
              <li>XLINE және RAY (Түзулер мен сәулелер) командалары</li>
              <li>Multiline (мультисызықтар) командасы</li>
              <li>Polyline (полисызықтар) командасы</li>
              <li>POLYGON (көпбұрыш) командасы</li>
              <li>RECTANGE (тікбұрыш) командасы</li>
            </ul>
          </li>
          <li className="read__item">
            <h3 className="read__menu-title">ІІІ-БӨЛІМ. СЫЗБАЛАРДЫ РЕДАКЦИЯЛАУ</h3>
            <ul>
              <li>Объектілерді таңдау</li>
              <li>Қалам көмегімен редакциялау</li>
              <li>Объектілерді жою және қалпына келтіру</li>
              <li>Жалпы түзету бұйрықтары: CHAMFER, FILLET</li>
            </ul>
          </li>
          <li className="read__item">
          <h3 className="read__menu-title">ІV-БӨЛІМ. ҚОЛДАНУШЫНЫҢ ИНТЕРФЕЙСІ</h3>
            <ul>
              <li>Қосымша мәзірінің пернесі</li>
              <li>Жылдам қол жеткізу тақтасы</li>
              <li>Жанама мәзірі</li>
            </ul>
          </li>
          <li className="read__item">
          <h3 className="read__menu-title">V-БӨЛІМ. ЗЕРТХАНАЛЫҚ ЖҰМЫСТАР</h3>
            <ul>
              <li>Зертханалық жұмыс №1. AutoCad бағдарламасының экрандық элементтерімен  танысу. Құралдар панелінің элементтерімен жұмыс</li>
              <li>Зертханалық жұмыс №2. Сызбаның түсін, түрін өзгеру</li>
              <li>Зертханалық жұмыс №3. Шеңбер, доға, кесіндіні пайдаланып өлшемдері берілген сызбаны сызу</li>
              <li>Зертханалық жұмыс №4. Электрлық микросхеманың үзінді бөлігін салу</li>
              <li>Зертханалық жұмыс №5. AutoCad бағдарламасында параллельдік түзу тұрғызудың MLine және Offset командасының көмегімен үйрену</li>
              <li>Зертханалық жұмыс №6. Объектінің өлшем мәндерін экран бетіне шығаруды үйрену</li>
              <li>Зертханалық жұмыс №7. Trim және Extend командасын қолдану</li>
              <li>Зертханалық жұмыс №8. Объектінің көшірмесін алу. Массив.</li>
              <li>Зертханалық жұмыс №9. Мәтінмен жұмыс.( Текст)</li>
              <li>Зертханалық жұмыс №10. Қабаттың қасиеттерін  пайдаланып, күрделі сызбаны сызу</li>
              <li>Зертханалық жұмыс №11. Үш өлшемді координаты жүйесін оқыту</li>
              <li>Зертханалық жұмыс №12. Полисызықтың негізінде модельдеу</li>
              <li>Зертханалық жұмыс №13. Монолиттік моделін тұрғызу</li>
              <li>Зертханалық жұмыс №14. Монолиттік моделін тұрғызу-2</li>
              <li>Зертханалық жұмыс №15. Объектінің пішімін тонирленген режимі арқылы өзгерту</li>
            </ul>
          </li>
          <li className="read__item">
            <h3 className="read__menu-title">БІЛІМ АЛУШЫЛАРДЫҢ ӨЗІНДІК ЖҰМЫСЫНА ТАПСЫРМАЛАР</h3>
          </li>
          <li className="read__item">
            <h3 className="read__menu-title">ҚОСЫМШАЛАР</h3>
          </li>
          <li className="read__item">
            <h3 className="read__menu-title">AUTOCAD БАҒДАРЛАМАСЫНДА ТЕЗ ЕНДІРУ ПЕРНЕЛЕР КОМБИНАЦИЯСЫ</h3>
          </li>
          <li className="read__item">
            <h3 className="read__menu-title">ПАЙДАЛАНҒАН ӘДЕБИЕТТЕР</h3>
          </li> */}
          

          