import React from 'react'
import ReactMarkdown from 'react-markdown'


import './read.scss'
function Read() {
  const [show, setShow] = React.useState(false);
  const [show1, setShow1] = React.useState(false);
  const [show2, setShow2] = React.useState(false);
  const [show3, setShow3] = React.useState(false);
  const [show4, setShow4] = React.useState(false);
  const [add, setAdd] = React.useState(1);
  const list = [
              {id: 1, name: "Autocad-ты іске қосу"},
              {id: 2, name: "Анықтамалық жүйені шақыру"},
              {id: 3, name: "Сызбаларды ашу"},
              {id: 4, name: "Сызбалар ды құру"},
              {id: 5, name: "Сызбалар"},
              {id: 6, name: "Шаблон туралы толығырақ"},
              {id: 7, name: "Сурет шекараларын анықтау"},
              {id: 9, name: "Тор параметрлерін анықтау"},
  ];

  const  onShow = () => {
    setShow(!show)
    setShow1(false)
    setShow2(false)
    setShow3(false)
    setShow4(false)
  }
  const  onShow1 = () => {
    setShow(false)
    setShow1(!show1)
    setShow2(false)
    setShow3(false)
    setShow4(false)
  }
  const  onShow2 = () => {
    setShow(false)
    setShow1(false)
    setShow2(!show2)
    setShow3(false)
    setShow4(false)
  }
  const  onShow3 = () => {
    setShow(false)
    setShow1(false)
    setShow2(false)
    setShow3(!show3)
    setShow4(false)
  }
  const  onShow4 = () => {
    setShow(false)
    setShow1(false)
    setShow2(false)
    setShow3(false)
    setShow4(!show4)
  }
  return (
   <div className="container">
     <div className="read">
      <div className="readLeft">
        <h2 className="read__title">Мазмұны</h2>
        <ul className="read__menu">
          <li onClick={() => setAdd(1)} className="read__item">
            <h3 className="read__menu-title">КІРІСПЕ</h3>
          </li>
          <li className="read__item" onClick={() => onShow()}>
            <h3 className="read__menu-title">І-БӨЛІМ. AUTOCAD 2023 ЖҮЙЕСІ. ЖАЛПЫ МӘЛІМЕТ</h3>
            {
              show && <ul>
              <li onClick={() => setAdd(2)}>Жүйеге қойылатын талаптар</li>
              <li onClick={() => setAdd(3)}>Autocad-ты іске қосу</li>
              <li onClick={() => setAdd(4)}>Анықтамалық жүйені шақыру</li>
              <li onClick={() => setAdd(5)}>Сызбаларды ашу</li>
              <li onClick={() => setAdd(6)}>Сызбалар ды құру</li>
              <li onClick={() => setAdd(7)}>Сызбалар</li>
              <li onClick={() => setAdd(8)}>Шаблон туралы толығырақ</li>
              <li onClick={() => setAdd(9)}>Сурет шекараларын анықтау</li>
              <li onClick={() => setAdd(10)}>Тор параметрлерін анықтау</li>
            </ul>
            }
          </li>
          <li className="read__item" onClick={() => onShow1()}>
          <h3 className="read__menu-title">ІІ-БӨЛІМ. СЫЗЫҚТЫҚ ОБЪЕКТІЛЕРДІ ТҰРҒЫЗУ</h3>
           {show1 && <ul>
              <li onClick={() => setAdd(11)}>Point (Нүкте) командасы</li>
              <li onClick={() => setAdd(12)}>Line (Кесінді) командасы</li>
              <li onClick={() => setAdd(13)}>XLINE және RAY (Түзулер мен сәулелер) командалары</li>
              <li onClick={() => setAdd(14)}>Multiline (мультисызықтар) командасы</li>
              <li onClick={() => setAdd(15)}>Polyline (полисызықтар) командасы</li>
              <li onClick={() => setAdd(16)}>POLYGON (көпбұрыш) командасы</li>
              <li onClick={() => setAdd(17)}>RECTANGE (тікбұрыш) командасы</li>
            </ul>}
          </li>
          <li className="read__item" onClick={() => onShow2()}>
          <h3 className="read__menu-title">ІІІ-БӨЛІМ. СЫЗБАЛАРДЫ РЕДАКЦИЯЛАУ</h3>
            {show2 && <ul>
              <li onClick={() => setAdd(18)}>Объектілерді таңдау</li>
              <li onClick={() => setAdd(19)}>Қалам көмегімен редакциялау</li>
              <li onClick={() => setAdd(20)}>Объектілерді жою және қалпына келтіру</li>
              <li onClick={() => setAdd(21)}>Жалпы түзету бұйрықтары: CHAMFER, FILLET</li>
            </ul>}
          </li>
          <li className="read__item" onClick={() => onShow3()}>
          <h3 className="read__menu-title">ІV-БӨЛІМ. ҚОЛДАНУШЫНЫҢ ИНТЕРФЕЙСІ</h3>
            {show3 && <ul>
              <li onClick={() => setAdd(23)}>Қосымша мәзірінің пернесі</li>
              <li onClick={() => setAdd(24)}>Жылдам қол жеткізу тақтасы</li>
              <li onClick={() => setAdd(25)}>Жанама мәзірі</li>
            </ul>}
          </li>
          <li className="read__item" onClick={() => onShow4()}>
          <h3 className="read__menu-title">V-БӨЛІМ. ЗЕРТХАНАЛЫҚ ЖҰМЫСТАР</h3>
            {show4 && <ul>
              <li onClick={() => setAdd(26)}>Зертханалық жұмыс №1. AutoCad бағдарламасының экрандық элементтерімен  танысу. Құралдар панелінің элементтерімен жұмыс</li>
              <li onClick={() => setAdd(27)}>Зертханалық жұмыс №2. Сызбаның түсін, түрін өзгеру</li>
              <li onClick={() => setAdd(28)}>Зертханалық жұмыс №3. Шеңбер, доға, кесіндіні пайдаланып өлшемдері берілген сызбаны сызу</li>
              <li onClick={() => setAdd(29)}>Зертханалық жұмыс №4. Электрлық микросхеманың үзінді бөлігін салу</li>
              <li onClick={() => setAdd(30)}>Зертханалық жұмыс №5. AutoCad бағдарламасында параллельдік түзу тұрғызудың MLine және Offset командасының көмегімен үйрену</li>
              <li onClick={() => setAdd(31)}>Зертханалық жұмыс №6. Объектінің өлшем мәндерін экран бетіне шығаруды үйрену</li>
              <li onClick={() => setAdd(32)}>Зертханалық жұмыс №7. Trim және Extend командасын қолдану</li>
              <li onClick={() => setAdd(33)}>Зертханалық жұмыс №8. Объектінің көшірмесін алу. Массив.</li>
              <li onClick={() => setAdd(34)}>Зертханалық жұмыс №9. Мәтінмен жұмыс.( Текст)</li>
              <li onClick={() => setAdd(35)}>Зертханалық жұмыс №10. Қабаттың қасиеттерін  пайдаланып, күрделі сызбаны сызу</li>
              <li onClick={() => setAdd(36)}>Зертханалық жұмыс №11. Үш өлшемді координаты жүйесін оқыту</li>
              <li onClick={() => setAdd(37)}>Зертханалық жұмыс №12. Полисызықтың негізінде модельдеу</li>
              <li onClick={() => setAdd(38)}>Зертханалық жұмыс №13. Монолиттік моделін тұрғызу</li>
              <li onClick={() => setAdd(39)}>Зертханалық жұмыс №14. Монолиттік моделін тұрғызу-2</li>
              <li onClick={() => setAdd(40)}>Зертханалық жұмыс №15. Объектінің пішімін тонирленген режимі арқылы өзгерту</li>
            </ul>}
          </li>
          <li className="read__item"  onClick={() => setAdd(41)}>
            <h3 className="read__menu-title">БІЛІМ АЛУШЫЛАРДЫҢ ӨЗІНДІК ЖҰМЫСЫНА ТАПСЫРМАЛАР</h3>
          </li>
          <li className="read__item"  onClick={() => setAdd(42)}>
            <h3 className="read__menu-title">ҚОСЫМШАЛАР</h3>
          </li>
          <li className="read__item" onClick={() => setAdd(43)}>
            <h3 className="read__menu-title">AUTOCAD БАҒДАРЛАМАСЫНДА ТЕЗ ЕНДІРУ ПЕРНЕЛЕР КОМБИНАЦИЯСЫ</h3>
          </li>
          <li className="read__item" onClick={() => setAdd(44)}>
            <h3 className="read__menu-title">ПАЙДАЛАНҒАН ӘДЕБИЕТТЕР</h3>
          </li>
        </ul>
      </div>
      <div className="readRight">
        {add === 1 &&
        <>
          <h2 className="readRight__title">КІРІСПЕ</h2> 
          <p className="readRight__descr">
              Қазіргі уақытта көптеген графикалық редакторлар мен геометриялық модельдеу бағдарламалары бар. Autodesk компаниясы-конструкторларға, дизайнерлерге, архитекторларға арналған автоматтандырылған жобалау және бағдарламалық қамтамасыз ету (БҚ) жүйелерінің жетекші өндірушілерінің бірі. Бұл әлемдегі өнеркәсіптік және азаматтық құрылыс, машина жасау, геоинформатика, цифрлық ақпарат беру және сымсыз байланыс үшін ең ірі бағдарламалық қамтамасыз ететін қызмет көрсетуші болып табылады.
            Autodesk компаниясының AutoCAD жүйесі автоматтандырылған жобалау жүйелерінің (АЖЖ) бағдарламалық қамтамасыз ету платформалары арасында көшбасшы болып табылады. AutoCAD-бай және көп жағынан ерекше тарихы бар бағдарлама. Ол алғаш рет 1982 жылы MicroCAD атымен жарық көрді. AutoCAD-тың алғашқы нұсқасы автоматтандырылған жобалаудағы нағыз революцияның басталуын белгіледі. Бүгінгі таңда AutoCAD өз жұмысында бүкіл әлем бойынша миллиондаған дизайнерлерді алғашқы дербес компьютерлерде орнатылғандарға қарағанда мыңдаған есе қуатты процессорларда пайдаланады.
            AutoCAD-үнемі дамып келе жатқан нағыз жобалау ортасы. Бағдарламаның әрбір жаңа нұсқасы алдыңғылардың барлығын мұра етеді және пайдаланушылардың өнімділігі мен тиімділігін арттыруға бағытталған.
            Autodesk компаниясы AutoCAD 2023 нұсқасында сәулетшілерге, дизайнерлерге, инженерлерге өз идеяларын шындыққа айналдырудың жаңа құралын ұсынады.
            Бұл оқу құралы Autodesk әзірлеген ең танымал және қуатты Autocad 2023 әмбебап жобалау ортасының жаңа нұсқасын өз бетінше игеруге және игеруге арналған практикалық нұсқаулық болып табылады.
            Оқу құралында AutoCAD туралы жалпы мәліметтер келтірілген, жүйенің интерфейсі егжей-тегжейлі сипатталған, жұмыс ортасын құру, объектілерді қалыптастыру және редакциялау, сызбаларды жобалау командалары, объектілердің қасиеттері және қабаттармен жұмыс істеу, жүйенің есептеу функцияларына назар аударылған.
            Жобалау ортасымен жұмыс жасау көптеген суреттермен, мысалдармен, диалогтық терезелермен бірге жүреді, бұл тек оқуды ғана емес, сонымен қатар AutoCAD ортасында одан әрі жұмыс істеуді жеңілдетеді. Осылайша, оқу құралын анықтамалық жүйе ретінде пайдалануға болады.
            Шын мәнінде, бұл оқу құралы дайын оқу курсы болып табылады және әртүрлі деңгейдегі пайдаланушыларға, соның ішінде жоғары оқу орындарының студенттері мен оқытушыларына, конструкторларға, дизайнерлерге, инженерлерге және т.б. арналған.
          </p>
        </>
        }
        {add === 2 && <>
        <h2 className="readRight__title">Жүйеге қойылатын талаптар</h2>
        <p>
          <ReactMarkdown>
          AutoCAD автономды  режимінде де, жергілікті желіде де жұмыс істей алады.
        Windows операциялық жүйесінде жұмыс істейтін Autocad 2023-ның  64 разрядты нұсқасы тиімді жұмыс істеуі үшін келесі бағдарламалық және аппараттық құралдар қажет:
        - Windows® 8 Standard, Enterprise немесе Professional edition; Windows® 7 Enterprise, Ultimate, Professional, немесе Home Premium edition; Windows® XP Professional немесе Home edition (SP2 немесе одан кейінгі жаңартулар пакетімен) операциялық жүйелері;
        - процессор: Windows® XP – екі ядролы процессор Intel® Pentium® IV немесе SSE2 технологиясын қолдайтын 1,6 ГГц немесе одан жоғары  AMD Athlon; Windows® 7 немесе Windows® 8 – екі ядролы  процессор Intel® Pentium® IV немесе AMD Athlon кемінде 3,0 ГГц SSE2 технологиясының қолдауымен;
        - браузер: Windows Internet Explorer ® 7.0 немесе одан кейінгі нұсқасы;
        - оперативті жады: 2 Гб (4 ГБ ұсынылады);
        - кемінде 1024×768 рұқсат етілген және True Color режимін қолдайтын VGA мониторы (1600×1050 ұсынылады);
        - қатты диск: орнату үшін 6 Гб бос орын болу керек;
        - диск жетегі: DVD-ROM (бағдарламаны орнату үшін).
          Autocad 2016 программасы 64 разрядты  нұсқасы жұмыс істеуі үшін сізге мыналар қажет қажет:
        - операциялық жүйелер: AutoCAD 2023 64 разрядты нұсқасы үшін жоғарыдағы тізімнің барлығы;
        - процессор: AMD Athlon 64, AMD Opteron ™ , Intel ® EM64T қолдауымен Intel ® Xeon ® немесе Intel ® EM64T қолдауымен Intel ® Pentium ® IV (барлығы SSE2 технологиясымен);
        - браузер: Windows Internet Explorer ® 7.0 немесе одан кейінгі нұсқасы;
        - оперативті жады: 2 Гб (4 ГБ ұсынылады);
        - кемінде 1024×768 рұқсат етілген және True Color режимін қолдайтын VGA мониторы (1600×1050 ұсынылады);
        - қатты диск: орнату үшін 6 Гб бос орын болу керек;
        - диск жетегі: DVD-ROM (бағдарламаны орнату үшін).
          3D модельдеуге қажетті бағдарламалық және аппараттық құралдарға қойылатын қосымша талаптар:
        - процессор: Pentium ® IV немесе AMD Athlon 3 ГГц немесе одан жоғары; немесе 2 ГГц немесе одан жоғары екі ядролы Intel немесе AMD процессоры;
        - программаны орнату үшін қажет қатты дискідегі қосымша 6 Гб бос жады;
        - кемінде 128 Мб жады бар 1280×1024 экрандық ажыратымдылығы бар, сондай-ақ True Color режимін, Pixel Shader 3.0 технологиясын немесе одан кейінгі нұсқасын қолдайтын бейне адаптер; Direct3D ® қолдайтын жұмыс станциясы класының графикалық адаптері [1].
        
          </ReactMarkdown>
        </p>
        </>}
        {add === 3 && <>
        <h2 className="readRight__title">AutoCAD-ты іске қосу</h2>
        <p>
          AutoCAD-ты  іске қосу келесі жолдармен жүзеге асырылады:
          - тапсырмалар тақтасына менюден Start → Programs → Autodesk → AutoCAD 2023-ді таңдау керек; 
          - Windows жұмыс үстелінде Autocad 2023 белгішесін екі рет шерту керек.
            Іске қосылған кезде AutoCAD жаңа атаусыз сурет салуды ұсынады. Онда объектілерді құруды бастауға немесе бұрыннан бар файлдардың бірін дискіден жүктеуге болады. Бұрын дайындалған суретті ашқан кезде барлық жүйелік айнымалыларға онымен жұмыс істеудің соңғы сессиясында болған мәндер беріледі. Бұл айнымалылардың суретпен бірге файлда сақталуына байланысты. 
          Егер сіз "нөлден" бастасаңыз, алдымен бірқатар қондырғыларды орнатуыңыз керек. Бұл әдетте Wizard Description шеберінің көмегімен автоматты түрде жасалады. AutoCAD сізге қажет болса, сеанс кезінде де қондырғыларды өзгертуге мүмкіндік береді[1].
        </p>
        </>}
        {add === 4 && <>
        <h2 className="readRight__title">Анықтамалық жүйені шақыру</h2>
        <p>
          AutoCAD-пен жұмыс істеген кез келген уақытта бағдарлама бойынша электрондық құжаттамаға қол жеткізуге болады. Ол үшін менюден Help командасын таңдау керек (сурет 1.1). Пернетақтадағы F1 пернесін басу немесе командалық жолда «?» таңбаны енгізу арқылы балама вариантын қолдануға болады.
          <div>
            <img src="img/img1.png" alt="" />
            <p>1.1-сурет.   Анықтамалық жүйенің мәзірі</p>
          </div>
          
          Help мәзірі келесі бөлімдерді қамтиды:
          <li>Help – анықтамалық жүйені жүктеу;</li>
          <li>Download Offline Help – желіден тыс режимде жұмыс істеуге арналған анықтамалық жүйені жүктеу;</li>
          <li> 	Additional Resources – қосымша ресурстар:</li>
          <li>Support Knowledge Base – қолдау қызметінің білім базасы: жиі қойылатын сұрақтар, өнімнің соңғы жаңартулары туралы мәліметтер, пікірталас топтары туралы ақпарат, арнайы қолдау бағдарламалары (интернет байланысы қажет);</li>
          <li>Online Training Resources – интерактивті оқытуға арналған ресурстар: Autodesk уәкілетті оқу орталықтары және басқа оқу орталықтары туралы ақпарат, Сертификаттау туралы мәліметтер, пікірталас топтарына сілтемелер, Оқыту құралдары (интернетке қосылу қажет);</li>
          <li>Online Developer Center – интерактивті әзірлеуші орталығы: пайдаланушылар қойған сұрақтарға жауаптар, қолданба үлгілері, электрондық құжаттама(Интернет байланысы қажет)бар үнемі жаңартылып отыратын ресурстар;</li>
          <li>Developer Help –программистерге арналған құжаттама жүйесін жүктеу;</li>
          <li>Autodesk User Group International – бүкіл әлем бойынша Autodesk пайдаланушылар тобы;</li>
          <li>Send Feedback – кері байланыс (Интернет байланысы қажет);</li>
          <li>Customer Involvement Program… – Autodesk пайдаланушыларын тарту бағдарламасын жүктеу;</li>
          <li>Desktop Analytics... – жұмыс үстелінде талдау бағдарламасын жүктеу;</li>
          <li>About AutoCAD 2023 – ағдарлама туралы ақпаратты жүктеу [1].</li>
          
        </p>
        </>}
        {add === 5 && <>
        <h2 className="readRight__title">Сызбаларды ашу </h2>
        <p>
          AutoCAD бағдарламасы әдепкі бойынша DWG кеңейтімі бар файлға сызбаның ішкі көрінісін жазады. Суреттен басқа, файлда SNAP, GRID торын, ортогональды ORTHO режимін байланыстыру режимдерінің қосқыштарының мәндерін анықтайтын бірқатар параметрлер бар; қабылданған өлшем бірліктері және презентация дәлдігі; сурет шекаралары; қабаттарды ұйымдастыру; форматтар мен логотиптер; өлшем және мәтін стильдері; сызық түрлері және т.б.
          AutoCAD бірнеше сызбаларды бір уақытта ашуға мүмкіндік беретін көп терезелі Multiple Design Environment (KDE) жобалау ортасын ұсынады. Бір жұмыс сессиясында өнімділікті жоғалтпай шексіз сызбаларды ашуға болады. MODE ортасы нысандарды сүйреп апаруға, олардың түс, қабат, сызық түрі сияқты қасиеттерін бір суреттен екіншісіне көшіруге мүмкіндік береді. Ол ағымдағы команданың орындалуын үзбей немесе әрекеттер тізбегін бұзбай бірнеше сызбалармен қатар жұмыс істеуді қамтамасыз етеді. Бұл көптеген операцияларды жеңілдетеді және жұмыс тиімділігін арттырады [2].
          <br/><img className='ic' src="img/ic1.png" alt="" />Бар суреттерді ашу үшін менюден File → Open… (Ctrl+O) немесе жылдам қол жеткізу тақтасының Open… пиктограммасын шерту арқылы ашуға болады.
            Open пәрменіне қол жеткізгеннен кейін AutoCAD экранында Select File файлын таңдағаннан кейін  диалог терезесі пайда болады (1.2-сурет.). Мұнда тізімнен файлды таңдауға немесе File name: өрісіне атын енгізуге болады:

          <div>
            <img src="img/img2.png" alt="" />
            <p>1.2-сурет.Файлды таңдау диалогты терезесі</p>
          </div>

          Тізімде Preview аймағындағы файлдардың бірін бөлектеген кезде сәйкес үлгі үлгісі пайда болады. Views батырмасын басу тізімді көрсетеді, оның параметрлерін өзгерте отырып, пайдаланушы ашуға ұсынылған файлдардың көріну формасын таңдай алады: тізім, кесте, үлгілер.
          Open батырмасының оң жағындағы көрсеткіні басқан кезде (диалогтық терезенің төменгі оң жақ бұрышында) тізімде файлдарды ашу режимі орнатылады Open (ашу), Open Read Only (оқу үшін ашу), Partial Open  (ішінара ашу), Partial Open Read Only (ішінара оқу үшін ашық). Ішінара ашу тек белгілі бір қабаттарға немесе көрініс экранына жататын үлгі нысандарын жүктеуге мүмкіндік береді. Бұл үлкен файлдармен жұмыс істегенде пайдалы [2].
          Бірнеше сызбаны бір уақытта ашу үшін Shift немесе Ctrl пернелерін пайдаланып, Select file диалогты терезесінде қажетті файлдарды таңдау керек.
          Сонымен қатар, сызбаларды Windows Сілтеуіштен (Проводник) сүйреп апару арқылы ашуға болады. Ол үшін бумалар бұтағында таңдалған бір немесе бірнеше File Explorer файлдарын тышқанның көмегімен AutoCAD терезесінің кез келген бөлігіне сүйреп апару керек, мысалы, команда жолы немесе түймелермен қамтылмаған құралдар тақтасының бөлігі. Егер бір файлды ашық сызбаның сызба алаңына сүйреп апарылса, онда сүйреп апарылған құжаттың мазмұны сыртқы сілтеме ретінде ағымдағы сызбаға енгізіледі.
            Суретті ашу үшін Windows Проводник-дегі тиісті файлдың атауын екі рет шертуге  болады, нәтижесінде AutoCAD автоматты түрде іске қосылады.
          Егер жүйеде AutoCAD-та жұмыс сессиясы болса, онда сурет ашылады. AutoCAD-та суреттердің кішкене бөліктерін көруге, сурет файлдарын ашуға және оларды іздеуге арналған арнайы құрал бар. Оны бір немесе бірнеше дискілердегі қалта құрылымындағы файлдарды іздеу үшін пайдалануға болады.
            1.3 суретте көрсетілгендей  Find файлдарын қарау және іздеу диалог терезесін жүктеу үшін., Select File диалог терезесінде Tools → Find.... батырмаларын ретімен басу керек.

            <div>
            <img src="img/img3.png" alt="" />
            <p>1.3-сурет. Файлды іздеу және қарау диалогты терезесі</p>
          </div>
          

          Find диалогтық терезесінің Name & Location қосымшасы файлдың атын, кеңейтімін және іздеу аймағын көрсетеді.
          AutoCAD файлдарды жасалған күндері бойынша іздеу диалогтық терезесінің Date Modified қойындысын пайдаланып іздеуге мүмкіндік береді (1.4-сурет.). Мұнда көрсетілген екі күн арасында немесе соңғы күндер мен айлардың белгілі бір санында жасалған немесе өзгертілген файлдарды іздеу ұйымдастырылады. Табылған құжаттардың атаулары тілқатысу терезесінің төменгі жағында көрсетіледі [2].

        </p>
        </>}
        {add === 6 && <>
        <h2 className="readRight__title">Сызбаларды құру</h2>
        <p>
          Сызбаны құру кезінде әртүрлі стандарттарды қолдануға болады. Кейде олар мемлекеттік және салалық стандарттармен немесе кәсіпорын нормаларымен, кейде Тапсырыс берушінің талаптарымен белгіленеді. Тікелей орындаушылар үшін де, жобаның орындалу барысын бақылайтын топ жетекшілері үшін де маңызды мәселе – сызбаның бастапқы параметрлерін сауатты дайындау
          <div>
            <img src="img/img4.png" alt="" />
            <p>1.4-сурет.  Файлды іздеу қосымшасы</p>
          </div>
          

          AutoCAD-та кез-келген алдыңғы нұсқада жасалған сызбалар кез-келген 2016 нұсқасы сияқты ашылады және автоматты түрде жаңа форматқа ауыстырылады.

        </p>
        </>}
        {add === 7 && <>
        <h2 className="readRight__title">СЫЗБАЛАР</h2>
        <p>
          Сызбаны жасау кезінде әртүрлі стандарттарды қолдануға болады. Кейде олар мемлекеттік және салалық стандарттармен немесе кәсіпорын нормаларымен, кейде Тапсырыс берушінің талаптарымен белгіленеді. Тікелей орындаушылар үшін де, жобаның орындалу барысын бақылайтын топ жетекшілері үшін де маңызды мәселе – сызбаның бастапқы параметрлерін сауатты дайындау.
          Мысал ретінде сәулет жобасын қарастырайық. Ол көптеген бөлімдерді қамтуы мүмкін: еден жоспарлары, су, жылыту, желдету желілерінің схемалары және т.б. әдетте жобаның әр бөлімі жеке бөлімшеде жасалады, сондықтан біріктіру мәселесі өткір болып табылады. Оның ең сауатты шешімі-барлық орындаушыларды қолданылатын бірліктер жүйесіне бейімделген және стандартты жақтауды, негізгі жазуды, қабаттар мен сызық түрлерін қамтитын шаблон файлдарымен қамтамасыз ету. Мәтіндік жазулар, көлеңкелеу және өлшемдерді қолдану үшін қандай стильдер қолданылатыны бірдей маңызды. Олар сондай-ақ алдын ала орнатылуы керек: бұл әрбір дизайнердің белгіленген стандарттардан ауытқусыз әрекет ететініне кепілдік береді [3].
          Жұмыс ауқымын таңдауға жауапкершілікпен қарау керек. Экрандағы сурет бірліктері мен плоттерге шығарылатын сызба бірліктерінің өзара байланысы туралы нақты түсінік қана береді,  түсіндірме жазулар мен өлшемдер үшін мәтіннің биіктігін дұрыс таңдауға мүмкіндік береді.
          Сызбаның орналасуы әдетте дизайнның соңғы кезеңдерінде жасалғанымен, алдын ала кезеңдерде дұрыс жоспарлау көптеген қателіктерді болдырмайды және қызметкерлерді қажетсіз өңдеу әрекеттерінен құтқарады. Жобаны құру кезінде жұмыс, әдетте, модель кеңістігінде жүзеге асырылады (мұнда объектілер нақты мөлшерде ұсынылады), ал сызбаны құру үшін парақтың кеңістігіне көшу жүзеге асырылады, онда барлық графикалық объектілерге, мәтіндерге, сызықтардың түрлеріне және өлшемдеріне қажетті масштаб коэффициенті қолданылады [3].
          Суреттің барлық бастапқы қондырғыларын кейінірек басқа құжаттарда пайдалану үшін шаблонға сақтауға болады. Үлгі ретінде AutoCAD-пен бірге жеткізілетін сызбаларды да, кез-келген басқа, соның ішінде пайдаланушы жасаған сызбаларды да қолдануға болады. Жаңа сурет пайдаланылған үлгідегі барлық ақпаратты мұра етеді. Сондай-ақ, AutoCAD-ты шаблонсыз іске қосу мүмкіндігі бар.
          <br/><img className='ic' src="img/ic2.png" alt="" />  - Жаңа сурет жасауға File → New мәзірінен шақырылған New командасы мүмкіндік береді... (Ctrl+N) немесе жаңа жылдам қол жеткізу тақтасының белгішесін шерту керек.
          Команданы іске қосқаннан кейін Select template шаблонын таңдау диалогтық терезесі ашылады (1.5-сурет) (егер STARTUP жүйелік айнымалысының мәні 0 - ге орнатылған болса).
          Егер Startup жүйелік айнымалысының мәні 1-ге орнатылса, онда жаңа пәрменді іске қосқаннан кейін жаңа сурет салу үшін жаңа сурет салу диалогтық терезесі пайда болады (1.6-сурет), онда AutoCAD жұмыс ортасының параметрлеріне қажетті параметрлер жасалады.

          <div>
            <img src="img/img6.png" alt="" />
            <p>1.5-сурет.  Шаблон таңдайтын диалогты терезесі</p>
          </div>
          


          <div>
            <img src="img/img7.png" alt="" />
            <p>1.6-сурет.  Жаңа сызбаға арналған диалогты терезесі</p>
          </div>
          

          <br/><img className='ic' src="img/ic3.png" alt="" /> Қарапайым шаблон бойынша сурет салу кезінде Start from Scratch белгішесі қолданылады. Бұл режимде Британдық немесе метрикалық бірліктер жүйесі орнатылады. Әдепкі бойынша қабылданған көптеген жүйелік айнымалылардың мәндері екі жүйенің қайсысы таңдалғанына байланысты. Бұл айнымалылар мәтінді, өлшемдерді, торды режимдерін басқарады:
          Imperial (feet and inches) - acad шаблоны бойынша британдық бірлік жүйесін (фут пен дюйм) қолданатын сурет жасалады.dwt. Бұл жағдайда сурет салу аймағы, әйтпесе сурет шегі деп аталады, 12×9 дюймге тең болады;
          Metric - acadiso шаблоны бойынша өлшем бірліктерінің метрикалық жүйесі (миллиметр) қолданылатын сурет жасалады.dwt. Бұл жағдайда сурет салу аймағы 429×297 мм орнатылады.
          <br/><img className='ic' src="img/ic4.png" alt="" /> Шаблонды пайдаланып сурет салу үшін, жаңа сызбаның негізі ретінде орнатылатын құжат, Create New Drawing тілқатысу терезесінде Use a Template белгішесін басу керек және Select a Template тізімінде: қажетті сызба параметрлерін қамтитын қажетті үлгіні көрсету керек (сурет. 1.7). Тізімде Options Параметрлер тілқатысу терезесінде орнатылған стандартты жолдан табылған dwt кеңейтімі бар шаблон файлдарының атаулары келтірілген. Үлгілерде әртүрлі үлгі параметрлері, соның ішінде арнайы жасалған қабаттар, сызық түрлері және түрлер жиынтығы анықталады;
          <div>
            <img src="img/img8.png" alt="" />
            <p>1.7-сурет. Шаблон үлгісін таңдау</p>
          </div>
          

            AutoCAD – та wizard дайындық шебері деп аталады-бұл жаңа сурет жасауға арналған қызмет құралы. Дайындық шеберінің көмегімен сіз ағымдағы үлгіні негізге ала отырып, кейбір негізгі қондырғыларды өзгерте аласыз [3].
          Мысалы, пайдаланушы суреттің жалпы өлшемдеріне байланысты мәтін үшін масштабтау коэффициенттерін автоматты түрде реттей алады. Егер сызбалар үлкен болса, таңбалардың үлкен биіктігі таңдалады, егер кішкентай болса – кішірек; осылайша, сурет экранда толығымен көрсетілген кезде мәтіндік жазулардың түсінікті болуы қамтамасыз етіледі.
          <br/><img className='ic' src="img/ic5.png" alt="" /> Дайындық шеберін шақыру үшін Create New Drawing тілқатысу терезесінде Use a Wizard белгішесін басу керек-1.8-суретте көрсетілген терезе ашылады

          <div>
            <img src="img/img27.png" alt="" />
            <p>1.8-сурет.  Дайындық шеберінің көмегімен жаңа сурет салу</p>
          </div>
                

            QuickSetup жылдам орнату шебері (1.9-сурет. ) жаңа сурет үшін Units бірліктерін және Area сызу аймағын орнатуға мүмкіндік береді. Сурет салу және сызу үшін бірліктердің келесі түрлеріне қолдау көрсетіледі: ондық – Decimal, Engineering – инженерлік, Architectura – архитектуралық, Fractional - бөлшектік, Scientific-ғылыми.
          Әрі қарай, сурет салудың Width мен Length ұзындығын көрсете отырып, пайдаланушы сызбаның шекаралық шектерін, лимиттер деп атайды. Бұл сызбаның өлшемін анықтайтын лимиттер, содан кейін плоттерге шығарылады.
          Барлық параметрлер орнатылғаннан кейін, жылдам дайындық шебері модель кеңістігінде сурет салу сеансын бастайды.
          
          <div>
            <img src="img/img10.png" alt="" />
            <p>1.9-сурет. Жылдам дайындық шебері тілқатысу терезесі
</p>
          </div>
          Advanced Setup егжей-тегжейлі дайындық шебері (1.10-сур) жаңа сурет үшін Units сызықтық бірліктерінің түрін және Angle Measure бұрыштарды өлшеу әдісін орнатуға, Angle Direction Өлшем бұрышын санаудың басталуын және бұрыштық бағыттың бұрышын өлшеу бағытын көрсетуге, Area сызба аймағының шекараларын анықтауға мүмкіндік береді. Тек модель кеңістігін реттейтін жылдам дайындық шеберінен айырмашылығы, егжей-тегжейлі дайындық шебері модель кеңістігіне де, парақтың кеңістігіне де әсер етеді.
          
          <div>
            <img src="img/img28.png" alt="" />
            <p>1.10-сурет. Егжей-тегжейлі дайындық шебері тілқатысу терезесі
</p>
          </div>
        </p>
        </>}
        {add === 8 && <>
        <h2 className="readRight__title">Шаблон туралы толығырақ </h2>
        <p>
          Орнатылған сеанс параметрлерінің жиынтығын кейіннен жасалған сызбалар үшін қол жетімді етуге болады. Ол үшін құжатты шаблон ретінде сақтау керек. Шаблон әдетте ешқандай графикалық нысандарды қамтымайтын және тек жүйелік айнымалылардың стандартты мәндерін сақтау үшін қолданылатын үлгі болып табылады. 
          Үлгілер (dwt кеңейтімі бар файлдар) – бірдей параметрлері бар суреттер жиынтығын құрудың өте ыңғайлы құралы. Autocad-пен бірге келетін және пайдаланушы жасаған шаблондарды қолдануға болады. Кез-келген үлгіні шаблон ретінде сақтауға болады. Бұл жағдайда сақталған құжатты орнатудың барлық параметрлерінің мәндері оның негізінде жасалған барлық жаңа суреттерге мұра болады [3]. 
          Кез-келген үлгі шаблон ретінде жарамды болғанымен, ең жақсы әдіс-жиі қолданылатын қондырғылар мен негізгі элементтер ұсынылатын стандартты шаблондар жиынтығын дайындау:
          <li>бірлік көрінісінің түрі мен дәлдігі;</li>
          <li>сурет лимиттері; </li>
          <li>SNAP, GRID торы және ортогональды ORTHO режимін байланыстыру қадамдарының параметрлері; </li>
          <li>қабаттарды ұйымдастыру;</li>
          <li>негізгі жазулар, жақтаулар және логотиптер;</li>
          <li>өлшем және мәтін стильдері;</li>
          <li>сызықтардың түрлері мен салмақтары (қалыңдығы). </li>
          Шаблон негізінде жасалған сызбаға енгізілген өзгерістер шаблонның өзіне қолданылмайды.
        </p>
        </>}
        {add === 9 && <>
        <h2 className="readRight__title">Сурет шекараларын анықтау</h2>
        <p>
        <br/><img className='ic' src="img/ic6.png" alt="" />  LIMITS командасы модель кеңістігінде және Парақ кеңістігінде ағымдағы сызбаның шекараларын орнатуға мүмкіндік береді. Ол Format → Drawing limits мәзірінен шақырылады.
            Сызбаның шекаралары - бұл әлемдік координаттар жүйесіндегі екі өлшемді нүктелер жұбы: тікбұрышты аймақты анықтайтын сол жақ төменгі және оң жақ жоғарғы бұрыштардың координаттары. Z осі бойынша шекаралар белгіленбейді [4].
          LIMITS командасының: 
          Reset Model space limits: – модель кеңістігінің шектеулерін қайта орнату, 
          Specify lower left corner or [ON/OFF] : – төменгі сол жақ бұрыш, 
          Specify upper right corner: – жоғарғы оң жақ бұрыш, онда:
          ON – шекаралардың сақталуын бақылау енгізіледі. Бұл жағдайда AutoCAD сызбаның шекарасынан тыс координаттары бар нүктелерді енгізудің барлық әрекеттерін жоққа шығарады; 
          OFF – сурет шекараларының сақталуын бақылау өшіріледі; 
          {'<current>'} -  ағымдағы мән қолданылады. 
          Егер сурет шекараларының ағымдағы мәні сізге сәйкес келсе, Enter пернесін басу жеткілікті. 
          Шектеулер толық масштабты модельді толығымен қамтуы керек. Мысалы, егер оның өлшемдері 100×200 мм болса, шектеу мәндері осы сандардан сәл асып кетуі керек.
          Парақ кеңістігінде шектеулер әдетте қағаз парағының форматына тең болады. Сондықтан, Тор (егер ол қосылған болса) графикалық нысандарды, өлшем элементтерін, негізгі жазуды және т.б. қоса алғанда, барлық құрастырылған сызбаны қамтиды, Мысалы, егер парақтың форматы 210×297 мм болса, ондық форматты орнатып, шектерді тіктөртбұрыштың төменгі сол жақ бұрышы үшін 0,0 және оң жақ жоғарғы жағы үшін 210,297 нүктелерімен анықтау керек бұрыш.
          Егер Парақ кеңістігінде Парақ өрістері көрсетілсе немесе берілген формат қойылса, LIMITS пәрменін пайдаланып сурет шекараларын орнату мүмкін емес. Бұл жағдайда лимиттер таңдалған парақтың өлшемдеріне байланысты есептеледі және белгіленеді. Өрістерді көрсету мен парақты белгілеуді қосу және өшіру Options диалогтық терезесінің Display қосымшасында жасалады.
          Модель кеңістігінде лимиттерді жылдам дайындық шебері немесе егжей-тегжейлі дайындық шебері көмегімен жаңа сурет салу кезінде орнатуға болады.

        </p>
        </>}
        {add === 10 && <>
        <h2 className="readRight__title">Тор параметрлерін анықтау</h2>
        <p>
          Тор реттелген нүктелер тізбегі болған алғашқы нұсқалардан айырмашылығы, AutoСad 2016-да Grid тор дәптер парағына ұқсайды және суреттің бүкіл аймағын қамтиды. Торды пайдалану нысандарды туралауға және олардың арасындағы қашықтықты бағалауға көмектеседі. Торды басқа командаларды орындау кезінде қосуға және өшіруге болады. Ол мөрге шығарылмайды.
          <br/><img className='ic' src="img/ic7.png" alt="" /> Торды қосу және оның жиілігін анықтау сурет салу параметрлері диалогтық терезесінің Snap and Grid қосымшасында жүзеге асырылады (сурет. 1.11), ол Tools → Drafting Settings… мәзірінен жүктеледі немесе Grid Settings… параметрін таңдағанда күй жолағындағы Display drawing grid түймесін тінтуірдің оң жақ түймешігімен басу арқылы шақырылатын мәтінге негізделген мәзір болып табылады.      
          <li>Grid On (F7) (GRIDMODE жүйелік айнымалысы) белгісін қойғанда тор қосылады</li>	
          <li>Grid style аймағындағы мән екі өлшемді модельдеу кезінде тор cтилімен анықталады (GRIDSTYLE жүйелік айнымалысы):</li>
            <li>2D model space - екі өлшемді модель кеңістігі үшін нүктелік тор стилін орнатады;</li>
            <li>Block editor-блок редакторы үшін нүктелік тор стилін анықтайды;</li>
            <li>Sheet/layout-Парақ үшін нүктелік тор стилін орнатады.</li>  
          <div>
            <img src="img/img29.png" alt="" />
            <p>1.11-сурет.   Тор параметрлерін және бекіту қадамын анықтау тілқатысу терезесі
</p>
          </div>

          Grid spacing аймағында тордың көлденең және тік бөліну жиілігі орнатылады:
          <li>Grid X spacing – - X осі бойынша тор қадамы (GRIDUNIT жүйелік айнымалы);</li>
          <li>Grid Y spacing – - Y осі бойынша тор қадамы (GRIDUNIT жүйелік айнымалысы);</li>
          <li>Major line every: - негізгі сызық қадамы(GRIDMAJOR жүйелік айнымалы)..</li>
          <li>Grid behavior аймағында тордың қасиеттері анықталады (GRIDSTYLE жүйелік айнымалысының 0 мәні)::</li>
          <li>Adaptive grid – торды орнату (GRIDDISPLAY жүйелік айнымалы);</li>
          <li>Allow subdivision below grid spacing - қол жетімді тор аралығын бөлуге рұқсат етіңіз (GRIDDISPLAY және GRIDMAJOR жүйелік айнымалылары);</li>
          <li>Display grid beyond Limits – шектен тыс торды көрсету (GRIDDISPLAY жүйесін өзгерту);</li>
          <li>Follow Dynamic UCS – торы XY динамикалық PSC жазықтығында көрсетіледі (GRIDDISPLAY жүйелік айнымалы).</li>
          Суретпен жұмыс істеу кезінде торды қосу және өшіру күй жолағындағы дисплей сызбасы торын басу немесе F7 функция пернесін басу арқылы жүзеге асырылады.
          Үлгіні масштабтағаннан кейін, экранды үлкейтудің жаңа коэффициентімен жақсырақ сәйкестендіру үшін тор жиілігін өзгерту қажет болуы мүмкін [4].

        </p>
        </>}
        {add === 11 && <>
        <h2 className="readRight__title">Point (Нүкте) командасы</h2>
        <p>
            Нүктені құрайтын point командасы Draw → Point мәзірінен немесе Home таспасының Draw тобындағы Multiple Point белгішесін басу арқылы шақырылады.
          Нүкте оның координаттарын көрсету арқылы анықталады. Point командасының сұраулары: 
          Current point modes: PDMODE=33 PDSIZE=10.0000 – нүктенің ағымдағы режимдері
          Specify a point: – нүктені көрсету
          Төменгі мәзірде екі нүкте құру режимі ұсынылады:
          	Single Point – жалғыз нүкте;
          	Multiple Point – бірнеше нүкте.
          Home таспасының Draw тобындағы Point пиктограммасы бірнеше нүкте құру режимін қолданады.
          Нүктелер, мысалы, нысанды байланыстыру және қашықтықты санау үшін түйіндер немесе сілтемелер ретінде пайдалы болуы мүмкін. Нүкте таңбасының пішіні және оның өлшемі экран өлшеміне қатысты немесе абсолютті бірліктерде орнатылады [5]. 
          Нүктенің пішінін PDMODE жүйелік айнымалысы арқылы және оның өлшемін PDSIZE айнымалысы арқылы орнатуға болады.
          Егер PDSIZE оң болса, ол нүкте маркерінің абсолютті өлшемін көрсетеді, ал теріс болса, Өлшем монитор экранының өлшемінің пайызымен көрсетіледі. Соңғы жағдайда нүкте таңбасының шамасы кескіннің ағымдағы масштабына қатысты өзгермейді.
          <br/><img className='ic' src="img/ic8.png" alt="" /> PDMODE және PDSIZE жүйелік айнымалы мәндерін Point Style диалогтық терезесінде орнату Керек (сурет. 2.2). Ол Format    point style.... мәзірінен шақырылады.
          Нүкте маркерінің өлшемі Point Size: өрісінде орнатылады. Сонымен қатар, егер Set Size Relative to Screen опциясы таңдалса-маркер өлшемі монитор экранының өлшемінің пайызымен анықталады, ал егер Set Size in Absolute Units опциясы таңдалса – маркердің абсолютті өлшемі көрсетіледі [5].

        </p>
        </>}
        {add === 12 && <>
        <h2 className="readRight__title">Line (Кесінді) командасы</h2>
        <p>
            AutoCAD-тағы негізгі примитив-бұл сызық. Сызықтар әр түрлі болады – бір сегменттер, сынған (доғалары бар немесе оларсыз – сызықтар бойынша), параллель сызықтар (көп сызықтар), сондай - ақ эскиздер.
            <br/><img className='ic' src="img/ic9.png" alt="" /> Сегментті құрайтын LINE пернесі  Draw   <img className='ic' src="img/ic101.png" alt="" />    Line мәзірінен немесе Home таспасының Draw тобындағы Line белгішесін басу арқылы шақырылады.	
          Сегменттер жалғыз немесе сынған сызыққа біріктірілуі мүмкін. Дегенмен сегменттер соңғы нүктелерде жанасады, олардың әрқайсысы жеке объект болып табылады. Сегменттер әр сегментпен жеке жұмыс қажет болған жағдайда қолданылады; егер сызықтық сегменттер жиынтығы бір объектіні бейнелейтін болса, полисызықтарды  қолданған дұрыс. Сегменттер тізбегі жабық болуы мүмкін - бұл жағдайда соңғы сегменттің соңы біріншінің басына сәйкес келеді.
            LINE командасының сұраулары:
            Specify first point: – кесінді бастапқы нүктесі
          Specify next point or [Undo]: – кесіндінің соңғы нүктесі 
          Specify next point or [Undo]: 
          Specify next point or [Close/Undo]:
          Specify next point or [Close/Undo]: 
          LINE командасының сұраулары циклдік түрде ұйымдастырылған. Бұл дегеніміз, үздіксіз сынған сызық салу кезінде алдыңғы сегменттің соңы келесінің басы болады. Кресттің артындағы әрбір келесі нүктеге жылжу кезінде "резеңке жіп" созылады. Бұл сынған сызықтың салынып жатқан бөлігінің орнын бақылауға мүмкіндік береді. Сонымен қатар, сынған сызықтың әр сегменті жеке қарабайыр болып табылады [6].
          Цикл келесі specify next point or [Close/Undo]: сұрауына жауап ретінде Enter пернесін басқаннан кейін аяқталады. Тінтуірдің оң жақ пернесін шерту, содан кейін пайда болған жанама менюден  Enter элементін таңдау ұқсас нәтижеге әкеледі.
          Line командасының кілттері:
          	Close-сынған жабу;
          	Undo-соңғы сызылған сегментті жою.

        </p>
        </>}
        {add === 13 && <>
        <h2 className="readRight__title">XLINE және RAY (Түзулер мен сәулелер) командалары</h2>
        <p>
            AutoCAD-та бір немесе екі бағытта аяқталмайтын сызықтар салуға рұқсат етіледі. Мұндай сызықтар сәйкесінше сәулелер мен түзулер деп аталады. Оларды басқа объектілерді салуда көмекші ретінде пайдалануға болады.
          Шексіз сызықтардың болуы сызбаның шекараларын өзгертпейді. Демек, шексіз сызықтар масштабтау процесіне және көрініс экрандарына әсер етпейді. Түзулер мен сәулелерді кез келген басқа нысандар сияқты жылжытуға, бұруға және көшіруге рұқсат етіледі. Шексіз сызықтарды плоттерге шығарар алдында мұздатуға немесе өшіруге болатын бөлек қабатқа салу ұсынылады [6].
          <br/><img className='ic' src="img/ic10.png" alt="" />  Түзуді құрайтын XLINE пәрмені Draw → Construction Line мәзірінен немесе Home мәзірінің Draw тобындағы Construction Line белгішесін басу арқылы шақырылады.
            Түзулер үш өлшемді кеңістіктің кез келген жерінде орналасуы мүмкін. Тікелей бағдарлауды орнатудың әртүрлі тәсілдері бар. Әдепкі бойынша, түзу оның бағытын көрсететін екі нүктені көрсету арқылы құрылады. Бірінші нүкте түбір деп аталады - түзудің шартты ортасы.
          XLINE командасының сұраулары:
          Specify a point or [Hor/Ver/Ang/Bisect/Offset]: – нүктені көрсету
          Specify through point: – түз арқылы жүретін нүктені көрсету 
          Specify through point:

            XLine командасының кілттері:
          	Hor-берілген нүктеден өтетін көлденең түзудің құрылысы;
          	Ver-берілген нүктеден өтетін тік түзудің құрылысы;
          	Ang-нүкте мен бұрыш бойынша түзу сызу. Түзулерді салу үшін бұрышты орнатудың екі әдісі бар. Сіз тірек сызығын таңдап, оның және түзудің арасындағы бұрышты көрсете аласыз немесе (көлденең оське белгілі бір бұрышта жатқан түзуді салу үшін) түзудің өтетін бұрышы мен нүктесін көрсете аласыз. Салынған сызықтар әрқашан ағымдағы PSC ге параллель болады;
          	Bisect-нүкте мен бұрыштың жартысы, үш нүктемен берілген. Бұл кез-келген бұрышты екіге бөлетін түзу жасайды. Бұрыштың шыңын және оны анықтайтын сызықтарды көрсету керек;
          	Offset - базалық сызықтан тыс. Бұл кез-келген негізгі сызыққа параллель түзу жасайды. Орын ауыстыру шамасын белгілеп, негізгі сызықты таңдап, содан кейін түзу сызықтың қай жағынан өтуі керектігін көрсету керек.

          <br/><img className='ic' src="img/ic11.png" alt="" /> Сәулені құрайтын RAY командасы Draw→  Ray мәзірінен шақырылады.

            Сәуле-берілген нүктеден басталып, шексіздікке дейін созылатын үш өлшемді кеңістіктегі сызық. Екі жағынан да түзу, шексіз емес, сәуленің тек бір бағытта аяқталуы болмайды. Түзу сызықтардың орнына сәулелерді қолдану өрнектің бітелуіне жол бермейді. Түзу сызықтар сияқты, сәулелерді оның шекарасындағы сурет экранға шығарылатын командалар елемейді.
          RAY командасының сұраулары:
          Specify start point: – бастапқы нүктені көрсету
          Specify through point: – сәуле арқылы өтетін нүктені көрсетіңіз

        </p>
        </>}
        {add === 14 && <>
        <h2 className="readRight__title">Multiline (мультисызықтар) командасы</h2>
        <p>
        <br/><img className='ic' src="img/ic12.png" alt="" />   Көп жолды құрайтын MLINE командасы Draw → Multiline мәзірінен шақырылады. Көп сызық оның элементтері деп аталатын параллель сызықтар шоғырынан тұрады (2.3-сурет. ). Сіз көп жол стильдерін жасай аласыз және сақтай аласыз немесе әдепкі стильді қолдана аласыз (екі элементтен тұратын көп жол). Әр элемент үшін сызықтың түсі мен түрі көрсетіледі; элементтердің сәйкес шыңдары сегменттермен қосылады. Көп сызықтарда сегменттер 	немесе доғалар сияқты әртүрлі түрдегі соңғы шектеулер болуы мүмкін.
          MLINE командасының сұраулары:
          <li>Current settings: Justification = Top, Scale = 20.00, Style = STANDARD - ағымдағы келтірілім</li>
          <li>Specify start point or [Justification/Scale/STyle]: – бастапқы нүктені көрсету</li>
          <li>Specify next point: – келесі нүктені көрсету</li>
          <li>Specify next point or [Undo]: – келесі нүктені көрсету</li>
          <li>Specify next point or [Close/Undo]: – келесі нүктені көрсету</li>
          <li>Specify next point or [Close/Undo]:</li>

          MLINE командасының кілттері:
          <li>Justification-сызудың басталу нүктесінің орнын анықтау: жоғарғы Top, нөлдік орталық Zero, төменгі Bottom. Сызық сәйкесінше берілген нүктеден максималды оң, нөлдік немесе максималды теріс болып аралас өтеді;</li>
          <li>Scale-масштабтау коэффициенті. Сызықтар арасындағы араласу стильде анықталған Offset шамасына көбейтілген берілген коэффициентке тең;</li>
          <li>Style – стиль таңдау.</li>
          Көп сызықты құру кезінде көп сызықты стиль қолданылады. Ол <br/><img className='ic' src="img/ic13.png" alt="" />  Multiline Styles тілқатысу терезесінде жасалады, ол Format → Multiline Style… мәзірінен шақырылады. (2.4-сурет. ).
          Load... жүктеу түймесін басу арқылы бар стильді жүктеуге болады,  Save… түймесін басу арқылы жаңадан жасалған стильді сақтауға болады. Әдетте STANDARD стилі ағымдық болып табылады.
          Жаңа стиль жасау үшін New... батырмасын басу керек, жаңа стиль атауы өрісіндегі Create New Multiline Style мәзіріндегі New Style Name: өрісінде құруға  болады (2.4-сурет. ).	  
          <div>
            <img src="img/img11.png" alt="" />
            <p>2.4-сурет. Көп жол стилін құру диалогтық терезесі</p>
          </div>

          <div>
            <img src="img/img12.png" alt="" />
            <p>2.5-сурет. Көп жолдың қасиеттерін анықтау диалогтық терезесі
</p>
          </div> 
          Бұл терезеде көп жолдың қасиеттері анықталады. 
          <li>Description өрісінде: көп сызықты стильдің сипаттамасы орналастырылған. </li>
          <li>Caps ұштарының пайда болу аймағында соңғы элементтердің түрі анықталады:</li>
          <li>Line: - сызық;</li>
          <li>Outer arc: - сыртқы доға;</li>
          <li>Inner arcs: - ішкі доғалар;</li>
          <li>Angle: - соңғы элементтің көп сызыққа көлбеу бұрышының шамасы.</li>
          <li>Fill аймағында көп сызықты түспен толтыру қамтамасыз етіледі және фон түсі анықталады.</li>
          <li>Display joints аймағында: буындарды көрсету тағайындалады.</li>
          <li>Elements аймағында мультисызық элементтерінің параметрлері реттеледі:</li>
          <li>Offset, Color және Linetype өрістері сәйкесінше сызықтың түсін және түрін көрсетеді;</li>
          <li>Add және Delete түймелерін жоғарыдағыларды қосуға және жоғарыда көрсетілген Offset, Color және Linetype мәндерін жоюға болады;</li>
          <li>Offset өрісінде: көп сызықты сызықтардың бір-біріне қатыстылығы анықталады;</li>
          <li>Color тізімінде: ұсынылған әр жолдың түсі орнатылады;</li>
          <li>Linetype... түймесі сызық түрін анықтауға арналған Select Linetype диалогты терезесін көрсетеді.</li>

        </p>
        </>}
        {add === 15 && <>
        <h2 className="readRight__title">Polyline (полисызықтар) командасы</h2>
        <p>
        <br/><img className='ic' src="img/ic14.png" alt="" />  PLINE командасы менюден Draw → Polyline командасын ашып, таңдауға болады. 
            Полисызықтар сызықтық және доғалық сегменттердің байланысты тізбегі болып табылады және жүйемен графикалық қарабайыр ретінде өңделеді. Полисызықтар сегменттер жиынтығымен жұмыс қажет болған жағдайда қолданылады, бірақ оларды жеке өңдеуге рұқсат етіледі. Жеке сегменттердің немесе полисызықтарды тарылтуға немесе оны жабуға болады. Доға сегменттерін салу кезінде доғаның бірінші нүктесі алдыңғы сегменттің соңғы нүктесі болып табылады. Доғалар бұрышты, центрді, бағытты немесе радиусты көрсету арқылы сипатталады. Сонымен қатар, доғаны екінші және соңғы нүктелерді көрсету арқылы салуға болады [7].
          PLINE командасының сұраулары:
            Specify start point: – бастапқы нүктені белгілеу
          Current line-width is 0.0000 – ағымдағы полилинияның ені
          Specify next point or [Arc/Halfwidth/Length/Undo/Width]: – келесі нүктені белгілеу
          Specify next point or [Arc/Close/Halfwidth/Length/Undo/Width]: – келесі нүктені белгілеу

          PLINE командасының сұраулары циклдік түрде ұйымдастырылған. Цикл келесі пәрмен сұрауына жауап ретінде Enter пернесін басқаннан кейін аяқталады. Тінтуірдің оң жақ түймешігімен нұқу, содан кейін пайда болған мәтін мәндік мәзірден Enter элементін таңдау ұқсас нәтижеге әкеледі.
          PLINE командасының кілттері:
           Arc-доға режиміне өтуді қамтамасыз етеді;   
           Жабу-полилинді сегментпен жабады. Соңғы сегмент әдеттегіден айтарлықтай ерекшеленеді, соңғы нүктеден бастапқы нүктеге дейін.
          Олар полилиндерді өңдеу және тегістеу кезінде, сондай-ақ кең сегменттердің буындарының бұрыштарын кесу кезінде әр түрлі өңделеді. Әрдайым дерлік соңғы сегменттерді қолданған жөн;
            Halfwidth-жартылай орнатуға мүмкіндік береді, яғни кең сегменттің осьтік сызығынан шетіне дейінгі қашықтық;
            Length-алдыңғы бағыттың жалғасы ретінде жасалған сегменттің ұзындығын сол бағытта белгілейді;
          Undo-соңғы жасалған сегментті жояды;
            Ені-келесі сегменттің Шири орнатуға мүмкіндік береді. AutoCAD бастапқы және соңғы Шири сұрайды. Енгізілген бастапқы ені автоматты түрде соңғы ені әдепкі бойынша орнатылады. Кең сызықтық сегменттердің басталу және аяқталу нүктелері полилиния осінде жатыр. Әдетте полилиннің іргелес кең сегменттерінің бұрыштық буындары кесіледі; ерекшелік сызықтық сегменттер іргелес доғалық сегменттерге жанама емес, сондай-ақ конвергенция бұрыштары өте өткір немесе штрих-нүктелік сызықтар қолданылатын жағдайлар жасалады [7].
          Доға құру режиміндегі PLINE командасының кілттері:
          	Angle-орталық бұрышты енгізіңіз. Әдепкі бойынша, доға сағат тіліне қарсы бағытта көрсетіледі. Егер доғаны сағат тілімен салу қажет болса, бұрыштың теріс мәнін орнату керек;
          	Center - доғаның ортасын көрсету;
          	Close - доғамен жабу;
          	Direction - тангенс бағытын орнату;
          	Halfwidth – полисызықтардың жартысын анықтау;
          	Line-сегменттерді құру режиміне өтіңіз;
          	Radius-доғаның радиусын енгізіңіз;
          	Second pt – үш нүкте бойынша доғаның екінші нүктесін көрсету. Егер доға полилиннің бірінші сегменттері болмаса, онда ол алдыңғы сегменттің соңғы нүктесінен басталып, әдепкі бойынша оған жанама түрде сызылады;
          	Undo-соңғы нүктені болдырмау;
          	Width-полилиннің енін анықтау.
          Мысалы. Қалыңдығын орнатумен полисызық салу
          <div>
            <img src="img/img13.png" alt="" />
            <p>2.6 суретте көрсетілген полисызықты салыңыз</p>
          </div>. Draw→ Polyline мәзірі арқылы PLINE командасын шақыру  арқылы іске қосыңыз. Сұрауларға жауап беріңіз:

          _ PLINE
          Specify start point: 40,10 – 1-ші нүкте
          Current line-width is 0.0000
          Specify next point or [Arc/Halfwidth/Length/Undo/Width]: W – полисызық енін келтіру режиміне өту			
          Specify starting width {'<0.0000>'}: 0.5 – бастапқы ені
          Specify ending width {'<0.5000>'}: 0.5 – шектік ені
          Specify next point or [Arc/Halfwidth/Length/Undo/Width]: 50,12 – 2-ші нүктесі
          Specify next point or [Arc/Close/Halfwidth/Length/Undo/Width]: W –
          Полисызықтың енін келтіру режиміне өту
          Specify starting width {'<0.5000>'}: 3 – бастапқы ені
          Specify ending width {'<3.0000>'}: 0 – шектік ені
          Specify next point or [Arc/Close/Halfwidth/Length/Undo/Width]:
          60,14 – 3-ші нүкте
          Specify next point or [Arc/Close/Halfwidth/Length/Undo/Width]: –аяқтау үшін Enter пернесін басу керек.

        </p>
        </>}
        {add === 16 && <>
        <h2 className="readRight__title">POLYGON (көпбұрыш) командасы</h2>
        <p>
        <br/><img className='ic' src="img/ic15.png" alt="" />  Тұрақты көпбұрыштың пайда болуын қамтамасыз ететін POLYGON командасы Draw → Polygon мәзірінен немесе Home таспасының Draw тобындағы Polygon пиктограммасын басу арқылы шақырылады (сурет. 2.7).
            Көпбұрыштар жабық полиcызықтар; олардың ұзындығы бірдей 3-тен 1024-ке дейін болуы мүмкін. Көпбұрышты оны шеңберіне жазу арқылы немесе оның айналасын сипаттау арқылы немесе оның бір жағының басы мен соңын белгілеу арқылы салуға болады. Көпбұрыштардың қабырғаларының ұзындығы әрқашан тең болғандықтан, олардың көмегімен квадраттар мен тең бүйірлі үшбұрыштар салу оңай.
            <div>
            <img src="img/img14.png" alt="" />
            <p>2.7-сурет. Polygon құралы</p>
          </div>

          POLYGON командасының сұраныстары:
          Enter number of sides {'<default>'}: – көпбұрыштың қабырғаларының санын көрсетіңіз
          Specify center of polygon or [Edge]: – көпбұрыштың центрін көрсету
          Enter an option [Inscribed in circle/Circumscribed about circle] {'<I>'}: – орналастыру кілтін орнату
          Specify radius of circle: – шеңбер радиусын көрсету.

          POLYGON командасының кілттері:
          	Inscribed in circle – шеңберге жазылған көпбұрышты қалыптастыру. Жазылған көпбұрыштар көпбұрыштың ортасы мен оның төбелері арасындағы қашықтық белгілі болған кезде салынады;
          	Circumscribed about circle – шеңбердің айналасында сипатталған көпбұрышты қалыптастыру. Сипатталған көпбұрыштар-көпбұрыштың ортасы мен оның қабырғаларының ортасы арасындағы қашықтық белгілі болған кезде. Екі жағдайда да бұл қашықтық шеңбердің радиусына сәйкес келеді;
          	Edge – бір жағын көрсету. Осы кілтті пайдалану кезінде POLYGON командасы төмендегі сұранысты көрсетеді:
          Specify first endpoint of edge: – қабырғасының бірінші нүктесін көрсету
          Specify second endpoint of edge: – қабырғасының екінші нүктесін көрсету [8].

        </p>
        </>}
        {add === 17 && <>
        <h2 className="readRight__title">RECTANGE (тікбұрыш) командасы</h2>
        <p>
        <br/><img className='ic' src="img/ic16.png" alt="" /> RECTANGE командасы екі қарама-қарсы бұрышта тіктөртбұрыш жасайды. Draw → Rectangle мәзірінен немесе Home таспасының Draw тобындағы Rectangle белгішесін басу арқылы шақырылады.
          RECTANGE командасының сұраныстары:
          Specify first corner point or [Chamfer/Elevation/Fillet/Thickness/Width]: – тіктөртбұрыштың бірінші бұрышын көрсетіңіз
          Specify other corner point or [Area/Dimensions/Rotation]: – тіктөртбұрыштың қарама қарсы бұрышын көрсетіңіз
          RECTANGE командасының кілттері:
           Chamfer – бұрыштары қиғаш тіктөртбұрышты құрайды. Бұл жағдайда команда келесі сұрауларды береді:
          Specify first corner point or [Chamfer/Elevation/Fillet/ Thickness/Width]: C – фаски режиміне өту
          Specify first chamfer distance for rectangles: – тіктөртбұрыштың бірінші қиғашының ұзындығын көрсетіңіз
          Specify second chamfer distance for rectangles: – тіктөртбұрыштың екінші қиғашының ұзындығын көрсетіңіз.
          	Elevation – тіктөртбұрыш үшін деңгейді орнатады. Бұл жағдайда команда келесі сұрауларды береді:
          Specify first corner point or [Chamfer/Elevation/Fillet/
          Thickness/Width]: E – деңгейлік жұмыс режиміне өту
          Specify the elevation for rectangles: – тіктөртбұрыш деңгейін көрсетіңіз
          Specify first corner point or [Chamfer/Elevation/Fillet/
          Thickness/Width]: – тіктөртбұрыштың бірінші бұрышын көрсетіңіз
          Specify other corner point or [Area/Dimensions/Rotation]: – тіктөртбұрыштың қарама қарсы бұрышын көрсетіңіз
          	Fillet – дөңгелек бұрыштары бар тіктөртбұрышты құрайды. Бұл ретте команда келесі сұрауларды шығарады:
          Specify first corner point or [Chamfer/Elevation/Fillet/Thickness/Width]: F – жұптастыру режиміне өту
          Specify fillet radius for rectangles: – тіктөртбұрыштың жұптасу радиусын көрсетіңіз
          Specify first corner point or [Chamfer/Elevation/Fillet/
          Thickness/Width]: – тіктөртбұрыштың бірінші бұрышын көрсетіңіз
          Specify other corner point or [Area/Dimensions/Rotation]: – тіктөртбұрыштың қарама қарсы бұрышын көрсетіңіз
          	Thickness – берілген үш өлшемді биіктігі бар тіктөртбұрышты құрайды. Бұл жағдайда команда келесі сұрауларды береді:
          Specify first corner point or [Chamfer/Elevation/Fillet/Thickness/Width]: T – үш өлшемді биіктіктегі жұмыс режиміне өту
          Specify thickness for rectangles: – тіктөртбұрыштың үш өлшемді биіктігінің мәнін көрсетіңіз
          Specify first corner point or [Chamfer/Elevation/Fillet/Thickness/Width]: – тіктөртбұрыштың бірінші бұрышын көрсетіңіз
          Specify other corner point or [Area/Dimensions/Rotation]: – тіктөртбұрыштың қарама қарсы бұрышын көрсетіңіз
          	Width – берілген полисызық енімен тіктөртбұрыш құрайды. Бұл жағдайда команда келесі сұрауларды береді:
          Specify first corner point or [Chamfer/Elevation/Fillet/Thickness/Width]: W – тіктөртбұрыштың полилин енінің жұмыс режиміне өту
          Specify line width for rectangles: – тіктөртбұрыш полилинінің енінің мәнін көрсетіңіз
          Specify first corner point or [Chamfer/Elevation/Fillet/ Thickness/Width]: тіктөртбұрыштың бірінші бұрышын көрсетіңіз
          Specify other corner point or [Area/Dimensions/Rotation]: – тіктөртбұрыштың қарама қарсы бұрышын көрсетіңіз
          	Area – аудан мәндерін, сондай-ақ ұзындық немесе ені мәндерін пайдаланып тіктөртбұрыш жасайды. Бұл жағдайда бағдарлама басқа өлшемді есептейді және тіктөртбұрыштың құрылысын аяқтайды. Егер Егер Chamfer немесе Fillet параметрі қосылса, тіктөртбұрыштың бұрыштарындағы қиғаш немесе конъюгация эффектілері ауданға қосылады [8]. Бұл жағдайда команда келесі сұрауларды береді:
          Specify first corner point or [Chamfer/Elevation/Fillet/ Thickness/Width]: – тіктөртбұрыштың бірінші бұрышын көрсетіңіз
          Specify other corner point or [Area/Dimensions/Rotation]: A тіктөртбұрыштың ауданын анықтау режиміне өту
          Enter area of rectangle in current units: – ағымдағы бірліктердегі тіктөртбұрыштың ауданын көрсетіңіз
          Calculate rectangle dimensions based on [Length/Width]{'<Length>'}: L – ұзындығы немесе ені параметріне негізделген тіктөртбұрыштың өлшемдерін есептеңіз
          Enter rectangle length: – тіктөртбұрыштың ұзындығын көрсетіңіз.
          	Dimensions – берілген ұзындық пен ен мәндері бойынша тіктөртбұрыy салу. Бұл жағдайда команда келесі сұрауларды береді:
          Specify first corner point or [Chamfer/Elevation/Fillet/ Thickness/Width]: – тіктөртбұрыштың бірінші бұрышын көрсетіңіз
          Specify other corner point or [Area/Dimensions/Rotation]: D – берілген ұзындық пен ен мәндері бойынша тіктөртбұрыш салу режиміне өту
          Specify length for rectangles: – тіктөртбұрыштың ұзындығын көрсетіңіз 
          Specify width for rectangles: – тіктөртбұрыштың енін көрсетіңіз
          Specify other corner point or [Area/Dimensions/Rotation]: – тіктөртбұрыштың қарама қарсы бұрышын көрсетіңіз
           Rotation – берілген бұрылу бұрышында тіктөртбұрыш жасайды. Бұл жағдайда команда келесі сұрауларды береді:
          Specify first corner point or [Chamfer/Elevation/Fillet/ Thickness/Width]: – тіктөртбұрыштың бірінші бұрышын көрсетіңіз
          Specify other corner point or [Area/Dimensions/Rotation]: R – бұрыштық жұмыс режиміне өту
          Specify other corner point or [Area/Dimensions/Rotation]: – тіктөртбұрыштың қарама қарсы бұрышын көрсетіңіз [9].

        </p>
        </>}
        {add === 18 && <>
        <h2 className="readRight__title">Объектілерді таңдау</h2>
        <p>
            AutoCAD  редакциялау командаларының көпшілігі олармен жұмыс істеу үшін объектілерді алдын ала көрсетуді талап етеді. Таңдалған объектілер – бір немесе бірнеше – жиынтық деп аталады. Ол, мысалы, белгілі бір түсті барлық объектілерді немесе белгілі бір қабатта орналасқан объектілерді қамтуы мүмкін. Мұндай жиынтықты өңдеу команда шақырылғанға дейін де, кейін де жасауға болады. Бір жиынтықта бірнеше редакциялау операцияларын жүргізуге рұқсат етіледі. Егер HIGHLIGHT жүйесінің айнымалысы орнатылса, таңдалған объектілер бөлектеледі [10].
          Редакциялау командасының бірі шақырылғаннан кейін, AutoCAD объектіні таңдауды ұсынады. Командалық жолда сұрау пайда болады:
          Select objects: – команданы таңдау
          Бұл жағдайда тышқан көрсеткішінің қиылысы таңдау ауқымымен ауыстырылады. Жеке нысандарды таңдау тышқанның көмегімен немесе осы бөлімде төменде сипатталған әдістердің бірімен жүзеге асырылады.
          Жиынтықты құру кезінде сіз соңғы жасалған объектіні, ағымдағы объектілер жиынтығын, сондай - ақ суреттің барлық объектілерін таңдай аласыз. Объектілерді жиынтыққа қосу және оларды сол жерден жою мүмкіндігі бар. Жиынтыққа әртүрлі объектілерді әртүрлі тәсілдермен енгізуге болады. Мысалы, бірнеше объектілерден басқа сурет аймағының барлық объектілерін таңдау үшін алдымен барлық объектілерді таңдап, содан кейін өңдеуге арналмағандарды жиынтық ішінен алып тастау керек.
          Объектілерді таңдау әдістері мен кілттері:
          	ADD - бар жиынтықты толтыру үшін қосу режимін қамтиды. Бұл объектілерді таңдау үшін орнатылған бастапқы режим;
          	ALL - барлық примитивтерді, соның ішінде ажыратылған, құлыпталған және мұздатылған қабаттарда орналасқан барлық объектілерді таңдауға мүмкіндік береді;
          	AUTO – тышқан көрсеткіші орнатылған объектіні бөлектейді. Егер бірде-бір объект таңдалмаса, көрсетілген нүкте кадрдың бірінші бұрышына айналады;
          	BOX - тіктөртбұрышты екі нүктеге орнатады. Егер екінші нүкте бірінші нүктенің оң жағында болса, таңдау процесі Window жақтауын таңдауға, ал сол жақта Crossing жақтауын таңдайды;
          	CROSSING - секциялық жақтау жақтаудың контурында орналасқан немесе қиылысатын барлық нысандарды бөлектейді. Әдепкі бойынша, Select objects сұрауына жауап ретінде: жақтаудың бірінші бұрышын, содан кейін екіншісін оңнан солға қарай көрсетуге болады. Объектіні таңдау үшін ол кем дегенде ішінара көрінуі керек. Бөлінген жақтауды таңдағанда пәрмен жолында сұраулар пайда болады [10]:
          Select objects: C – секциялық жақтауды пайдаланып, объектілерді таңдау режиміне өту;
          Specify first corner: – жақтаудың бірінші бұрышын көрсету;
          Specify opposite corner: – жақтаудың қарама-қарсы бұрышын көрсету.
          	CPOLYGON –Crossing және Wpolygon режимдерін біріктіреді көпбұрышқа толығымен қоршалған және оның шекарасын кесіп өтетін объектілерді таңдауға мүмкіндік береді. Аймақ таңдалуы керек объектілердің айналасындағы нүктелерді көрсету арқылы беріледі. Бұл нүктелер орнатылған кезде көпбұрыш салынады; ол кез-келген пішінде болуы мүмкін, бірақ өздігінен қиылыспайды және әр жаңа шыңды көрсеткен кезде автоматты түрде жабылады. Соңғы берілген нүктеден тышқан көрсеткішіне дейін "резеңке жіп"созылған. Бұл жағдайда командалық жолда сұраулар пайда болады: 
          Select objects: CP – көпбұрыш арқылы объектілерді таңдау режиміне өту;
          First polygon point: – көпбұрыштың бірінші нүктесін көрсету;
          Specify endpoint of line or [Undo]: – сегменттің соңғы нүктесін көрсету;
          Specify endpoint of line or [Undo]: – көпбұрышты пайдаланып,  объектілерді  таңдауды аяқтау үшін Enter пернесін басу керек[10]
          	FENCE – тек сызық қиылысатын нысандарды таңдайды. Жақтау немесе ағымдық көпбұрыштан айырмашылығы, ол өзін кесіп өтуі мүмкін. Нүктелер көрсетілген кезде таңдау сызығы жасалады және графикалық курсордың қиылысына "резеңке жіп" тартылады. Бұл жағдайда командалық жолда сұраулар пайда болады:
          First fence point: – сызықтың бірінші нүктесін көрсету;
          Specify endpoint of line or [Undo]: – сызықтың соңғы нүктесін көрсету;
          Specify endpoint of line or [Undo]: – сызықтың соңғы нүктесін көрсету;
          Specify endpoint of line or [Undo]: – объектілерді таңдауды аяқтау үшін Enter пернесін басу.
          	GROUP – берілген топ ішіндегі барлық объектілерді таңдайды;
          	LAST – экранда көрінетін соңғы сызылған объектіні таңдайды;
          	MULTIPLE – бір уақытта бірнеше нысанды таңдайды. Нысанды таңдаудың келесі сұрауы Enter пернесін немесе бос орынды басқанға дейін таңдау процесі аяқталған болып саналмайды;
          	PREVIOUS – ағымдағы нысандар жиынтығын таңдайды;
          	REMOVE – көрсетілген объектілерді жиынтықтан жою режимін орнатады;
          	SINGLE – бір нысанды таңдау режимін орнатады. Бір объект немесе бір топ тізімделгенде, таңдау аяқталды деп саналады және нысандарды таңдау сұрауы қайталанбайды;
          	UNDO – жиынтыққа қосылған соңғы объектіні болдырмайды (жояды);
          	WINDOW – толығымен кадрға түсетін объектілерді таңдайды. Әдепкі бойынша, Select objects: сұрауына жауап ретінде: жақтаудың бірінші бұрышын, содан кейін екінші бұрышты диагональ бойынша біріншісінен солдан оңға қарай көрсетуге болады;
          	WPOLYGON – Window режиміне ұқсас, бірақ шекаралары көпбұрыш болатын аймақтың ішіндегі нысандарды таңдауға мүмкіндік береді.

          Егер PICKDRAG жүйесінің айнымалысы қосылса, жақтауды анықтау тышқанның сол жақ батырмасын басу арқылы жасалады. Егер PICKDRAG өшірілген болса (бұл әдепкі параметр), онда жақтау бірінші және екінші нүктелерде екі рет басу арқылы орнатылады.
          Бір-біріне жақын немесе тікелей жататын заттарды таңдау өте қиын. Осы мақсатта CTRL пернесін басып тұрып, тышқанды пайдалану ыңғайлы: нәтижесінде циклдік шамадан тыс режим қосылады, мұнда тышқанды шерту арқылы объектілер бірінен соң бірі таңдалады, талап етілгенге дейін.
          Объектілерді таңдау процесін басқару үшін Options диалогты терезесінен Tools → Options... командасын орындау керек. Объектілерді сұрыптау User Preferences қосымшасында орнатуға болады. Объектілерді таңдау режимі мен ауқым өлшемі Options диалогты терезесінің Selection қосымшасында анықталады. 
          Таңдалған нысандар жиынтығын жылдам таңдау функциясын немесе тізім сүзгісін пайдалану арқылы түс, қабат және нысан түрі және т.б. сияқты қасиеттермен шектеу мүмкіндігі бар. Мысалы, суретте тек қызыл шеңберлерді таңдауға немесе керісінше қызыл шеңберлерден басқа барлық нысандарды таңдауға болады.
          Жылдам таңдау функциясы берілген таңдау критерийі бойынша объектілер жиынтығын құруға мүмкіндік береді. Object selection Filters тілқатысу терезесінде нысандарды таңдаудың әртүрлі сүзгілері орнатылады және одан әрі қолдану үшін сақталады [10].

        </p>
        </>}
        {add === 19 && <>
        <h2 className="readRight__title">Қалам көмегімен редакциялау</h2>
        <p>
          Таңдалған нысандарды тұтқалар арқылы басқаруға болады - таңдалған нысандардың анықтаушы нүктелерінде көрсетілген кішкентай квадраттар (сурет. 3.1).
        
          <div>
            <img src="img/img15.png" alt="" />
            <p> 3.1-сурет. Қаламмен примитивтер әзірлеу мысалдары</p>
          </div>

        Тұтқалармен жұмыс режимі қосылған кезде нысандарды таңдау редакциялауға дейін жасалады және оларды манипуляциялау тінтуір меңзерімен немесе кілт сөздермен жүзеге асырылады. Осылайша, тұтқаларды пайдалану мәзір қоңырауларын азайтуға мүмкіндік береді. Графикалық курсор ол өтетін тұтқаға байланады. Егер тұтқалармен жұмыс режимі қосулы болса, онда жиынтықтан алынып тасталатын заттар жарықтандыруды тоқтатады, бірақ олардың тұтқалары қалады [11].
        AutoCAD бағдарламасындағы өңдеу командаларының жиынтығы Modify мәзірінде орналасқан (сурет. 3.4).
        
        <div>
            <img src="img/img16.png" alt="" />
            <p>3.2-сурет. Редакциялау командасының саймандары</p>
          </div>

        Drafting & Annotation жұмыс кеңістігінде өңдеу командаларының құралдары Modify тобындағы Home құралдар таспасында орналасқан (4-сурет).
        
        <div>
            <img src="img/img17.png" alt="" />
            <p>3.3-сурет. Drafting & Annotation жұмыс кеңістігіндегі өңдеу командаларының құралдары
        – нысандарды</p>
          </div> 

        </p>
        </>}
        {add === 21 && <>
        <h2 className="readRight__title">Объектілерді жою және қалпына келтіру</h2>
        <p>
        <br/><img className='ic' src="img/ic17.png" alt="" /> ERASE командасы объектілерді жоюды (өшіруді) жүзеге асырады. Ол Modify → Erase мәзірінен немесе Drafting & Annotation жұмыс кеңістігіндегі Home таспасының Modify тобындағы Erase белгішесін басу арқылы шақырылады.
          ERASE командасының сұраныстары:
          Select objects: – нысандарды таңдаңыз
          Select objects: – нысандарды таңдаңыз
          Select objects: - пәрменді аяқтау үшін Enter пернесін басыңыз
          Өшіру керек объектілерді таңдау кез-келген қол жетімді тәсілмен жасалуы мүмкін.
          Жойылған соңғы ERASE командасын қалпына келтіру үшін OOPS командасы қолданылады. Оның атауы – " ОЙ " - бұл команданы қолдану кезінде пайдаланушының эмоцияларын сәтті көрсетеді.

          <br/><img className='ic' src="img/ic18.png" alt="" /> COPY (Көшіру) бұйрығының  батырмасы таңдалған нысанды көшіруді жүзеге асырады. Ол үшін жанама мәзірден Modify → Copy командасын таңдау қажет. 
              COPY командасының сұраныстары:
                  Select objects: – нысандарды таңдау
          Select objects: –Enter  пернесін басу арқылы нысанды таңдауды аяқтауға болады.
          Specify base point or [Displacement/mOde] {"<Displacement>"}: – бастапқы нүкте немесе  орын ауыстыру нүктесі таңдалады. 
          Specify second point or {"<use first point as displacement>"}: – бъектінің көшірмесін орналастырудың екінші нүктесін көрсетесіз немесе бірінші нүктені жылжыту деп санауға болады.
          Specify second point or [Exit/Undo] {"<Exit>"}: – нысанның көшірмесін орналастырудың екінші нүктесін көрсетіңіз немесе пәрменді аяқтау үшін Enter пернесін басыңыз.
          Specify second point or [Exit/Undo] {"<Exit>"}:
          Нысанның көшірмесінің орын ауыстыру нүктесін көрсетуді талап ететін сұрау бірнеше рет жасалады. Әрбірмещысу бастапқы базалық нүктеге қатысты анықталады.
          Сұрауға жауап ретінде қажетті көшірмелер санын алғаннан кейін Enter пернесін басу керек.
          <b>Нысандарды көшіруге мысал:</b>
          Бөлшектің екі көшірмесін алу.
          COPY командасын таңдау керек, ашылған жанама мәзірден Modify → Copy командасын таңдаңыз.
          Төмендегі сұраныстарға жауап беру керек:
          _COPY
          Select objects: – 1-ші нүктені көрсетіңіз.
          Select objects: – нысанды таңдауды аяқтау үшін Enter пернесін басыңыз.
          Specify base point or [Displacement/mOde] {"<Displacement>"}: – 2-ші нүктені көрсетіңіз
          Specify second point or {"<use first point as displacement>"}: – 3-інші нүктені көрсетіңіз
          Specify second point or [Exit/Undo] {"<Exit>"}: –4-інші нүктені көрсетіңіз
          Specify second point or [Exit/Undo] {"<Exit>"}: –Enter пернесін басу арқылы жұмыс аяқталады [12].
          <br/><img className='ic' src="img/ic19.png" alt="" /> <b>MIRROR (Айна)</b> командасы объектілерді шағылыстыруды жүзеге асырады. Ол Modify → Mirror мәзірінен немесе шерту арқылы шақырылады. Modify тобындағы Mirror пиктограммасы жұмыс кеңістігіндегі Home таспалары Drafting & Annotation. 
          Mirror командасының сұраныстары:
          Select objects: – нысандарды таңдау
          Select objects: – –Enter  пернесін басу арқылы нысанды таңдауды аяқтауға болады.
          Specify first point of mirror line: – шағылысу осінің бірінші нүктесін көрсетіңіз
          Specify second point of mirror line: – шағылысу осінің екінші нүктесін көрсетіңіз
          Delete source objects? [Yes/No] {"<N>"}: – бастапқы нысандарды жою немесе қалдыру [12]
          Ескерту
          Айна бейнеленген кезде мәтіндер, атрибуттар және олардың анықтамалары да айна көрінісіне ие болады. Бұл шағылыстыру операциясы шағылысудың математикалық заңдарына қатаң сәйкес жасалғандықтан орын алады.
          Айна арқылы алынған мәтін таныс көрініске ие болу үшін MIRRTEXT жүйелік айнымалысына 0 мән беру керек. Әдепкі бойынша, бұл айнымалы қосылады. Егер сіз оны өшірсеңіз, көрсетілген мәтін бастапқы мәтін сияқты бағдарланған және тураланған болады. Бұл жағдайда MIRROR командасы мәтін элементтері мен атрибуттардың примитивтерін ерекше түрде өңдейді, оларды бұрынғы бағытта көрсетеді. MIRRTEXT айнымалысы тек мәтін, DTEXT, MTEXT командалары жасаған қарапайым мәтін нысандарына, сондай-ақ атрибуттардың анықтамаларына және олардың кірістірілген блоктың ішіне кірмейтін айнымалыларына әсер етеді. Блоктағы мәтіндер мен тұрақты атрибуттар, MIRRTEXT жүйелік айнымалысын орнатуға қарамастан, блоктың барлық компоненттері сияқты шағылысады.
          Мысалы: объектілердің айналық шағылысуы
          Ескі нысанды алып тастамай, вертикалды оське қатысты бөлікті шағылыстырыңыз (3.4-сурет). 
          Modify → Mirror мәзірінен немесе Modify Home таспасының тобындағы mirror белгішесін басу арқылы MIRROR пәрменін іске қосыңыз. Сұрауларға жауап беріңіз:
          _MIRROR
          Select objects: W – нысандарды кадрмен таңдау режиміне өту
          Specify first corner: – 1-ші нүктені көрсетіңіз
          Specify opposite corner: – 2-ші нүктені көрсетіңіз
          Select objects: – нысандарды таңдауды аяқтау үшін Enter пернесін басыңыз
          Specify first point of mirror line: END – сегменттің соңғы нүктесіне динамикалық нысан байланған 3 нүктені көрсетіңіз
          Specify second point of mirror line: END – сегменттің соңғы нүктесіне динамикалық нысан байланған 4 нүктені көрсетіңіз
          Delete source objects? [Yes/No] {"<N>"}: – ескі нысанды жоюдан бас тарту үшін Enter пернесін басыңыз.

          
          <div>
            <img src="img/img18.png" alt="" />
            <p>3.4-сурет. Нысандардың айналық шағылысуы</p>
          </div> 

          <br/><img className='ic' src="img/ic20.png" alt="" /> <b>OFFSET (Ұқсас)</b> командасы берілген орын ауыстырумен осындай объектілерді (эквидистант) құруды жүзеге асырады. Ол Modify → Offset мәзірінен немесе Drafting & Annotation жұмыс кеңістігіндегі home таспасының Modify тобындағы Offset белгішесін басу арқылы шақырылады.
            Ұқсас сегменттерді, доғаларды, шеңберлерді, екі өлшемді полилиндерді, эллипстерді, эллиптикалық доғаларды, түзулерді, сәулелерді және жалпақ сплайндарды салуға болады. Мұндай шеңберлердің диаметрі қалай берілгеніне байланысты бастапқы шеңберден үлкен немесе кіші болады. Егер ол шеңберден тыс нүктемен көрсетілсе, онда жаңа шеңбердің диаметрі үлкенірек, ал шеңбердің ішінде кішірек болады[12].
          OFFSET командасының сұраныстары:
          Current settings: Erase source=No Layer=Source OFFSETGAPTYPE=0 –
            Ағымдағы командалар
          Specify offset distance or [Through/Erase/Layer] {"<Through>"}: – орын ауыстыру шамасын көрсетіңіз
          Select object to offset or [Exit/Undo] {"<Exit>"}: – ұқсас жасау үшін нысанды таңдаңыз
          Specify point on side to offset or [Exit/Multiple/Undo] {"<Exit>"}: –
          ұқсастығын анықтайтын нүктені көрсету керек.
          Select object to offset or [Exit/Undo] {"<Exit>"}: ұқсастықты құру үшін нысанды таңдаңыз
          Specify point on side to offset or [Exit/Multiple/Undo] {"<Exit>"}: –
          ұқсас жасау үшін нысанды таңдаңыз
          Select object to offset or [Exit/Undo] {"<Exit>"}: – команданы  аяқтау үшін Enter пернесін басыңыз.
          Мысалы, эдвисдистантты құру
          Берілген полисызықтың эдвидистантының бірнеше нұсқауын құру керек(3.5-сурет).
          Offset командасын  Modify → Offset мәзірінен шақыру арқылы немесе Home таспасының Modify тобындағы Offset белгішесін басу арқылы іске қосыңыз. Сұраныстарға жауап беру керек:
          OFFSET
          Specify offset distance or [Through/Erase/Layer]
          {"<Through>"}: 15 – ұқсас
          Select object to offset or [Exit/Undo] {"<Exit>"}: – 1-ші нүктені көрсетіңіз.
          Specify point on side to offset or [Exit/Multiple/Undo] {"<Exit>"}: – 2-ші нүктені көрсетіңіз
          Select object to offset or [Exit/Undo] {"<Exit>"}: – 3-ші нүктені көрсетіңіз
          Specify point on side to offset or [Exit/Multiple/Undo] {"<Exit>"}: –
          4-інші нүктені көрсетіңіз.
          . . .
          Select object to offset or {"<exit>"}: – – команданы  аяқтау үшін Enter пернесін басыңыз.
          
          <div>
            <img src="img/img19.png" alt="" />
            <p>3.5-сурет. Нысандардың айналық шағылысуы</p>
          </div>

          <br/><img className='ic' src="img/ic21.png" alt="" /> <b>ARRAY (Массив</b>) командасы объектілерді тікбұрышты массивпен көбейтеді (сурет. 12.12). Ол modify → Array → Rectangular Array мәзірінен немесе drafting & Annotation жұмыс кеңістігіндегі home таспасының Modify тобындағы Rectangular Array белгішесін басу арқылы шақырылады. 
          <div>
            <img src="img/img20.png" alt="" />
            <p>3.6-сурет. Массив сұқбаттасу терезесі</p>
          </div> 

          Бұйрық фасканы екі тәсілмен алуы мүмкін. Бірінші – Distance (Ұзындық) опциясы берілгенде, қиюлардан алынатын екі ұзындықтың тапсырмасына қатысты болады. Екінші – Angle (Бұрыш) опциясы берілгенде, бірінші сегментпен салыстырмалы түрде алғанда фасканың қосымша кесіндісі құрылатын бір ұзындық пен бұрыштың тапсырмасына байланысты. Екі тәсілді орнату үшін AutoCAD жүйесі жүйелік ауыспалылықта CHAMFERA, CHAMFERB {"(Distance тәсілі (Ұзындық))"} и CHAMFERC, CHAMFERD {"(Angle тәсілі (Бұрыш))"} сақтайды.
          Бұл ауыспалылықтардың маңызы CHAMFER (ФАСКА) бұйрығын орнатудың қазіргі жайы туралы хабарламада көрсетіледі. CHAMFER (ФАСКА) бұйрығының ауыспалылық маңызын тапсыру Distance (Ұзындық) және Angle (Бұрыш)  опцияларының көмегімен жасалады. Фасканы алуға сегменттердің орнына екі полисызықтардың турасызықты соңғы бөлімін көрсетуге немесе кесінді және полисызықтың турасызықты соңғы сегментін, сондай-ақ бір полисызықтың бөлімін көрсетуге болады. Соңғы нұсқада берілген полисызықтардың сегменттері көршілес немесе олар тағы бір сегментпен бөлінген болуы мүмкін (фаска қиылысқан екі нүктенің екі жағынан алынады). Тағы бір ерекше опция - Polyline (полИсызық). Оның көмегімен фасканы бір полисызықтың барлық шыңдарынан қатар алуға болады. 
          FILLET (Ұштастыру) бұйрығының   батырмасы сызықты нысандарды (мысалы, кесінділерді, доғаларды немесе дөңгелектерді) берілген радиусқа байланысты доғамен ұштастырады[12]. 
          Бұйрық бірінші нысанның қазіргі жай-күйі туралы бірінші хабарлама береді: Current settings: Mode = TRIM, Radius = 0.0000 Select first object or [Polyline/Radius/Trim/mUltiple]: {"(Ағымдық күйге келтіру: Режим = ҚИЮМЕН, Ұштасу радиусы = 0.0000. Бірінші нысанды таңдаңыз немесе [полИсызық/раДиус/қию/көп]:)"} Radius (раДиус) опциясы қажетті сұраныстан кейін қазіргі кездегі ұштастыру радиустың маңызын өзгертуге мүмкіндік береді: Specify fillet radius {'< 0.0000 >'}: {"(Ұштастыру радиусы <0.0000>:)"}. Радиустың көлемі белгіленгеннен кейін тағы да Select first object or [Polyline/Radius/Trim/mUltiple]: {"(Бірінші нысанды таңдаңыз немесе [полИсызық/раДиус/Қию/Көп]:)"} сұранысы қайталанады. Егер күйге келтірулер сізді қанағаттандырса, онда ұштастыруға арналған бірінші нысанды белгілеңіз. Ары қарай: Select second object: (Екінші нысанды таңдаңыз:). Екінші нысанды таңдап болған соң AutoCAD жүйесі қажетті ұштастыру доғасын салады немесе бұл радиуспен ұштастыру мүмкін еместігін хабарлайды. Ұштастыру нысандары болып полисызықтардың екі аумағы көрінуі мүмкін, олар екі көрші бөлік болуы немесе екеуі бір сегментпен бөлініп тұруы мүмкін. Жаңа multiple (Көп) опциясы нысандардың бірнеше мәрте ұштастыруды жүзеге асыруға мүмкіндік береді. Trim (Қию) опциясы қию режімін басқарады {"(ол CHAMFER (ФАСКА) бұйрығымен бірлескен)"}. Егер No trim (Қиюсыз) режимі таңдалса, онда ұштастырылатын доға есептеледі және құрылады егер құру мүмкін болса, ал бастапқы нысандар сол күйінде өзгеріссіз қалады. Егерде Trim (Қиюмен) режимі қосылған болса, онда ұштастырылатын тұйық емес нысандар ұштастыратын доғаның алғашқы нүктесіне дейін қысқартылады немесе ұзартылады. Polyline (полИсызық) опциясы бір полисызықтың барлық шыңдарын берілген радиуспен айналдыруға мүмкіндік береді. AutoCAD жүйесінің алғашқы нұсқаларында FILLET (ҰШТАСТЫРУ) әмірі тек қана турасызықты нысандарды ғана ұштастыра алатын еді [12].
        </p>
        </>}
        {add === 22 && <>
        <h2 className="readRight__title">ІV-БӨЛІМ. ҚОЛДАНУШЫНЫҢ ИНТЕРФЕЙСІ</h2>
        <p>
            

        </p>
        </>}
        {add === 23 && <>
        <h2 className="readRight__title">ІV-БӨЛІМ. ҚОЛДАНУШЫНЫҢ ИНТЕРФЕЙСІ</h2>
        <p>
            Windows жүйесіне арналған AutoCAD жұмыс үстелі төменде көрсетілген (Сурет 4.1). Autocad 2023 интерфейсі қараңғы түстерде жасалған.
            <div>
            <img src="img/img21.png" alt="" />
            <p>4.1-сурет. AutoCAD 2023 интерфейсі</p>
          </div>
          Жұмыс үстеліне мыналар кіреді:
          1. Қолданба мәзірі түймесі - бағдарламаның жоғарғы сол жақ бұрышындағы түйме;
          2. Quick Access Toolbar жылдам қол жеткізу панелі - жоғарғы сол жақтағы мәзір терезелер;
          3. Сызба  тақырыбы – терезенің жоғарғы жағындағы жазу;
          4. Инфоорталығы - оң жақтағы терезенің жоғарғы жағындағы құралдар;
          5. AutoCAD терезесінің басқару элементтері - оң жақтағы терезенің жоғарғы жағында;
          6. Menu Browser мәзірі - терезенің жоғарғы жағындағы мәзір;
          7. Таспалар (лента) - көрсетілген мәзірлердің астындағы топтастырылған құралдар;
          8. Көріністерді басқару - қойындылар сол жақта, жоғарғы жағында;
          9. Сурет терезесінің басқару элементтері - жоғарғы оң жақта;
          10. Көрініс текшесі - графикалық өрістің жоғарғы оң жақ бұрышында;
          11. Шарлау тақтасы - графикалық өрістің оң жағында;
          12. Координаталық осьтердің пиктограммасы - графикалық өрістің төменгі сол жағында;
          13. Күй жолағы - бағдарлама терезесінің төменгі жағындағы жол;
          14. Командалық жол -  жолы терезесі-күй жолағынан жоғары;
          15. Жұмыс үстелінің қалған бөлігін алатын графикалық өріс.
          <br/><img className='ic' src="img/ic22.png" alt="" /> Қаласаңыз, қараңғы түс схемасын дәстүрлі жеңіл интерфейс опциясына ауыстыруға болады. Ол үшін Tools → Options... жанама мәзірін таңдап, ашылған Options диалогты терезесінен Window Elements,  Color scheme тізімінен: Light пунктін таңдау керек (сурет 4.2).
            <div>
            <img src="img/img22.png" alt="" />
            <p>4.2-сурет.  AutoCAD Light жұмыс үстелі</p>
          </div> 

          <h3>Қосымша мәзірінің пернесі </h3>

          Қолданба мәзірінің түймесі бағдарламаның жоғарғы сол жақ бұрышында орналасқан (сурет 4.3) және сызбаларды құруға, ашуға, жариялауға, сондай-ақ командаларды іздеуге қызмет етеді..
          Ашылған менюде  келесі құралдар болады:

          <br/><img className='ic' src="img/ic23.png" alt="" /><b>Recent Documents</b> – соңғы құжаттарды көрсету.

          <br/><img className='ic' src="img/ic24.png" alt="" /><b>Open Documents</b> – ашық құжаттарды көрсету.
          құжаттарды көрсету тәртібі:
          <br/><img className='ic' src="img/ic25.png" alt="" />
          •	By Ordered List – реттелген тізім бойынша;
          •	By Access Date – өтініш берген күні бойынша;
          •	By Size – өлшем бойынша;
          •	By Type – тпі бойынша.

          <br/><img className='ic' src="img/ic26.png" alt="" />Бейнелеу формасы:


          
          <div>
            <img src="img/img23.png" alt="" />
            <p>4.3-сурет. Қосымша мәзірінің пернесі</p>
          </div>

          • Small Icons – кішкентай белгішелер;
          • Large Icons – үлкен белгішелер;
          • Small Images – шағын кескіндер;
          • Large Images – ірі кескіндер.
        <br/><img className='ic' src="img/ic27.png" alt="" />Create a new drawing – жаңа сызбаны құру:
        <br/><img className='ic' src="img/ic28.png" alt="" />Drawing – таңдалған шаблон негізінде жаңа сызба жасау;
        <br/><img className='ic' src="img/ic29.png" alt="" />Sheet Set – сызба парақтарын, файл жолдарын және жоба деректерін басқару үшін байланыстырушы деректер файлын жасау;
        <br/><img className='ic' src="img/ic30.png" alt="" />Open a file – сызбаны ашу;
        <br/><img className='ic' src="img/ic27.png" alt="" />Drawing – бұрын жасалған сызбаны ашу;
        <br/><img className='ic' src="img/ic31.png" alt="" />Sheet Set – тігіс менеджерінде тігіс деректерінің файлын ашу;
        <br/><img className='ic' src="img/ic32.png" alt="" />DGN – деректерді DGN файлынан жаңа DWG файлына импорттау;
        <br/><img className='ic' src="img/ic33.png" alt="" />Save – ағымдағы сызбаны сақтау;     
        <br/><img className='ic' src="img/ic34.png" alt="" />Save a copy of the drawing – ағымдағы сызбаның көшірмесін сақтау:         
        <br/><img className='ic' src="img/ic27.png" alt="" />Drawing – ағымдағы сызбаны әдепкі DWG файл пішімінде сақтау;
        <br/><img className='ic' src="img/ic35.png" alt="" />Drawing Tamplate – жаңа сызбалар жасалатын сызба шаблонының DWT файлын сақтау;
        <br/><img className='ic' src="img/ic35.png" alt="" />Drawing Standards – сызбалардың стандарттарға сәйкестігі тексерілетін DWG сызба стандарттарының файлын сақтау;
        <br/><img className='ic' src="img/ic36.png" alt="" />Other formats… – ағымдағы сызбаны DWG, DWT, DWS немесе DXF файл пішімінде сақтау;
        <br/><img className='ic' src="img/ic37.png" alt="" />Save Layout as a Drawing – жаңа сызба үлгісінің кеңістігінде ағымдағы парақтан барлық көрінетін нысандарды сақтау;
        <br/><img className='ic' src="img/ic38.png" alt="" />DWG Convert – сақтау;
        <br/><img className='ic' src="img/ic39.png" alt="" />Export to a different format – ағымдағы сызбаны басқа форматқа экспорттау;
        <br/><img className='ic' src="img/ic40.png" alt="" />DWF – ағымдағы сызбаны DWG форматына Парақ параметрлерінің жиынтығын қайта анықтау мүмкіндігімен экспорттау;
        <br/><img className='ic' src="img/ic41.png" alt="" />DWFx – ағымдағы сызбаны DWFx форматына Парақ параметрлерінің жиынтығын қайта анықтау мүмкіндігімен экспорттау;
        <br/><img className='ic' src="img/ic42.png" alt="" />3D DWF – ағымдағы сызбаны үш өлшемді модельдің DWF немесе DWFx форматында экспорттау және оны DWF файл қарау құралында көрсету;
        <br/><img className='ic' src="img/ic43.png" alt="" />PDF – ағымдағы сызбаны PDF форматына парақ параметрлерінің жиынтығын қайта анықтау мүмкіндігімен экспорттаңыз;         
        <br/><img className='ic' src="img/ic44.png" alt="" />DGN – ағымдағы сызбаны бір немесе бірнеше файл жасай отырып DGN форматына экспорттаңыз;
        <br/><img className='ic' src="img/ic45.png" alt="" />FBX – ағымдағы сызбаны FBX форматына экспорттау;
        <br/><img className='ic' src="img/ic46.png" alt="" /> Other Formats – ағымдағы сызбаны басқа файл пішіміне экспорттау;
        <br/><img className='ic' src="img/ic47.png" alt="" />Share the drawing – қызмет арқылы сызбаға қол жеткізуді қамтамасыз ету:
        <br/><img className='ic' src="img/ic48.png" alt="" /> Send to 3D Print Service – денелер және өткізбейтін желілер болып табылатын объектілерді 3D басып шығару қызметіне жіберу;
        <br/><img className='ic' src="img/ic49.png" alt="" />Archive – мұрағатта сақтау үшін ағымдағы жиектеме файлдарын орау;
        <br/><img className='ic' src="img/ic50.png" alt="" /> eTransmit – сызба файлдарынан және олардың өзара байланыстарынан пакет құру;
        <br/><img className='ic' src="img/ic51.png" alt="" />Email – ағымдағы сурет файлын электрондық пошта хабарына тіркеме ретінде жіберу;
        <br/><img className='ic' src="img/ic52.png" alt="" />Output the drawing to a plotter or other device – ағымдағы сызбаны басып шығару құрылғысына шығару:
        <br/><img className='ic' src="img/ic53.png" alt="" />Plot – ағымдағы сызбаны плоттерге, принтерге немесе файлға шығару;
        <br/><img className='ic' src="img/ic54.png" alt="" />Batch Plot – плоттерде, принтерде немесе DWF, PDF файлдарында бірнеше парақтарды немесе сызбаларды пакеттік жариялау;
        <br/><img className='ic' src="img/ic55.png" alt="" />Plot Preview – ағымдағы сызбаны басып шығаруға болатын түрде алдын ала қарау;
        <br/><img className='ic' src="img/ic56.png" alt="" />View Plot and Publish Details – басып шығару және жариялау тапсырмалары туралы толық ақпаратты көрсету;
        <br/><img className='ic' src="img/ic57.png" alt="" />Page Setup – әр жаңа парақ үшін парақтың орналасу параметрлерін, басып шығару құрылғысын, қағаз пішімін және басқа параметрлерді орнату;
        <br/><img className='ic' src="img/ic58.png" alt="" />Manage Plotters – Плоттер конфигурациясын қосуға немесе өңдеуге арналған Плоттер менеджерінің шығысы;
        <br/><img className='ic' src="img/ic59.png" alt="" />Manage Plot Styles – басып шығару стилі кестесін өңдеуге арналған Басып шығару стилі менеджерінің шығысы;
        <br/><img className='ic' src="img/ic60.png" alt="" />Edit Plot Style Tables – ағымдағы параққа бекітілген атаулы басып шығару мәнерлерін басқару;
        <br/><img className='ic' src="img/ic61.png" alt="" />Tools to maintain the drawing – ағымдағы сызбамен жұмыс істеу құралдары:
        <br/><img className='ic' src="img/ic62.png" alt="" />Drawing Properties – ағымдағы сызба файлының қасиеттерін көрсету және орнату;
        <br/><img className='ic' src="img/ic63.png" alt="" />Units – дисплей пішімін, сондай-ақ координаттар мен бұрыштардың дәлдігін анықтау;
        <br/><img className='ic' src="img/ic64.png" alt="" />Audit – сызбаның тұтастығын тексеру және жеке қателерді түзету;
        <br/><img className='ic' src="img/ic65.png" alt="" />Status - ағымдағы сызба, оның режимдері мен шекаралары туралы статистикалық деректерді алу;
        <br/><img className='ic' src="img/ic66.png" alt="" />Purge – ағымдағы Сызбадан блоктар, қабаттар және т. б. сияқты пайдаланылмаған аталған элементтерді жою.;
        <br/><img className='ic' src="img/ic67.png" alt="" />Recover – бүлінген сурет файлын қалпына келтіру;
        <br/><img className='ic' src="img/ic68.png" alt="" />Open the Drawing Recovery Manager – бағдарлама немесе жүйе істен шыққаннан кейін сызбаны қалпына келтіру менеджерін жүктеу;
        <br/><img className='ic' src="img/ic69.png" alt="" /> Close the drawing – сызбаны жабу:
        <br/><img className='ic' src="img/ic70.png" alt="" />Current Drawing – ағымдағы сызбаны жабыңыз;
        <br/><img className='ic' src="img/ic71.png" alt="" /> All Drawings - барлық ашық сызбаларды жабыңыз.
        <br/><img className='ic' src="img/ic72.png" alt="" />Options жұмыс ортасын теңшеу тілқатысу терезесін ашу.
        <br/><img className='ic' src="img/ic73.png" alt="" />- бағдарламадан шығу.

        </p>
        </>}
        {add === 24 && <>
        <h2 className="readRight__title">Жылдам қол жеткізу тақтасы</h2>
        <p>
          Жылдам қол жеткізу тақтасы AutoCAD жұмыс үстелінің жоғарғы сол жағында орналасқан (2.4-сурет. ).
          Жылдам қол жеткізу тақтасына қосуға болатын командалар тізімі панельдің оң жағындағы көрсеткіні басқан кезде ашылатын тізімде бар.
                
          
          <div>
            <img src="img/img24.png" alt="" />
            <p> 4.4-сурет. Жылдам қол жеткізу тақтасы</p>
          </div>

        </p>
        </>}
        {add === 25 && <>
        <h2 className="readRight__title">Жанама меню</h2>
        <p>
        <br/><img className='ic' src="img/ic74.png" alt="" /> Құлаған мәзір жолағы элементті таңдау арқылы жылдам қол жеткізу тақтасының контекстік мәзірінде орнатылады/жасырылады: Show Menu Bar/ Hide Menu Bar (Сурет. 2.4).
              Әдепкі бойынша, құлаған мәзір жолағында келесі элементтер бар (Сурет 2.5):
          Жанама меню

          
          <div>
            <img src="img/img25.png" alt="" />
            <p>4.5-сурет. Жанама меню жолағы</p>
          </div> 

          	File – файл командалары: жасау, ашу, сақтау, интернетте жариялау, басып шығару, файлдарды басқа форматтарға экспорттау, сонымен қатар парақ параметрлері, плоттерлер, басып шығару стильдері және т. б.;
          	Edit – графикалық өрістің бөліктерін өңдеуге арналған құралдар, аралық сақтағышпен жұмыс істеуге арналған құралдар және т. б.;
          	View – экранды басқару, масштабтау, панорамалау, үш өлшемді көзқарасты орнату, көрініс экрандары мен атаулы көріністерді жасау, визуалды стильдерді орнату, тонирование, қозғалыс траекториясын анимациялау, қажетті құралдар тақталарын орнату;
          	Insert – блоктарды, сыртқы нысандарды, басқа қолданба нысандарын енгізу пәрмендері;
          	Format – қабаттар мен олардың құралдарымен жұмыс командалары; түс, сызық түрлері; мәтін мәнерлерін, өлшемдерін, көп сызықтарды, кестелерді басқару; нүкте маркерінің түрі, өлшем бірліктерін орнату, сызба шекаралары;
          	Tools – жұмыс кеңістігін басқару; палитралар; объектілерді сызу және олар туралы ақпарат алу қатарын орнату; блоктармен және олардың атрибуттарымен жұмыс; AutoLISP тілімен жұмыс; пайдаланушы координаттар жүйесімен жұмыс; дизайн стандарттарын реттеу; шеберлерді басқару (интернетте жариялау, плоттерлерді орнату, басып шығару стильдерінің кестелерін құру, түстерге тәуелді басып шығару стильдері, орналасу құрастыру, басып шығару параметрлерін импорттау); диалогтық терезелердің көмегімен сызу және байланыстыру параметрлерін орнату; және т. б.;
          	Draw – екі өлшемді және үш өлшемді сурет салу командалары;
          	Dimension – өлшемді орналастыру және өлшем мәнері параметрлерін басқару пәрмендері;
          	Modify – сурет элементтерін өңдеу командалары;
          	Parametric – тәуелділікті параметрлеу және параметрлер менеджеріне кіру командалары;
          	Window – сызбалармен жұмыс істеудің көп терезе режимі;
          	Help – гипермәтіндік кеңестер жүйесін экранға шығару;
          	Express – жиі қолданылатын құралдарға жылдам қол жеткізу.

          Құлаған мәзір жолын белгілі бір элементтерді қосу немесе жою арқылы өзгертуге болады. Ол үшін төменгі мәзірден элементтерді таңдау керек: Tools → Customize → Interface..., ашыған диалогты терезеде пайдаланушы интерфейсінің параметрлері customize User Interface барлық CUI файлдарындағы Customizations аймағындағы Customize қосымшасында Menus элементін ашыңыз (сурет 2.6). 
          Әрі қарай, тінтуір меңзерін мәзір элементтерінің біріне орнатыңыз және тінтуірдің оң жақ батырмасын басу арқылы мәтінмәндік мәзірге қоңырау шалыңыз, онда бар мәзірді жою немесе жаңа мәзірлер жасау үшін тиісті элементті таңдаңыз.

          
          <div>
            <img src="img/img26.png" alt="" />
            <p>4.6-сурет. Менюдің қосымша терезесі</p>
          </div> 

        </p>
        </>}
        {add === 26 && <>
        <h2 className="readRight__title">Зертханалық жұмыс №1
AutoCad бағдарламасының экрандық элементтерімен  танысу.
Құралдар панелінің элементтерімен жұмыс</h2>
        <p>

          Мақсаты:  AutoCad бағдарламасының экрандық интерфейсімен таныстыру. Құралдар панелінің элементтерін пайдаланып  қарапайым сызбалар сызу.
          Қысқаша теория
          AutoCad - сызбалармен жұмыс жасау бағдарламасы. Бұл бағдарлама сызбаларды редактірлеуге мүмкіндік беретін және өзіндік қасиеті мен көмекшісі бар бағдарлама. 
          AutoCad кесінделерді,доғаларды, шеңберлерді және өзгеде нәрселерді өңдеу мен сызбалауға арналған құрал-саймандар мен панелдерден тұрады. Экранның жоғарғы беткейінде, мәзір қатарының астында стандартты мәзір(панель) орналасқан. Яғни, OPEN, SAVE, PLOT, және ZOOM, PAN және т.б.
          <br/><img className='ic' src="img/ic126.png" alt="" />
          Ескерту: AutoCad бағдарламасының ерекшелігі командалық жолына енгізген команда бойынша әр уақытта  сұрағына ғана жауап күтеді. Басқа командаға көшкіңіз келсе,  {"<Esc>"} батырмасын басуыңыз қажет.

          Line, Circle  командаларын пайдаланып төмендегі сызбаларды сызыңыз.

          <br/><img className='ic' src="img/ic125.png" alt="" />
          Тапсырмасы:
          {"1)	AutoCad бағдарламасын іске қосып, А4 форматын пайдалан."}
          {"2)	а)"} тапсырмасын орындау үшін, қабырғасы 40 бірлікке тең Квадрат сызамыз, ол үшін ПРИВ(SNAP) режимын таңдап,  СЕТКА, ОРТО кнопкаларын басыңыз.
            Құралдар сайманынан СЫЗЫҚ (Line) кнопкасын таңдаңыз немесе командалар    жолына Line (L) сөзін теріңіз де, Enter батырманы басамыз.
          Command:  Line
          Specife first point : 110,50
          Specife next point or[Undo] : 110,90
          Specife next point or[Undo] : 150,90
          Specife next point or[Close/Undo] : 150,50
          Specife next point or[Close/Undo] : c
          Command:
          {"3)  б)"} тапсырмасын орындау үшін, ПРИВ, ОРТО  режимінен шығып, Құралдар сайманынан Line құралды пайдаланып,  Үшбұрыш сызайық.
          Command:  Line
          Specife first point : 110,110
          {"Specife next point or[Undo] : @40<60"}
          {"Specife next point or[Undo] : @40<-60"}
          Specife next point or[Close/Undo] : c
          Command:
          {"4)  в)"} тапсырмасын орындау үшін, радиусы 20 бірлікке тең Шеңбер сызамыз. Ол үшін ПРИВ(SNAP) режимын таңдап,  құралдар сайманынан Circle кнопкасын басыңыз немесе командалар жолына  Circle сөзін теріңізде, Enter батырманы басамыз. 
          Жұмыс аймағында тышқанның көмегімен шеңбердің нұсқасын көрсетеміз. Содан соң командалар жолына барып тапсырма береміз.
                Specife center    point for circle or [3P/2P/Ttr(tan tan radius)] : 190,130
                Specife radius of  circle or [Diameter] :{" @20<0"}
         {" 5) Жоғарыдағы 2)-4)"} бөлімдерінде келтірілген тапсырмаларды орындай  отырып,  
              {"Г), Д), Е)"} тапсырмасын орында.


          Білім алушыға арналған өзіндік тапсырма:

          {"1)"}	AutoCad бағдарламасын орнату және жүктеу;
          {"2)"}	AutoCad бағдарламасының терезесіндегі құрал саймандардың қызметі мен рөлі;
          {"3)"}	Жаңа сызба(чертеж) орнын тағайындау және сақтау;
          {"4)"}	Командалық жол өрісінің қызметі және ерекшелігі;
          {"5)"}	Қалып-күй қатарының(Строка состояния) қызметі және сызба сызудағы мүмкіншіліктері;

        </p>
        </>}
        {add === 27 && <>
        <h2 className="readRight__title">Зертханалық жұмыс №2 Сызбаның түсін, түрін өзгеру</h2>
        <p>

          Мақсаты:  AutoCad бағдарламасы  саймандар мәзірінің Line, Rectange құралдар пайдаланып өлшемі берілген сызба сызу. {"Modify->"}Properties командасы арқылы сызбаның түсін, түрін өзгеруді үйрену.

          Қысқаша теория
            AutoCad бағдарламасында Draw (Рисование) мәзірін сызба сызу барысында жие пайдаланады. Төмендегі кесте арқылы батырманы жәны олардың аттарымен тасасыз.
          
            <br/><img className='ic' src="img/ic90.png" alt="" />

          Кесінді сызу үшін команда жолына пернетақтадан LINE сөзін енгізіп  {"<Enter>"} басамыз немесе Draw (Рисование) мәзірінен  <br/><img className='ic' src="img/ic75.png" alt="" /> Line (Отрезок) батырмасын таңдаймыз. 
            Командалық жолда Specify first point: (Первая точка:) сөзі шығып, кесіндінің алғашқы нүктесінің координатасын сұрайды.
          Бірінші нүктенің  координатасын берудің ең оңай жолы – тышқанды керек жерге апарып, сол жақ батырмасын шерту. Нүктені таңдаған кезде сол   жақ төменгі бұрыштағы координаттар счетчигіне қарауға болады. Сәйкесінше соңғы нүктенің координатасын да тышқанның көмегімен немесе командалық жолға нүктенің координатасын енгізуге болады.
          Сызбаның түрін немесе түсін өзгеру үшін, мәзір жолынан  {"Modify->"}Properties немесе Ctrl+1 пернелер комбинациясы арқылы ашылған терезесін пайдаланады.

          Кез келген   сызба объектілердің  түсін өзгерту.
          Алдымен AutoCad бағдарламасына кіріп,  А4 форматында мына чертежді салып алыңыз.
          
          {"А)"}                                                                                                                                                                                                                                                     
          <br/><img className='ic' src="img/ic124.png" alt="" />
                                            
          1 Тапсырма:
          Мәзір жолынан  {"Modify->"}Properties немесе Ctrl+1 таңдап, чертежді түгелімен белгілеп:
          1.	Ашылған терезеден Color (Цвет) жолына барып қызыл түстіні таңдаңыз. Ал Осьтік түзуді сары түске өзгертіңіз.
          2.	Ашылған терезеден Linetype жолына барып Batting  бөлімін таңдап, чертеждің тігінен тұрған объектісін белгілеп, өзгертіңіз.Сонымен қатар чертеждің горизонталь тұрған объектісін  Hidden  бойынша өзгертіңіз. 
          3.	Ашылған терезенің көмегімен чертеждің өз қауыңыз бойынша әртүрлі етіп өзгертіңіз.Мысалға  объектінің қабатын ( слой) өзгертіңіз.

          <br/><img className='ic' src="img/ic123.png" alt="" />

          Білім алушыға арналған өзіндік тапсырма:
          1 Тапсырма:  
          1.	Кесінді тұрғызудағы координата енгізудің әртүрлі әдістерін қолдану;
          2.	Объектіні таңдау және әртүрлі масштабта қарау;
          3.	Тіктөртбұрыш сызудың әртүрлігі;
          4.	Properties командасының қызметі;
          2 Тапсырма:
          AutoCad бағдарламасында, А4 форматында төмендегі өлшемдері берілген сызбаны сызыңыз. 
          <br/><img className='ic' src="img/ic122.png" alt="" />
        </p>
        </>}
        {add === 28 && <>
        <h2 className="readRight__title">Зертханалық жұмыс №3 Шеңбер, доға, кесіндіні пайдаланып өлшемдері берілген сызбаны сызу</h2>
        <p>
          Мақсаты:  AutoCad бағдарламасы  саймандар мәзірінің Сircle, Arc құралдар пайдаланып өлшемі берілген сызба сызу. Zoom командасын қолдануға үйрету.

          Қысқаша теория
          Шеңберлерді (дөңгелекті) салу үшін CIRCLE (шеңбер) командасымен орындалады. Команданы  Draw (Рисование) құралдар панеліндегі  <br/><img className='ic' src="img/ic82.png" alt="" />   батырмасы арқылы немесе Draw (Рисование) мәзіріндегі Circle (шеңбер) арқылы шақыруға болады. Онда алты пунктен тұратын  шеңбердің қажет координата мәнін енгізу түрлері көрсетілген. Бұлар: Center, Radius арқылы шеңбердің центрі мен радиусының координаталары енгізіледі;  Center, Diameter арқылы шеңбердің центрі мен диаметрінің координаталары енгізіледі;  2 Points, 3 Points арқылы шеңбердің бойындағы екі немесе үш нүктенің координаталары енгізіледі; Tan,Tan,  Radius арқылы шеңбердің екі бұрышы мен радиусының координаталары енгізіледі;  Tan,Tan,Tan  арқылы шеңбердің үш бұрышының координаталары енгізіледі; 
          Доға дегеніміз шеңбердің жартысы болып табылатын қисық. Оны құру үшін  ARC (доға) командасы қолданылады. Команданы пернетақтадан енгізуге болады, құралдар панеліндегі Draw (Сурет салу)  <br/><img className='ic' src="img/ic81.png" alt="" />  батырмасы арқылы немесе Draw (Сурет салу) мәзіріндегі Arc (доға) арқылы доғаның координатасын беру арқылы салуға болады.
          Тұрғызылған объектінің немесе салынып жатқан сызбаның бейнесін экран бетіне үлкейтіп немесе кішірейтіліп көру үшін, командалық жолға пернетақтаның көмегімен Zoom теріп немесе View- Zoom мәзірінен таңдауға болады. Сонда AutoCad бағдарламасының терезесінде пайда болады. 


          <br/><img className='ic' src="img/ic121.png" alt="" />

          Шеңбер, доға, кесіндіні пайдаланып өлшемдері берілген сызбаны сызу.

          {'А)'} Центрі (100,150) болатын шеңбер сызыңыз және екінші шеңберді де сызыңыз.
          {"Б) Доға сызу үшін Draw-> Arc->"} Center,start, end командасын орындап, доғаның центрімен  сағат тіліне қарсы бағыттағы доғаның бастапқы және шеткі нүктелерінің координаталар беріңіз.
          {"В)"} Екі түзу арқылы доғаларды қосыңыз. 
          <br/><img className='ic' src="img/ic119.png" alt="" />
          2-Тапсырма.
          <br/><img className='ic' src="img/ic118.png" alt="" />
          Білім алушыға арналған өзіндік тапсырма:
          1 Тапсырма:  
          1.	Полисызық, көпбұрыш, конструкционалдық сызық және сплайн құралдардың қызметі.
          2.	Доға, шеңбер, сақина, нүкте құралдардың қызметі.
          3.	Қалып күй қатарындағы мына командалар(ПРИВ, СЕТКА, ОРО, ПОЛЯР, О.ПРИВ, О.СЛЕД, ШТР, МОДЕЛЬ) қандай қызмет атқарады? 
          4.	Координалық есептеуіш(счетчик)  қандай қызмет атқарады?

        </p>
        </>}
        {add === 29 && <>
        <h2 className="readRight__title">Зертханалық жұмыс №4 Электрлық микросхеманың үзінді бөлігін салу</h2>
        <p>

          Мақсаты:  AutoCad бағдарламасында күрделі сызбалардың элементтерімен танысу. Объектіні штрихтап және бояуды үйрену. Сақинаның түрлерін салып үйрену.

          Қысқаша теория
          Штрихтау арқылы сызбаның әр түрлі жерлерін ерекшелеп, сол арқылы штрихталған объектінің қасиеттерін немесе түрін көрсетуге болады.
          Штрихтауды тек шектелген сурет фрагменттеріне ғана қолдануға болады. Ол үшін штрихталатын объектінің бір бөлігі экранда көрініп тұру керек.
          Сызбаның шектелген болігін штрихтауды  Hath жане Bhath командалары арқылы жүзеге асырылады. Ол үшін мәзір жолынан Рисование(Draw)-Шриховать...(Hath) немесе Рисование(Draw) құрал сайманынан  <br/><img className='ic' src="img/ic89.png" alt="" /> командасын таңдау қажет. Нәтижесінде «Штрих и Заливка Границ» ашылған терезесінен:
          {'1)'}	« Выбрать точку» батырмасын таңдау арқылы қажет объектіні ерекшелеп,  Enter батырмасын басу арқылы енгіземіз.
          {'2)'}	 Ашылған терезесінен Шаблон бөлімінен қажет түрін таңдаймыз.
          {'3)'}	ОК батырмасы арқылы терезені жабамыз.

          Сонымен қатар, объектіні бояуға болады. Ол үшін «Штрих и Заливка Границ» терезесінен «Градиент» бөлімін таңдау қажет. Бұл бөлімінің ерекшелігі, объектіні нақты бір түске бояу.
          Мысалға: 
          <br/><img className='ic' src="img/ic117.png" alt="" />
          Электрлық микросхеманың үзінді бөлігін салу.
          1.	Тіктөртбұрыш салу командасының көмегімен микросхеманың қаңқасын салыңыз.
          2.	микросхеманың өзін салуға кірісейік. Ол үшін {"Draw->"}Donut(Сақина) командасын таңдаңыз.
          3.	бұл команданың көмегімен сақинаның ішкі және сыртқы диаметрлерін беруге көмектеседі, яғни
          Command: fill
          Enter mode [ON/OFF] {"<ON>"}: off
          4. Fill командасының екі жағдайында пайдаланып көріңіз.
          {'а) ішкі диаметр=5 	б) ішкі диаметр=0	в)'} ішкі диаметр=18 	
            сыртқы диаметр=10 	сыртқы диаметр=10 	  сыртқы диаметр=20

            <br/><img className='ic' src="img/ic116.png" alt="" />
          2-тапсырма.
          Алдынды сабақта салынған сызбаға штрихтау мен бояу градиенттерін қолдану.
          (Зертханалық жұмыс №2)
          <br/><img className='ic' src="img/ic115.png" alt="" />
          Білім алушыға арналған өзіндік тапсырма:

          1.	Объектіні штрихтау және бояу командалардың ерекшеліктері;
          2.	 AutoCad бағдарламасында тез енуге арналған пернелер комбинацияларын анықтаңыз.
          3.	Экран бетінде сызбаны жылжыту дегеніміз не?
          4.	 AutoCad бағдарламасында объектіні байлау деген ұғым нені білдіреді?

        </p>
        </>}
        {add === 30 && <>
        <h2 className="readRight__title">Зертханалық жұмыс №5 AutoCad бағдарламасында параллельдік түзу тұрғызудың MLine және Offset командасының көмегімен үйрену</h2>
        <p>
          Мақсаты: AutoCad бағдарламасында параллельдік түзу тұрғызудың MLine және Offset командасының көмегімен үйрену. Өздігімен сызба сызуға үйрену.

          Қысқаша теория

            Параллельдік түзу салудың қажеттілігіне мысал ретінде үйдің жоспарын тұрғызуда қажет етеді. AutoCad бағдарламасында параллельдік түзу тұрғызудың 2 әдісі бойынша орындауға болады. 
            Бірінші әдіс, MLine  командасы арқылы параллельдік түзу немесе доға алуға болады. 
          Екінші әдіс, Offset командасының көмегімен объектінің немесе түзудің көшірмесін қажет аралыққа жылжыту керек. Нәтижесінде көшірме түпнұсқасының параллелі болып шығады. Бұл әдіс ,яғни, екінші әдіс өте ыңғайлы, өйткені барлық түзу түрлеріне қолдануға болады. Себебі, Offset командасы полисызық, сплайн түзулері мен қисық, тұйық сызықтардың параллель көшірмесін алуға жеңіл. 
          Қажеттілік бойынша кез-келген объектінің параллельдік көшірмесін Offset командасы арқылы жеңіл және шапшаң орындалады.

          Параллельдік түзу тұрғызу.
          1.	AutoCad бағдарламасын іске қосып, А4 форматында төмендігі сызбаларды сызыңыз
          <br/><img className='ic' src="img/ic114.png" alt="" />
          2.	Modify  панелінен Offset командасын таңдаңыз немесе командалық жолға О әрпін теріп, Enter  пернесін басыңыз.
          3.	Specify offset distance or [Through] {"<Through>"}: сұрауға төбе координаларын енгізу арқылы немесе тышқанның көмегімен объектіден параллель орналасу аралығын көрсету қажет.
          4.	Select object to offset or {"<exit>"}: сұрауға параллельдігін алу объектісін ерекшелеу арқылы көрсету қажет.
          5.	Specify point on side to offset:   сұрауға параллель көшірменің орналасу бағытын көрсету қажет.
          6.	3,4 -әрекеттерді қайталау арқылы бірнеше параллель түзулерді алуыңызға немесе Enter  пернесін басу арқылы Offset командасын тоқтатуыңызға болады.


          Білім алушыға арналған өзіндік тапсырма:

          1.	Offset командасының қызметі;
          2.	Мультисызық тұрғызу командасының ерекшелігі;
          3.	 AutoCad бағдарламасындағы MLine  командасының қызметі;
          4.	AutoCad бағдарламасындағы Revision Cloud  командасының қызметі.

        </p>
        </>}
        {add === 31 && <>
        <h2 className="readRight__title">Зертханалық жұмыс №6 Объектінің өлшем мәндерін экран бетіне шығаруды үйрену</h2>
        <p>
          Мақсаты:  AutoCad бағдарламасында объектіні редакциялау, соның ішінде доғалауды үйрету. Объектінің өлшем мәндерін экран бетіне шығаруды үйрену.
          Қысқаша теория
          Объектіні  жалпы редакциялау командаларының  батырмалары MODIFY (Редактирование) панелінде орналасқан. Осы командалардың әрқайсысын командалық жолға атын енгізу арқылы қосуға болады немесе MODIFY(Редактирование)  мәзірінен  таңдалады.

          <br/><img className='ic' src="img/ic113.png" alt="" />
          Берілген топтардың көптеген командалары  алдын-ала таңдалынып  алынған объектінің жиынтығымен жұмыс жасай  береді немесе бұл жиынның жоқ болған жағдайында  сұрақ сұралады. Жұмыс жасауға ыңғайлы болу үшін MODIFY панелінде 11 бөлікке бөлінген: erase (кетіру, өшіру); copy (көшірмесін алу); mirror(остік симметриялы); offse (көлемін кішірейту немесе үлкейту); rotate (бұру); select (таңдау); trim (қию); array (массив); extend (ұзарту); fillet (бұрышты тікке қию); chamfer (бұрышты дөңгелету). 
          Тұрғызылған объектінің немесе салынып жатқан сызбаның бейнесін экран бетіне өлшемін көру үшін, командалық жолға пернетақтаның көмегімен Dimension теріп немесе View- Dimension мәзірінен таңдауға болады. Сонда AutoCad бағдарламасында төмендегідей терезесінде пайда болады. 


          <br/><img className='ic' src="img/ic112.png" alt="" />

            Пластина дайындау. Бұрышты доғалау.	

          1.	Line командасының көмегімен пластинаның қаңқасын тұрғызыңыз, ең ыңғайлысы ORTHO режимін қосу
          2.	тұрғызылған пластинаның бұрышын доғалау үшін Modify- Fillet командасын таңдаңыз немесе экранның сол бөлігінде тұрған құралдардан сәйкес құралды таңдаңыз.
          Command: _fillet
          Current settings: Mode = TRIM, Radius = 0.0000
          Select first object or [Polyline/Radius/Trim/mUltiple]: r
          Specify fillet radius {"<0.0000>"}: 10
          Доғалайтын бұрыштың қабырғаларын таңдаңызда Enter батырмасын басыңыз.
          3.	Пластинаның төменгі бұрыштарын келтіру үшін: Modify- Chamfer немесе экранның сол бөлігінде тұрған құралдардан сәйкес құралды таңдаңыз.
          Command: _chamfer
          (TRIM mode) Current chamfer Dist1 = 0.0000, Dist2 = 0.0000
          Select first line or [Polyline/Distance/Angle/Trim/Method/mUltiple]: d
          Specify first chamfer distance {"<0.0000>"}: 15
          Specify second chamfer distance {"<15.0000>"}: 15.

          Бұрыштың қабырғаларын таңдаңызда Enter батырмасын басыңыз.
          Білім алушыға арналған өзіндік тапсырма:
          1.	Объектіні декдакциялау;
          2.	командалардың erase (кетіру, өшіру); copy (көшірмесін алу) қызметтері;
          3.	Мirror(остік симметриялы); offse (көлемін кішірейту немесе үлкейту); rotate (бұру) объектіні редактірлеу командалардың қызметі;
          4.	 Select (таңдау); trim (қию); array (массив) редактірлеу командалардың қызметі;
          5.	extend (ұзарту); fillet (бұрышты тікке қию); chamfer (бұрышты дөңгелету) редакциялау командалардың қызметі
          <br/><img className='ic' src="img/ic111.png" alt="" />
        </p>
        </>}
        {add === 32 && <>
        <h2 className="readRight__title">Зертханалық жұмыс №7 Trim және Extend командасын қолдану</h2>
        <p>
            Мақсаты: AutoCad бағдарламасында Trim және Extend командасын қолданып білу. 

          Қысқаша теория

            AutoCad бағдарламасында жай түзуді басқа объектінің шекарасына дейін жалғастыру немесе созу немесе керісінше, объектінің қиылысқан шекарасымен түзуді қажет етеді.
            Trim командасының көмегімен бірнеше объектінің қиылысу нүктелер көрсету арқылы артық түзулерді қиюға немесе жоюға болады. Сонымен қатар, Trim командасы арқылы  қажетінше түзудің ұзындығын созуға мүмкіндік береді. 
            Extend командасы арқылы қажетінше түзудің ұзындығын созуға немесе басқа объектінің шекарасымен қиылысуға мүмкіндік береді. Тек ескеретініміз түзуді ұзарту барысында Shift  пернесін басу қажет.

          Түзуді қию және жалғастыру.
          1.	AutoCad бағдарламасын іске қосып, А4 форматында төмендігі сызбаларды сызыңыз
          <br/><img className='ic' src="img/ic110.png" alt="" />
          2.	Modify-Trim командасын таңдау немесе командалық жолға Tr сөзін теру арқылы команданы іске қосыңыз
          3.	Select cutting edges ... сұрауға қию шекарасын көрсету немесе ерекшелеу  қажет ( қию қажет объектіні немесе тобын ерекшелегеннен соң Enter  пернесін басыңыз)
          4.	Select object to trim or shift-select to extend or [Project/Edge/Undo]:   сұрауға Shift  пернесін басып отырып, объектінің қажет емес қиятын жерлерінен тышқанның көмегімен көрсету қажет. (нүктемен белгіленген)
          5.	Trim командасын тоқтату үшін Enter  пернесін басыңыз.
          Нәтижесінде  төмендегідей сызбаңыз шығады.
          <br/><img className='ic' src="img/ic109.png" alt="" />
          Білім алушыға арналған өзіндік тапсырма:
          Modify-Extend командасы арқылы төмендегі сызбаны сызыңыз
          1.	Trim командасын пайдаланыңыз.

          2.	Extend командасын пайдаланыңыз.
          <br/><img className='ic' src="img/ic108.png" alt="" />
        </p>
        </>}
        {add === 33 && <>
        <h2 className="readRight__title">Зертханалық жұмыс №8 Объектінің көшірмесін алу. Массив</h2>
        <p>

          Мақсаты:  AutoCad бағдарламасында объектінің көшірмесін алу, бұру, қию және орнын  ауыстыруды үйрену. Array командасының мүмкіншілігімен танысу .

          Қысқаша теория
          MODIFY (Редактирование) панеліндегі келесі батырма  copy батырмасы көшіру командасын жүзеге асырылады. Алынған объектінің параллельдігін сақтап, бастапқы және соңғы нүктелерімен беріліп, көшірмесін шығарып алуға болады. Егер команданы іске қосқан кезде объектінің таңдап алмаған болсаңыз, онда объектіні таңдап алу үшін тағы да сұрақ қойылады.  Объектіні таңдап алғаннан кейін оны аяқтау үшін enter  пернесін басу арқылы жүзеге асады немесе  тышқанның оң жақбасқышын басып  және контексті  мәзірден enter пунктін басамыз.Обектіні көшіріп алу операциясын таңдап алғаннан кейін команданың бірінші сұрағы шығады.  
                Сонымен келесі кезекте екінші нүктесінің координатасын көрсетеміз.  Көрсету нәтижесінде пайда болған  объектімізді берілген түпнұсқасының көшірмесін шығарады.  
          MODIFY(Редактирование)  панеліндегі батырмалары  mirror командасына остік бойынша  көшіру сай келеді. Бұл команда таңдап алынған объектінің  айнасын екінүкте арқылы  шығарып отырады.  
                Егер объектінің  түпнұсқасы қажет болмаса, онда Y/N бойына N әрпін жазамыз немесе Enter пернесін басу арқылы жүзеге асады. Ал қарсы жағдайда  YES (ия) деп жазамыз. 
          Rotate (Бұру)  командасының көмегімен объектіні қажет бұрышқа бұруға мүмкіндік береді. ерекшелеу арқылы кез келген объектіні ENTER клавишы арқылы ерекшелеп аяқтау объектісі. 
          ARRAY (Массив) – Объектіні тікбұрыш және шеңбер түріндегі массив тәріздес көбейтуге болады.

          Объектінің көшірмесін алу. Массив.
          Суретте берілгендей пластинаға 2 шеңберді салу  үшін, алдымен бір шеңберді салып, екіншісін көшіреміз.
          1.Радиусы 10- ға тең шеңбер салыңыз.
          2. Modify-Copy. Командасы арқылы орындаңыз.
          3. Енді  радиусы 2,5-ке тең шеңбер салып, массивтің көмегімен көбейтейік.
          4.Modify-Array командасын немесе экранның сол бөлігінде тұрған құралдардан сәйкес құралды таңдаңыз.Массивтің өзі екіге бөлінеді: тікбұрышты және полярлы.
          5. Полярлы массивті таңдап, «Выбрать объект» жасап, «число объекта» -ға 12 санын енгізіп, ОК батырмасын басыңыз.

          Тапсырма № 4. Бұру және Объектінің айналық көшірмесі ( зеркально отображение ).
          1. Пластинаның құрамына кіретін ішкі төртбұрыштыны салып,оны 30 градусқа бұрамыз. Ол үшін: Modify –Rotate(Повернуть) командасын таңдап, тышқанның көмегімен  төртбұрыштыны белгілеп, Enter –ді басыңыз.
          Сонда 
          Command: _rotate
          Current positive angle in UCS:  ANGDIR=counterclockwise  ANGBASE=0
          Select objects: 1 found
          Select objects:
          Specify base point:
          Specify rotation angle or [Reference]: -30 
          (-30 градусты беруміздің себебі, сағат тілі бойынша бұру болған соң)
          2. Екінші төртбұрыштыны салу үшін Modify-Mirror(Отражение) командасын немесе экранның сол бөлігінде тұрған құралдардан сәйкес құралды таңдаңыз. таңдаңыз.
          Command: _mirror
          Select objects: 1 found
          Select objects:                                        (`Enter`)
          Specify first point of mirror line: Specify second point of mirror line:( тышқанның көмегімен симметрия осінің бастапқы нүктесін көрсетіңіз)
          Delete source objects? [Yes/No] {'<N>'}:N
          <br/><img className='ic' src="img/ic102.png" alt="" />

          Білім алушыға арналған өзіндік тапсырма:

          1.	AutoCad бағдарламасында, А4 форматында төмендегі өлшемдері берілген сызбаны сызыңыз.
          <br/><img className='ic' src="img/ic103.png" alt="" />
        </p>
        </>}
        {add === 34 && <>
        <h2 className="readRight__title">Зертханалық жұмыс №9 Мәтінмен жұмыс.( Текст)</h2>
        <p>

          Мақсаты:  AutoCad бағдарламасында сызбаға мәтін енгізуді үйрену және мәтінді пішімдеуді , оның қасиетімен танысу.

          Қысқаша теория
          AutoCad бағдарламасында мәтінді енгізу Dtext және Mtext командалары арқылы орындалады. Dtext командасы мәтін жолын (бір жолды мәтін), ал Mtext командасы арқылы мәтіндік абзац (көп жолды мәтін) енгізуге арналған. Мәтіндік жол немесе мәтіндік абзац AutoCad бағдарламасында кәдімгі кесінді, шеңбер секілді объект болып саналады. Мәтіндік объектіні графиктік объектілер секілді жоюға, орнын ауыстыруға, бұруға және тағы басқалай редактірлеуге болады. 
          Мәтінді енгізу үшін командалық жолға Dtext немесе Mtext деп теруіңіз қажет; немесе Стандартты мәзіріндегі Draw мәзірінен таңдауға немесе құралдар панелінен Multiline text (параграф) немесе Singleline text (мәтіндік жол) командалық батырмасын таңдауыңыз қажет.
          Сызба сызу барысында Dtext командасында әдейі символдар енгізу қажет болады. Бұл символдарды командалық жолға төмендегідей кодтар арқылы енгізіледі.
          <br/><img className='ic' src="img/ic91.png" alt="" />


          Мәтінмен жұмыс.( Текст)

          1.	AutoCad бағдарламасын ашып, А4 форматын құрыңыз.
          2.	Layout1 режиміне(Вкладка) көшіңіз.
          3.	 {'Draw( черчение) ->'} MText немесе құралдар саймандарынан    А батырмасын таңдаңыз. Сонда командалар жолында мыналар пайда болады.
          Command:
          Command: _mtext Current text style:  "Standard"  Text height:  40
          Specify the first corner: 100.50
          Specify the opposite angle or [Height/Justify/Line 
          spacing/Rotation/Style/Width]: h
          Specify the height {"<40>"}: 30
          4.	Ашылған Мәтіндік терезеге Өзіңіздің аты-жөніңізді жазыңыз.
          5.	« Форматирование текста» терезесінің көмегімен жазған Аты-жөніңізді ұнатқан түске бояп, әртүрлі шрифтіні, стилін өзгертіңіз.
          6.	3,4 тапсырмаларды тағыда орындап, енді өзіңіздің туған күніңізді, топ номірін жазыңыз.
          7.	Формат- Стиль текста командасын орындаңыз.
          8.	Ашылған терезенің көмегімен мәтінді керегіңше вертикальды түрде орнатыңыз, сонымен қатар мәтінді 300 бұрышқа бұрыңыз.

          Білім алушыға арналған өзіндік тапсырма:

          1.	Сызбаны қағаз бетіне шығару. Плоттермен жұмыс; 
          2.	Берілген тапсырмадағы мәтінді AutoCad бағдарламасын ашып, А4 форматында өзіңізге  ұнағанша көркемде;
          <br/><img className='ic' src="img/ic92.png" alt="" />
        </p>
        </>}
        {add === 35 && <>
        <h2 className="readRight__title">Зертханалық жұмыс №10 Қабаттың қасиеттерін  пайдаланып, күрделі сызбаны сызу</h2>
        <p>
          Мақсаты:  AutoCad бағдарламасында қабатпен жұмыс. сызбаға мәтін енгізуді үйрену және мәтінді пішімдеуді , оның қасиетімен танысу.

          Қысқаша теория
          Өте күрделі сызбалар сызған кезде, ары қарай олармен жұмысты жеңілдету үшін, бөлек объектіге немесе объектілер тобына ат беру қажет болады. Бұл әсіресе AutoCad ортасында күрделі суреттер мен өзінің қосымшаларын салған кезде маңызды. Бұл мақсатта примитивтердің тағы бір қасиеті – қабаттар қызмет атқарады. Сонымен қатар қабат қазір маңызды емес объектілерді қатыра тұруға, яғни оларды жоймай, көрінбейтіндей қыла алады, ал бұл басты объектілермен жақсы жұмыс жасауға мүмкіндік береді. Қабаттармен жұмыс жасаудың негізгі командасы болып LAYER командасы табылады, ол Layers панеліндегі  <img className='ic' src="img/ic93.png" alt="" />  батырмасына сәйкес келеді. Қабатты қосудың тағы бір жолы - Format (Формат) мәзіріндегі Layer пункті болып табылады. 
          Ағымдағы қабат – бұл жаңа объектілер салынатын қабат. 
          Оң жақ үстіңгі бұрышта мынадай батырмалар орналасқан: 
          	 New (Новый) — жаңа қабат салады; 
          	 Delete (Удалить) — суреттен қабатты жояды (бұл тек қабат қолданыстағы емес болғанда ғана мүмкін); 
          	 Current (Текущий) — ағымдағы қабат қылып басқа қабат атын орналастырады, бұл ат CLAYER жүйелік айнымалысына енгізіледі; 
          	 Show details (С подробностями) — терезенің төменгі жағында белгіленген қабаттың барлық қасиеттерін толық түрде көрсетеді; 
          	 Save state (Сохранить состояние) — ағымдағы қабаттың орнатуларын келесіде қалпына келтіру үшін кеңейтілуі las болатын конфигурация файлында сақтайды; 
          	 State Manager (Диспетчер конфигураций слоев) — бұрын las кеңейтілуімен сақталған файлдағы қабаттар орнатуларын қалпына келтіруді таңдауға мүмкіндік беретін диалогтық терезені шақырады. 
          Қабаттың қасиеттерін  пайдаланып, күрделі сызбаны сызыңыз.

          Білім алушыға арналған өзіндік тапсырма:
          1.	Қабаттар және оның қасиеті;
          2.	Объектінің қасиеттерімен жұмыстану;
          3.	AutoCad бағдарламасында сызылған сызбаны Web сайтына орнату ерекшелігі;

        </p>
        </>}
        {add === 36 && <>
        <h2 className="readRight__title">Зертханалық жұмыс №11 Үш өлшемді координаты жүйесін оқыту</h2>
        <p>
        
          Мақсаты:  AutoCad бағдарламасында үш өлшемді модельдеу тұрғызу. Кеңістіктегі координаталық жүйеде объектілермен танысу.

          Қысқаша теория
            AutoCad жүйесінде тек қана екі өлшемді модельдеуден басқа үш өлшемді модельдеугеде болады. AutoCad жүйесінде үш өлшемді модельдеу үшін көптеген қосымша бұйымдар, объектттер қосылған (торлар, денелер, т.б.). Қосымша бұйымдар және торлар, объекттер арқылы үш өлшемді модель сызғанда оңай болып келеду, ол арқылы ғимараттар, құрылғылар және машинотехникалық бұйымдардыңда моделін тұрғызуға болады. Біз осы үш өлшемді модельдеу көмегі арқылы үш өлшемді модельдеуді үйренеміз және осы модельдерді әр жағынан және әртүрлі проекцияда қараймыз. Осы өзіміз сызған үшөлшемді сызбаны керек түсімізге бояуға, қараңғылауға және көрінбейтін сызықтарды алып тастауға AutoCad жүйесі арқылы өзгертуге болады.
            Сіз білетін біздер біз екі жүйелі координатта (XY) сызбалар сыздық. Үш өлшемді модель тұрғызу үшін тағы бір ось Z осін қолданамыз. Бұл XY осіне перпендикуляр орналасады.

          Үшөлшемді координаты жүйесін оқыту.

          1. Жаңа бетті ашыңыз.
          2. Мәзір жолынан Views- 3D Views – SW Isometric командаларын орындаңыз. Терезені үлкейтіңіз.
          3. Line командасын таңдаңыз 
          Command:
          Command: _line Specify first point: 70,90,0
          Specify next point or [Undo]: 70,120,0
          Specify next point or [Undo]: @140,0,0
          Specify next point or [Close/Undo]: @0,-20,0
          Specify next point or [Close/Undo]: @0,0,80
          Specify next point or [Close/Undo]: @-30,0,0
          Specify next point or [Close/Undo]: c
          Нәтижесінде мынадай тұйық сызық пайда болды.
          Келесі объектіні өздіңізбен тұрғызыңыз:
          Бастапқы  нүктенің координатасы: (20,30,0)
          
          Келесі тапсырманы өздігімен салыңыз.

          Білім алушыға арналған өзіндік тапсырма:
          1.	AutoCad бағдарламасында үш өлшемді координаталық жүйесі;
          2.	Үш өлшемді объектінің бейнесі;
          3.	Үш өлшемді координатаны енгізу әдістері.
        </p>
        </>}
        {add === 37 && <>
        <h2 className="readRight__title">Зертханалық жұмыс №12 Полисызықтың негізінде модельдеу</h2>
        <p>

          Мақсаты:  AutoCad бағдарламасында үш өлшемді модельдеу тұрғызуда полисызық командасын қолдануды үйрену. Кеңістіктегі координаталық жүйеде объектілермен танысу.

          Қысқаша теория
            AutoCad бағдарламасының тағы бір мүмкіншіліктерінің ерекшелігі, бұл үш өлшемді фигураларды тұрғызуда немесе салуда көптеген құрал саймандардың әртүрлі тәсілмен пайдаланып қажет объектіні тұрғызу.Соның ішіндегі полисызық командасы әмбебап болып саналады. Себебі, полисызық командасының көмегімен құрама объектілерді немесе көлемді модельдерді тұрғызуға мүмкіндік береді. Мысалға жазықтықта сызылған түзудің қалыңдығының мәнін өзгертсек, үш өлшемді координатада бұл сызбамыз жарға (стена) ұқсас объект болып шығады.  

          Полисызықтың негізінде модельдеу

          1.	AutoCad бағдарламасынан Tools(Сервис )-NewUSC-3point командасын іске қосыңыз.
          2.	Polyline командасы арқы кезкелген қолауыңызша сызба сызыңыз. Бастапқы нүктесі координаталар басында орналассын.
          3.	Modife-Object- Polyline командасы арқылы кеңістіктегі полисызықты ерекшеліңіз.
          4.	Enter an option [Close/Join/Width/Edit vertex/Fit/Spline/Decurve/Ltype gen/Undo]: сұрауына S пернесін басыңыз, сонда полисызығымыз сплайн сызығына айналады. 
          5.	Объектінің жанама мәзірінен Properties (Свойства-қасиеті) командасынан Thickness (толщина- қалыңдығы) өрісіне 4 мәнін таңдаңыз.
          Нәтижесінде полисызық кеңістікте қисық түріне айналады.

          Білім алушыға арналған өзіндік тапсырма:

          Төменде келтірілген сызбаларды үш өлшемді координата жүйесінде орындап көріңіз.

        </p>
        </>}
        {add === 38 && <>
        <h2 className="readRight__title"> Зертханалық жұмыс №13 Монолиттік моделін тұрғызу</h2>
        <p>
          Мақсаты:  AutoCad бағдарламасында үш өлшемді модельдеу тұрғызу. Кеңістіктегі координаталық жүйеде объектілермен танысу.

          Қысқаша теория
              Объектілерді көрсетуде үш модел типі пайдаланылады, олар: Каркасты, сыртқы және монолитті. Осы моделдердің әр түріне AutoCAD-өзінің құру әдістері бар. Мысалы каркасты моделдеуде қарапайым командалар пайдаланылса, яғни екі өлшемді сызуға арналған командалар. 
            Монолитті  моделдерді құрғанда қарапайым денелер (үш өлшемді, қарапайым геометриялық параллелепипед, конус, клинь, цилиндр сияқты денелер) мен теорияның көптүрлі операциялар арқылы жасалған қосылыстарды есептеу мен айырудан туады. Бұл моделдеудің өндірістік жағдайда пайдаланылатын жеңіл де қарапайым түрі.

          Құрылымды блокты стереометрия
              AutoCad құрамына қарапайым формалардың көмегімен күрделі үш өлшемді құратын теоретикалық-көпшілік операциясы бүтін модел ACIS кіреді. Модельдеудің бұл түрін көбінесе құрылымдық блокты тереометрия (Constructive Solid Geometry, CSG)д.а.
          ACSG көмегімен бүтін модельдерді құру 4 әдістен тұрады:
          1.	Үш өлшемді жолмен басылатын немесе айналатын екі немесе үш өлшемді формадағы примитив моделін құру.
          2.	Құру кезінде немесе ауыстыру нәтижесінде примитивтерді бір-біріне қатысты етіп алмастыру.
          3.	Құрамды денелер құрастыру мақсатында көп теоретикалы операциясын пайдалану 
          4.	Solidedit командасындағы әр түрлі командаларды пайдалану арқылы құрамды дене моделін жасау.
          Монолиттік моделі
          1. Параллелепипед
          Вox командасын шақырып,  параллелепипед тұрғызамыз, алғашқы бұрыш(100,50,0) нүктесінде .
          Command: _box
          Specify corner of box or [Center] {"<0,0,0>"}: 100,50,0
          Specify corner or [Cube/Length]: L  
          Specify length: 80                             
          Specify width: 40                                                                                               
          Specify height: 50 
          <br/><img className='ic' src="img/ic94.png" alt="" />

          2.Конус
          Конусты тұрғызу үшін:  Cone командасы арқылы тікконус тұрғызылады. Объектінің құрылған санын өтпелі құрылым ISOLINES ауыспалысы арқылы білуге болады.
          Command: _cone
          Current wire frame density:  ISOLINES=4 
          Specify center point for base of cone or [Elliptical] {"<0,0,0>"}: 
          250,70,0
          Specify radius for base of cone or [Diameter]: 15                           
          Specify height of cone or [Apex]: 50     
          <br/><img className='ic' src="img/ic95.png" alt="" />



          3. Цилидр.
          Cylinder  командасы арқылы эллипстік немесе дөңгелек  түріндегі цилидрлерді тұрғызуға болады.
          Command: _cylinder
          Current wire frame density:  ISOLINES=4
          Specify center point for base of cylinder or [Elliptical] 
          {"<0,0,0>"}: 80,200,0
          Specify radius for base of cylinder or [Diameter]: 20
          Specify height of cylinder or [Center of other end]: 50
          <br/><img className='ic' src="img/ic96.png" alt="" />


          Білім алушыға арналған өзіндік тапсырма:
          1.	Каркасты және монолитті моделдерді құру;
          2.	Конструктивті блокты стереометрияның негізі;
          3.	Үш өлшемді примитив командасын құру;

        </p>
        </>}
        {add === 39 && <>
        <h2 className="readRight__title">Зертханалық жұмыс №14 Монолиттік моделін тұрғызу-2</h2>
        <p>
          Мақсаты:  AutoCad бағдарламасында үш өлшемді модельдеу тұрғызу. Кеңістіктегі координаталық жүйеде объектілермен танысу.
          Қысқаша теория
          Монолиттік моделі – Үшөлшемді координата жүйесінде, яғни кеңістікте блоктар тұрғызу базасы, блоктардың көмегімен курделі монолиттік моделдерді тұрғызу. AutoCad бағдарламасына қосымша монолиттік моделі кіреді. Бұл іс әрекетті көбіне моделдеудің  блоктік конструктор арқылы стереометрияны тұрғызу деп атайды. Яғни AutoCad бағдарламасында  тұрғызу үшін, алдымен Draw(Черчение)-Toolbars(Панели инструментов)-Solids(Сплошные) командасын орындау қажет.
          Монолиттік моделі
          4. Клин
          Wedge командасының көмегімен. Клин негізі ХУ жазықтығына паралель және оның бір қабырғасы Х осімен қиылысып жатады.
          Command: _wedge
          Specify first corner of wedge or [CEnter]  {"<0,0,0>"}: 150,180,0
          Specify corner or [Cube/Length]: L
          Specify length: 80
          Specify width: 40
          Specify height: 50
          <br/><img className='ic' src="img/ic97.png" alt="" />

          5.Сфера
          Sphere командасының көмегімен сфера салынады. ISOLINES=6. 
          Command: _Sphere
          Current wire frame density:  ISOLINES=6
          Specify center of sphere {"<0,0,0>"}: 330,70,25
          Specify radius of sphere or [Diameter]: 25
          <br/><img className='ic' src="img/ic98.png" alt="" />
          6. Примитивті монолиттік тор.
          Torus командасы арқылы радиус (или диаметр) 
          трубаның дөңгелектің радиус және   тордың осьтік 
          центрі( трубаның центрі арқылы өтетін).
          ISOLINES=20.Torus командасын шақырып,       тор радиусы 40 мм, трубаның радиусы 20мм тең.

          Command:
          Command: _torus
          Current wire frame density:  ISOLINES=20
          Specify center of torus {"<0,0,0>"}: 280,260,25
          Specify radius of torus or [Diameter]: 40
          Specify radius of tube or [Diameter]: 20
          <br/><img className='ic' src="img/ic99.png" alt="" />
          Білім алушыға арналған өзіндік тапсырма:
          1. Өздігімен мына фигураларды кеңістікте салыңыз.
          <br/><img className='ic' src="img/ic100.png" alt="" />
        </p>
        </>}
        {add === 40 && <>
        <h2 className="readRight__title">Зертханалық жұмыс №15 Тонирленген режимнің командаларымен жұмыс</h2>
        <p>
          Мақсаты:  AutoCad бағдарламасында үш өлшемді координатасында салынған модельдердің пішімін толық көру үшін тонирленген режимінің командалармен   танысу.
          Қысқаша теория
          Объектінің структурасын толық көріп байқау үшін кей жағдайда тонирленген режиміне көшу қажет. Объектінің пішімін толықтай көру үшін, оның қасиетінен ашық түсін таңдаған жөн. Тонирленген режимге көшу үшін View-Shade командасынан 6 түрін таңдауға болады. Бұлар: 2DWireframe, FlatShaded, Hidden, FlatShaded, т.б.
          Объектінің пішімін тонирленген режимі арқылы өзгерту.
          <li>1.	AutoCad бағдарламасында  үш өлшемді координатасына көшу үшін View-3DViews-SWIsometric командасын орындаңыз. </li>
          <li>2.	Draw-Toolbars-Solids командасы арқылы модельдер панелін шығарып алыңыз.</li>
          <li>3.	Кез - келген өлшемдермен сфера салыңыз.</li>
          <li>4.	Объектінің жанама мәзірінен қасиеттер командасын шақырып, сфераның түсін өзгертіңіз.</li>
          <li>5.	 View-Shade командасынан 6түрі бойынша объектінің пішімін өзгертіңіз.</li>
          БІЛІМ АЛУШЫЛАРДЫҢ ӨЗІНДІК ЖҰМЫСЫНА ТАПСЫРМАЛАР:

          Тақырып 1. Жұдырықшаның контурын құру
          Жұдырықшаның контурын құруға арналған мәліметтер жеке болып табылады. Олар нұсқаларда ұсынылған. Білім алушы тапсырманың нұсқасын орындайды, оның нөмірі оның шифрының соңғы үш санының қосындысына сәйкес келеді. Егер, мысалы, 681133 білім алушының сынақ шифры болса, онда ол тесттің бірінші бөлігінің тақырыптары бойынша барлық сызбаларда 7-ші орындайды (1+3+3=7) опция. Графикалық жұмысты қарындашпен А3 (420х297) форматындағы сызба қағаз парағында орындау керек. Жұмыстың бастапқы кезеңінде студент ГОСТ ережелерін зерделеуі керек 2.301-68, 2.302-68, 2.304-68.
          Өз нұсқаңыздың сызбасының мазмұнымен танысыңыз. Өз нұсқасының жұдырықшасын құрайтын лекальды қисықтардың құрылысын зерттеу (34.2 тарау [1]). Эллипстің берілген нүктесіне тангенс салу үшін оның фокустарымен eѐ қосу керек. Алынған бұрыштың биссектрисасы берілген нүктеде эллипске қалыпты. Нормаларға перпендикуляр түзу-берілген нүктеде эллипске жанама. Бір түзуден немесе қисық сызықтан екіншісіне тегіс өтулер конъюгациялар деп аталады. Конъюгацияларды құру үшін 35-тарауда көрсетілген материалды зерттеу қажет [1].
          Әр нұсқада жұдырықшаның контурын салу OX және OY осьтерін қолданудан басталады. Содан кейін берілген параметрлер бойынша лекальды қисықтар құрылады және жұдырықшаның контурына кіретін қисықтардың учаскелері ажыратылады және тегіс өту нүктелерін анықтайды. Rx белгісі радиустың құрылыспен анықталатынын көрсетеді. Сызбада Rx орнына * белгісі бар тиісті санды қою керек (анықтамалар үшін өлшем).
          Тапсырма опциялары 1-кестеде келтірілген. 1-тақырып бойынша сызбаны орындау мысалы 1-суретте келтірілген.
          <div>
            <img className='ic' src="img/ic107.png" alt="" />
          </div>

        </p>
        </>}
        {add === 41 && <>
        <h2 className="readRight__title">Тақырып 1. Жұдырықшаның контурын құру</h2>
        <p>
          Жұдырықшаның контурын құруға арналған мәліметтер жеке болып табылады. Олар нұсқаларда ұсынылған. Білім алушы тапсырманың нұсқасын орындайды, оның нөмірі оның шифрының соңғы үш санының қосындысына сәйкес келеді. Егер, мысалы, 681133 білім алушының сынақ шифры болса, онда ол тесттің бірінші бөлігінің тақырыптары бойынша барлық сызбаларда 7-ші орындайды (1+3+3=7) опция. Графикалық жұмысты қарындашпен А3 (420х297) форматындағы сызба қағаз парағында орындау керек. Жұмыстың бастапқы кезеңінде студент ГОСТ ережелерін зерделеуі керек 2.301-68, 2.302-68, 2.304-68.
          Өз нұсқаңыздың сызбасының мазмұнымен танысыңыз. Өз нұсқасының жұдырықшасын құрайтын лекальды қисықтардың құрылысын зерттеу (34.2 тарау [1]). Эллипстің берілген нүктесіне тангенс салу үшін оның фокустарымен eѐ қосу керек. Алынған бұрыштың биссектрисасы берілген нүктеде эллипске қалыпты. Нормаларға перпендикуляр түзу-берілген нүктеде эллипске жанама. Бір түзуден немесе қисық сызықтан екіншісіне тегіс өтулер конъюгациялар деп аталады. Конъюгацияларды құру үшін 35-тарауда көрсетілген материалды зерттеу қажет [1].
          Әр нұсқада жұдырықшаның контурын салу OX және OY осьтерін қолданудан басталады. Содан кейін берілген параметрлер бойынша лекальды қисықтар құрылады және жұдырықшаның контурына кіретін қисықтардың учаскелері ажыратылады және тегіс өту нүктелерін анықтайды. Rx белгісі радиустың құрылыспен анықталатынын көрсетеді. Сызбада Rx орнына * белгісі бар тиісті санды қою керек (анықтамалар үшін өлшем).
          Тапсырма опциялары 1-кестеде келтірілген. 1-тақырып бойынша сызбаны орындау мысалы 1-суретте келтірілген.
          <div>
            <img src="img/img40.png" alt="" />
            <img src="img/img41.png" alt="" />
            <img src="img/img42.png" alt="" />
          </div>
        </p>
        </>}
        {add === 42 && <>
        <h2 className="readRight__title">ҚОСЫМШАЛАР</h2>
        <p>
          <div>
            <h4>Қосымша тапсырма №1</h4>
            <p>Бүкіл құрал саймандарды пайдаланып, төмендегі күрделі сызбаны сызыңыз.</p>
            <img src="img/ann1.png" alt="" />
            <img src="img/ann2.png" alt="" />
          </div>
          <div>
            <h4>Қосымша тапсырма №2</h4>
            <p>Екі өлшемді координата жүйесінде өлшемдері берілген сызбаны сызыңыз.</p>
            <img src="img/ann3.png" alt="" />
          </div>
          <div>
            <h4>Қосымша тапсырма №3</h4>
            <p>А4 форматына сызбаның қасиетін сақтай отырып сызыңыз.</p>
            <img src="img/ann4.png" alt="" />
          </div>
          <div>
            <h4>Қосымша тапсырма №4</h4>
            <p>Төмендегі  күрделі сызбаны А4 форматына сызыңыз.</p>
            <img src="img/ann5.png" alt="" />
          </div>
          <div>
            <h4>Қосымша тапсырма №5</h4>
            <p>Төмендегі  күрделі сызбаны А4 форматына сызыңыз.</p>
            <img src="img/ann6.png" alt="" />
          </div>
        </p>
        </>}
        {add === 43 && <>
        <h2 className="readRight__title">AUTOCAD БАҒДАРЛАМАСЫНДА ТЕЗ ЕНДІРУ ПЕРНЕЛЕР КОМБИНАЦИЯСЫ</h2>
        <p>
          Пернелер	Командасы	Әрекет
          <li>Ctrl+C	Copy	Ерекшеленген объектіні алмасу буферіне көшіреді</li>
          <li>Ctrl+X	Cutclip	Ерекшеленген объектіні сызбадан қиып,  алмасу буферіне көшіреді</li>
          <li>Ctrl+V	Pasteclip	Алмасу буферіндегі объектіні ағымдағы сызба бетіне қояды</li>
          <li>Ctrl+O	Open	Auto Cad бағдарламасында сақталған файлдарды ашу терезесін шақырады</li>
          <li>Ctrl+N	New	Жаңа сызба бетін жасайды</li>
          <li>Ctrl+S	Qsave	Тез сақтауды орындауды немесе  «қалай сақтау» терезесін шақырады</li>
          <li>Ctrl+Z	Undo	Соңғы әрекетті болдырмау</li>
          <li>Ctrl+Y	Redo	Redo командасын шақырады</li>
          <li>Ctrl+P	Plot	«Қағазға шығару» терезесін шақырады</li>
          <li>Ctrl+H	Group	Топты таңдау</li>
          <li>Ctrl+J	Enter	Enter-енгізу функциясын орындайды</li>
          <li>Ctrl+K	Hyperlink	Гиперсілтемені құру командасын шақырады</li>
          <li>Ctrl+A	Select all	Барлық объектіні ерекшелеу</li>
          <li>Ctrl+0	Clean Screen	Құралдар панелін қосады немесе айырады</li>
          <li>Ctrl+1
            Properties	Қасиет терезесін  қосады немесе айырады</li>
          <li>Ctrl+2	Adcenter	Desing Center терезесін қосады  немесе айырады</li>
          <li>Ctrl+3	ToolPalettes	ToolPalettes панелін  қосады  немесе айырады</li>
          <li>Ctrl+6	dbConnect	dbConnect Manager панелін  қосады  немесе айырады</li>
          <li>F7(Ctrl+G)	Grid	Тор сетк  режимін қосу немесе айыру</li>
          <li>F8(Ctrl+L)	Ortho	ORTHO  режимін қосу немесе айыру</li>
          <li>F9(Ctrl+B)	Snap	Тор көзіне байлауды немесе полярлық байлау  режимін қосып айыру</li>
          <li>F10(Ctrl+U)	Polar	Полярлық режимін  қосу немесе айыру</li>
          <li>F11(Ctrl+W)	Otrack	О.СЛЕД  режимін  қосу немесе айыру</li>

        </p>
        </>}
        {add === 44 && <>
        <h2 className="readRight__title">ПАЙДАЛАНҒАН ӘДЕБИЕТТЕР:</h2>
        <p>
          <li>1.	А.О.Әлиева,  Казбекова Г.Н. AutoCAD ортасында программалау, әдістемелік құрал, Қ.Жұбанов атындағы АқӨМУ баспа орталығы, Ақтөбе, 2016</li>
          <li>2.	Кириллова Т. И., Поротникова С. А. Компьютерная графика AutoCAD 2014 : учеб. пособ. — Екатеринбург : УрФУ, 2016. — 156 с.</li>
          <li>3.	Хамметов А., Батырханов А.Ғ. AutoCAD 2008  автоматтандырылған жобалау, оқулық, - Алматы: ЖШС РПБК «Дәуір», 2013  </li>
          <li>4.	Ж.М.Есмұхан, Қ.Ә.Құспеков, Е.Е.Мәсімбаев Компьютерлік графиканың теориялық негіздері, оқу құралы, «Альманахъ», 2019  </li>
          <li>5.	Бирнз AutoCAD 2007 для "чайников" / Бирнз, Мидлбрук Двид; , Марк. - М.: Вильямс, 2017. - 384 c.</li>
          <li>6.	Зоммер AutoCAD 2007. Руководство чертежника, конструктора, архитектора / Зоммер, Вернер. - М.: Бином, 2020. - 816 c.</li>
          <li>7.	Наградова AutoCAD. Справочник конструктора / Наградова, Маргарита. - М.: Прометей, 2018. - 280 c.</li>
          <li>8.	Погорелов AutoCad. Трехмерное моделирование и дизайн / Погорелов, Виктор. - М.: СПб: БХВ, 2017. - 272 c.</li>
          <li>9.	Полещук AutoCAD 2007. 2D/3D-моделирование / Полещук, Николай. - М.: Русская Редакция, 2017. - 416 c.</li>
          <li>10.	Соколова, Т. AutoCad. Легкий старт / Т. Соколова. - М.: СПб: Питер, 2015. - 160 c.</li>
          <li>11.	Ткачев Энциклопедия AutoCAD 2004 / Ткачев, Дмитрий. - М.: СПб: Питер, 2017. - 394 c.</li>
          <li>12.	Финкельштейн AutoCAD 2000. Библия пользователя / Финкельштейн, Эллен. - М.: Вильямс, 2015. - 789 c.</li>

        </p>
        </>}
      </div>
    </div>
   </div>
  )
}

export default Read