import React from 'react';
// import ReactMarkdown from 'react-markdown';

import './read.scss';
function Read() {
  const [show, setShow] = React.useState(false);
  const [show1, setShow1] = React.useState(false);
  const [show2, setShow2] = React.useState(false);
  const [show3, setShow3] = React.useState(false);
  const [show4, setShow4] = React.useState(false);
  const [show5, setShow5] = React.useState(false);
  const [show6, setShow6] = React.useState(false);
  const [show7, setShow7] = React.useState(false);
  const [show8, setShow8] = React.useState(false);
  const [show9, setShow9] = React.useState(false);
  const [show10, setShow10] = React.useState(false);
  const [show11, setShow11] = React.useState(false);
  const [add, setAdd] = React.useState(1);

  const onShow = () => {
    setShow(!show);
    setShow1(false);
  };
  const onShow1 = () => {
    setShow(false);
    setShow1(!show1);
    setShow2(false);
    setShow3(false);
    setShow4(false);
    setShow5(false);
    setShow6(false);
    setShow7(false);
    setShow8(false);
    setShow9(false);
    setShow10(false);
    setShow11(false);
  };
  const onShow2 = () => {
    setShow(false);
    setShow1(false);
    setShow2(!show2);
    setShow3(false);
    setShow4(false);
    setShow5(false);
    setShow6(false);
    setShow7(false);
    setShow8(false);
    setShow9(false);
    setShow10(false);
    setShow11(false);
  };
  const onShow3 = () => {
    setShow(false);
    setShow1(false);
    setShow2(false);
    setShow3(!show3);
    setShow4(false);
    setShow5(false);
    setShow6(false);
    setShow7(false);
    setShow8(false);
    setShow9(false);
    setShow10(false);
    setShow11(false);
  };
  const onShow4 = () => {
    setShow(false);
    setShow1(false);
    setShow2(false);
    setShow3(false);
    setShow4(!show4);
    setShow5(false);
    setShow6(false);
    setShow7(false);
    setShow8(false);
    setShow9(false);
    setShow10(false);
    setShow11(false);
  };
  const onShow5 = () => {
    setShow(false);
    setShow1(false);
    setShow2(false);
    setShow3(false);
    setShow4(false);
    setShow5(!show5);
    setShow6(false);
    setShow7(false);
    setShow8(false);
    setShow9(false);
    setShow10(false);
    setShow11(false);
  };
  const onShow6 = () => {
    setShow(false);
    setShow1(false);
    setShow2(false);
    setShow3(false);
    setShow4(false);
    setShow5(false);
    setShow6(!show6);
    setShow7(false);
    setShow8(false);
    setShow9(false);
    setShow10(false);
    setShow11(false);
  };
  const onShow7 = () => {
    setShow(false);
    setShow1(false);
    setShow2(false);
    setShow3(false);
    setShow4(false);
    setShow5(false);
    setShow6(false);
    setShow7(!show7);
    setShow8(false);
    setShow9(false);
    setShow10(false);
    setShow11(false);
  };
  const onShow8 = () => {
    setShow(false);
    setShow1(false);
    setShow2(false);
    setShow3(false);
    setShow4(false);
    setShow5(false);
    setShow6(false);
    setShow7(false);
    setShow8(!show);
    setShow9(false);
    setShow10(false);
    setShow11(false);
  };
  const onShow9 = () => {
    setShow(false);
    setShow1(false);
    setShow2(false);
    setShow3(false);
    setShow4(false);
    setShow5(false);
    setShow6(false);
    setShow7(false);
    setShow8(false);
    setShow9(!show9);
    setShow10(false);
    setShow11(false);
  };
  const onShow10 = () => {
    setShow(false);
    setShow1(false);
    setShow2(false);
    setShow3(false);
    setShow4(false);
    setShow5(false);
    setShow6(false);
    setShow7(false);
    setShow8(false);
    setShow9(false);
    setShow10(!show10);
    setShow11(false);
  };
  const onShow11 = () => {
    setShow(false);
    setShow1(false);
    setShow2(false);
    setShow3(false);
    setShow4(false);
    setShow5(false);
    setShow6(false);
    setShow7(false);
    setShow8(false);
    setShow9(false);
    setShow10(false);
    setShow11(!show11);
  };
  return (
    <div className="container">
      <div className="read">
        <div className="readLeft">
          <h2 className="read__title">Мазмұны</h2>
          <ul className="read__menu">
            <li onClick={() => onShow()} className="read__item">
              <h3 className="read__menu-title">КІРІСПЕ</h3>
              {show && (
                <ul>
                  <li onClick={() => setAdd(1)}>
                    Робототехниканың және мехатрониканың даму тарихы.
                  </li>
                  <li onClick={() => setAdd(2)}>
                    1.1 Робототехниканың пайда болу жəне даму шарттары
                  </li>
                </ul>
              )}
            </li>
            <li className="read__item" onClick={() => onShow1()}>
              <h3 className="read__menu-title">Мехатрониканың анықтамалары мен терминологиясы.</h3>
              {show1 && (
                <ul>
                  <li onClick={() => setAdd(3)}>
                    Мехатрониканың анықтамалары мен терминологиясы. Мехатрондық жүйелердің құрылымы
                    және жіктелуі
                  </li>
                  <li onClick={() => setAdd(4)}>
                    2.1 Мехатрондық жүйелердің құрылымы және жіктелуі
                  </li>
                </ul>
              )}
            </li>
            <li className="read__item" onClick={() => onShow2()}>
              <h3 className="read__menu-title">Мехатроника принциптері.</h3>
              {show2 && (
                <ul>
                  <li onClick={() => setAdd(5)}>
                    Мехатроника принциптері. Мехатронды құрылғылардың құрылым әдістері. Мехатрондық
                    және робототехникалық жүйелердің басқару жүйелері
                  </li>
                </ul>
              )}
            </li>
            <li className="read__item" onClick={() => onShow3()}>
              <h3 className="read__menu-title">
                Өнеркәсіптік роботтар, негізгі түсініктері, жіктелуі.
              </h3>
              {show3 && (
                <ul>
                  <li onClick={() => setAdd(6)}>
                    Өнеркәсіптік роботтар, негізгі түсініктері, жіктелуі. Интелектуалды басқару
                    технологиясы. Нейроторлы құрылым технологиясы.
                  </li>
                  <li onClick={() => setAdd(7)}>4.1 Өнеркәсіптік роботтардың структурасы</li>
                </ul>
              )}
            </li>
            <li className="read__item" onClick={() => onShow4()}>
              <h3 className="read__menu-title">Өнеркəсіптік роботтардың жіктелуі.</h3>
              {show4 && (
                <ul>
                  <li onClick={() => setAdd(8)}>
                    Өнеркəсіптік роботтардың жіктелуі. Роботтардың тағайындалуы жəне қолданылу
                    салалары.
                  </li>
                  <li onClick={() => setAdd(9)}>5.1 Робот түрлері</li>
                </ul>
              )}
            </li>
            <li className="read__item" onClick={() => onShow5()}>
              <h3 className="read__menu-title">Курс жабдықтарымен танысу.</h3>
              {show5 && (
                <ul>
                  <li onClick={() => setAdd(10)}>
                    Курс жабдықтарымен танысу. LEGO MİNDSTORMS EV3 Education жинағы.
                  </li>
                </ul>
              )}
            </li>
            <li className="read__item" onClick={() => onShow6()}>
              <h3 className="read__menu-title">LEGO датчиктері және олардың параметрлері.</h3>
              {show6 && (
                <ul>
                  <li onClick={() => setAdd(11)}>LEGO датчиктері және олардың параметрлері.</li>
                  <li onClick={() => setAdd(12)}>7.1.1. Микроконтроллер</li>
                  <li onClick={() => setAdd(13)}>7.1.2. Қозғалтқыштар</li>
                  <li onClick={() => setAdd(14)}>7.1.3. Датчиктер</li>
                  <li onClick={() => setAdd(15)}>Түс сенсоры</li>
                </ul>
              )}
            </li>
            <li className="read__item" onClick={() => setAdd(16)}>
              <h3 className="read__menu-title">EV3 БАҒДАРЛАМАЛЫҚ ҚҰРАМЫ</h3>
            </li>
            <li className="read__item" onClick={() => onShow7()}>
              <h3 className="read__menu-title">Роботтарды бағдарламалау тілдері.</h3>
              {show7 && (
                <ul>
                  <li onClick={() => setAdd(17)}>
                    Роботтарды бағдарламалау тілдері. Роботқа бағытталған тілдердің сипаттамасы.
                  </li>
                  <li onClick={() => setAdd(18)}>Ассамблер тілі</li>
                  <li onClick={() => setAdd(19)}>Java</li>
                  <li onClick={() => setAdd(20)}>MATLAB</li>
                  <li onClick={() => setAdd(21)}>Python</li>
                </ul>
              )}
            </li>
            <li className="read__item" onClick={() => onShow8()}>
              <h3 className="read__menu-title">Arduino платформасы туралы жалпы ақпарат.</h3>
              {show8 && (
                <ul>
                  <li onClick={() => setAdd(22)}>
                    Arduino платформасы туралы жалпы ақпарат. Ақпараттық бөлік. Arduino тақталары
                  </li>
                  <li onClick={() => setAdd(23)}>Arduino Mega дегеніміз не?</li>
                  <li onClick={() => setAdd(24)}>Arduino Nano дегеніміз не?</li>
                  <li onClick={() => setAdd(25)}>Arduino Pro Mini дегеніміз не?</li>
                  <li onClick={() => setAdd(25)}>Arduino Леонардо дегеніміз не?</li>
                </ul>
              )}
            </li>
            <li className="read__item" onClick={() => onShow9()}>
              <h3 className="read__menu-title">
                Arduino платасының негізгі компоненттері мен бөлшектері.
              </h3>
              {show9 && (
                <ul>
                  <li onClick={() => setAdd(26)}>
                    {' '}
                    Arduino платасының негізгі компоненттері мен бөлшектері.
                  </li>
                  <li onClick={() => setAdd(27)}>11.2. Arduino бөліктері</li>
                </ul>
              )}
            </li>
            <li className="read__item" onClick={() => setAdd(28)}>
              <h3 className="read__menu-title">
                Arduino бағдарламасын жүктеу, орнату және оқып үйрену
              </h3>
            </li>
            <li className="read__item" onClick={() => setAdd(29)}>
              <h3 className="read__menu-title">
                Arduino IDE-да бағдарламалау негіздері. Бағдарлама құрылымы
              </h3>
            </li>
            <li className="read__item" onClick={() => onShow10()}>
              <h3 className="read__menu-title">Arduino-да бағдарламалау.</h3>
              {show10 && (
                <ul>
                  <li onClick={() => setAdd(30)}>14.1 Бірінші бағдарлама</li>
                  <li onClick={() => setAdd(31)}>14.2 Blink бағдарламасына талдау жасау. </li>
                  <li onClick={() => setAdd(32)}>14.3 Tinkercad Circuits Arduino-мен танысу </li>
                </ul>
              )}
            </li>
            <li className="read__item" onClick={() => onShow11()}>
              <h3 className="read__menu-title">Негізгі Arduino қолданбалары</h3>
              {show11 && (
                <ul>
                  <li onClick={() => setAdd(33)}>15.1 Бағдаршам программасы</li>
                  <li onClick={() => setAdd(34)}>15.2 Түймемен жарық диодты қосу</li>
                  <li onClick={() => setAdd(35)}>
                    15.3 Arduino көмегімен жаңбыр сенсорын пайдалану
                  </li>
                </ul>
              )}
            </li>
          </ul>
        </div>
        <div className="readRight">
          {add === 1 && (
            <>
              <h2 className="readRight__title">
                Кіріспе. Робототехниканың және мехатрониканың даму тарихы.
              </h2>
              <p className="readRight__descr">
                Робототехника – автоматтандырылған техникалық жүйелерді құрастырумен айналысатын
                ғылым түрі. Робототехника - зерттеу обьектісі робот болып табылатын ғылым. Робот –
                бұл индустрия. Роботтарды көп жағдайда эксприментті мысалы; аз санды және практикада
                аз қолданылатын деп қарастыруға болады. Бірақ робот жасау және роботтарды қолдану
                аса ірі сала болып табылады. Роботтарды жасаудағы мақсат – адамға ауыр, қажытатын,
                денсаулығына зиян, қызмет түрлерін солардың міндетіне беру болып табылады.
                Робототехника екіге бөлінеді өдірістік және арнайы. Өнеркәсіптік робот дегеніміз
                ойлау қабілеті жоқ, қозғалмалы автоматикалық машина, ол бірнеше қозғалыс дәрежелері
                бар манипулятор түріндегі атқару құрылғысынан және өндірістік үрдісте қозғалу және
                басқару функциясын орындауға арналған қайта бағдарламаланатын құрылғысынан тұрады.
                Робототехника (робот және техника; ағылш. Robotics – роботика, роботехника) –
                роботтардың құрылысы, жұмысы, қолдануымен айналысатын, оған қоса оларды басқару,
                сезіну, мәлімет өңдеумен айналысатын механикалық, электронды инженерия мен компьютер
                ғылымдарының біріккен саласы. Сондай-ақ робототехника роботтардан басқа
                автоматтандырылған техникалық жүйелер мен өндірістік үдерістердің ең жаңа техникалық
                жиынтықталуын әзірлеу мен қолдану жолдарын зерттейтін ғылым. Pобот - чех сөзі, оны
                чех жазушы - сатиригі Карл Чапек ағасы Йозфпен бірлесіп «R.U.R» (Rossum’s Universal
                Robots, 1917 жыл, 1921 жылы жарыққа шықты) пьесса үшін ойлап тапқан. Бір қызығы,
                пьесса адам тәріздес машинаның адамдарға қарсы көтерілісі туралы әңгімелейді. Сюжет
                бойынша, роботтар бірінші міндетте өз түрін қалыптастыруға арналған өндіріспен
                айналады. Олар жер шарын тез толтырып және барлық жұмысты өзіне алады, нәтижесінде
                адамзат түгелдей дерлік нашарлайды. Ақырында роботтар көтерілісті бастайды. Карелдің
                идеясы замандастарының ақыл-парасатын қозғағаны соншалық, бірінші пьессаның
                қойылымынан кейін Лондонда жазушы бір мезетте атақты болып шыға келеді. Роботтық
                жүйелер физикалық немесе бағдарламалық жасақтамаға негізделген роботтармен
                басқарылатын автоматтандыру мен механикалық ұтқырлықты қамтитын жүйелер. Бұл жүйелер
                көптеген әртүрлі салаларда және қолданбаларда қолданылады және бірқатар
                тапсырмаларды орындау үшін әртүрлі сенсорларды, жетектерді және бағдарламалық құрал
                құрамдастарын қамтуы мүмкін. Роботтық жүйелердің кейбір негізгі компоненттері болуы
                мүмкін: Сенсорлар: роботтар қоршаған ортаны сезіну үшін әртүрлі сенсорларды
                пайдалана алады. Мысалы, олар кескін сенсорлары, ультрадыбыстық сенсорлар, лазерлік
                сканерлер, жылу камералары сияқты әртүрлі сенсорлардың көмегімен қоршаған ортадағы
                нысандарды анықтай алады. Атқарушы механизмдер: Роботтық жүйелер физикалық
                тапсырмаларды жылжыту немесе орындау үшін пайдаланылатын жетектерді қамтиды. Бұл
                жетектер қозғалтқыштар, сызықтық жетектер, гидравликалық цилиндрлер және
                пневматикалық жүйелер сияқты компоненттерді қамтуы мүмкін. Басқару блогы: роботтың
                функционалдығын үйлестіретін және басқаратын бағдарламалық немесе аппараттық басқару
                блогы бар. Бұл құрылғы роботтың сенсор деректерін талдайды және жетектерді
                бағыттайды.
              </p>
            </>
          )}
          {add === 2 && (
            <>
              <h2 className="readRight__title">
                1.1 Робототехниканың пайда болу жəне даму шарттары
              </h2>
              <p>
                Ғылым мен техниканың кез-келген саласының пайда болуы жəне дамуы белгілі бір уақыт
                аралығында жүретін, басқа да объективтік жəне субъективтік себептер мен жағдайларға
                тəуелді жəне өзара байланысты күрделі үрдіс болып табылады. Кейбір жағдайларда осы
                немесе басқа техникалық құрал ерте пайда болады да, осы техникамен байланысты нақты
                ғылыми бағыттың дамуына алғы шарттар тудырады. Даму тарихы, сонымен қатар, роботтар
                мен басқа да мехатрондық құрылғылардың пайда болу жəне жетілдірілу үрдісі-жаңа
                техниканы құру, сондай-ақ, ғылыми бағыттарды дамытудағы күрделі себеп-салдар
                байланысы туралы куəлəндіреді. Мысалы, алдымен роботтар құрылды, содан кейін,
                роботтардың қолданылуына байланысты ғылыми бағыт – робототехника қалыптасты. Сонымен
                қатар, кей жерлерде алдымен примитивтік, содан кейін, біршама күрделі мехатрондық
                құрылғыларды құру үшін параллельді түрде ғылыми білімдер саласында алғы шарттар
                құрылды жəне тəжірибе жинақтау кезінде шарттар дайындалды. Микроэлектрониканың
                негізінде, басқаратын жəне ақпараттық жүйелері бар жаңа техникалық жүйелердің кең
                класының пайда болуы Мехатроника ғылыми саласының пайда болуына жəне дамуына себеп
                болды. Сонымен, Робототехника Мехатрониканың ғылыми бағыттарының бірі болып табылды.
                Роботтық жүйелердің үш түрі бар: 1-Манпуляторлық робот жүйесі 2-Мобильді робот
                жүйесі 3-Деректерді жинау және басқару роботтық жүйесі Манипуляциялық робототехника
                жүйесі көбінесе өңдеу өнеркәсібінде қолданылады. Бұл жүйелер 4-6 осі және әртүрлі
                еркіндік дәрежесі бар робот қолынан тұрады. Ол паллеттеу, орау, дәнекерлеу және
                тасымалдау сияқты көптеген әртүрлі функцияларды орындайды. Мобильді робот жүйесінің
                басқалардан айырмашылығы бар. Бұл жүйе өнімді бір жерден екінші жерге тасымалдайтын
                платформалардан тұрады. Ол инженерлік бағдарламалық қамтамасыз етуде де қолданылады.
                Деректерді жинау және басқару роботтық жүйелері әртүрлі сигналдар үшін деректерді
                жинау, өңдеу және беру үшін қолданылады. Сондай-ақ инженерлік және бизнес үшін
                қолданылады. Роботтың функциясын жақсырақ түсіну үшін адамның функцияларымен
                салыстыра отырып көрсетуге болады. 1.1-суретте адамзаттың функцияларына ұқсас
                роботтың функциялары сандармен белгіленген. Осы функциялар төмендегідей: 1- жасанды
                иіс сезу; 2- жасанды интеллект; 3- техникалық көру; 4- сөйлеу анализаторы; 5- сөйлеу
                синтезаторы; 6- жасанды аяқтар (қадамдайтын аппарат); 7- жасанды білезік (білезіктен
                бастап саусаққа дейінгі бөлім); 8- механикалық қолдар (манипулятор).
                <p style={{ textAlign: 'center' }}>
                  <img src="/img/img1.png" />
                </p>
                1.1- сурет. Адам мен роботтың функционалдық мүмкіндіктерін салыстыру.
                <br />
                <br />
                <p>
                  {' '}
                  1.1- суретте көрсетілгеніндей, механикалық қол манипулятор деп аталады. Сондықтан
                  да, техникалық əдебиетте «Манипуляциялық робот» термині қолданылады. Басты мақсаты
                  адам қолының функцияларын суреттеу болып табылатын роботты манипуляциялық робот
                  деп атаймыз.
                </p>
              </p>
            </>
          )}
          {add === 3 && (
            <>
              <h2 className="readRight__title">Мехатрондық жүйелердің құрылымы және жіктелуі</h2>
              <p>
                Мехатроника мен робототехника - бүгінгі технологиямен өзара әрекеттесу жолында
                төңкеріс жасайтын екі сала. Бұл жұмыс және даму бағыттары біздің күнделікті
                өмірімізді өзгертетін интеллектуалды машиналар мен автоматтандырылған жүйелерді
                жасау үшін өзара тоғысады. Екеуі де автоматтандырылған және автономды жүйелерді
                жобалау, құру және бағдарламалау үшін механикалық, электронды, басқару және
                бағдарламалық білімдерді біріктіреді. Мехатроника – механикалық, электронды және
                басқарушы инженерияны біріктіретін сала. Ол механикалық және электрондық
                компоненттерді біріктіретін жүйелерді жобалау мен құруға, сондай-ақ осы жүйелерді
                басқару және басқару үшін бағдарламалық қамтамасыз етуді әзірлеуге бағытталған.
                Мехатроника құрылғылар мен машиналардың тиімділігі мен функционалдығын жақсартуға,
                олардың өнімділігін оңтайландыруға және олардың процестерін автоматтандыруға
                бағытталған. Мехатрониканы қолданудың кең таралған мысалы - өндірістік желідегі
                нақты тапсырмаларды орындау үшін механикалық тұтқаларды, сенсорларды, жетектерді
                және электронды контроллерді біріктіретін өнеркәсіптік робот. Біз сондай-ақ
                автономды көліктер, смарт құрылғылар және өнеркәсіптегі автоматты басқару жүйелері
                сияқты құрылғыларда мехатрониканы таба аламыз. Робототехника роботтарды жобалауға,
                құрастыруға және бағдарламалауға бағытталған. Робот - бұл бағдарламаланған түрде
                немесе қоршаған ортамен әрекеттесу арқылы тапсырмаларды орындай алатын автономды
                жүйе. Роботтарды адамдар басқара алады немесе қоршаған ортаны сезіну және әрекет ету
                үшін сенсорлар арқылы автономды түрде жұмыс істей алады. Робототехника өнеркәсіптік
                робототехника, медициналық робототехника, сервистік робототехника және білім беру
                робототехникасы сияқты әртүрлі салаларды қамтиды. Өнеркәсіпте роботтар қайталанатын
                және қауіпті тапсырмаларды автоматтандыру және тиімділік пен қауіпсіздікті арттыру
                үшін қолданылады. Медицинада роботтар жоғары дәлдіктегі операцияларды жасап,
                мамандарға ауруларды диагностикалау мен емдеуге көмектесе алады. Қызмет көрсету
                саласында роботтарды тазалау, логистика немесе тұтынушыларға қызмет көрсету
                саласында пайдалануға болады. Робототехника білім беруде ғылым, технология,
                инженерия және математика ұғымдарын практикалық және қызықты түрде оқыту құралы
                ретінде қолданылады. Мехатроника - автоматтандырылған жүйелер мен роботтарды жобалау
                және жасау үшін машина жасау, электроника және есептеуді біріктіреді. Бұл тиімдірек
                және функционалды өнімдер мен жүйелерді әзірлеу үшін осы үш саланың принциптерін
                пайдаланатын пәнаралық сала. Мехатроника механикалық жүйелерді электронды
                компоненттер мен бағдарламалық қамтамасыз етуді қолдану арқылы басқаруға және
                автоматтандыруға болады деген идеяға негізделген. Бұл таза механикалық жүйелерге
                қарағанда жүйелерді дәлірек, жылдамырақ және сенімдірек етуге мүмкіндік береді.
                Мехатроника автомобиль өнеркәсібі, медицина, ауыл шаруашылығы, робототехника және
                т.б. сияқты көптеген салаларда қолданылады. Мысалы, автомобиль өнеркәсібінде
                тартқышты басқару жүйелері және бұғаттауға қарсы тежеу жүйелері мехатроникалық
                қосымшалардың мысалдары болып табылады. Бұл жүйелер көлік жұмысын басқару және
                оңтайландыру үшін сенсорларды, жетектерді және бағдарламалық құралды пайдаланады.
                Әртүрлі домендер арасындағы бұл өзара әрекеттестік тапсырмаларды автономды немесе
                жартылай автономды түрде орындай алатын құрылғыларды жасауға мүмкіндік береді. Ол
                мехатроника, өнеркәсіптік робототехника, автоматтандыру жүйелері, автономды көліктер
                және озық медициналық құрылғылар сияқты көптеген қосымшаларда қол жетімді.
                Робототехника, керісінше, роботтарды жобалауға және жасауға бағытталған. Роботтар –
                тапсырмаларды автоматты түрде орындай алатын бағдарламаланатын машиналар.
                Робототехника қоршаған ортамен әрекеттесетін және күрделі тапсырмаларды орындай
                алатын роботтарды жасау үшін мехатроника принциптерін пайдаланады. Мысалы,
                өндірістік роботтар зауыттарда қайталанатын және қауіпті тапсырмаларды орындау үшін
                қолданылады. Мехатроника механикалық жүйелерді электроника мен компьютерлерді
                қолдану арқылы басқаруға және жақсартуға болатын принципке негізделген. Бұл тиімді
                және дәл жұмысты қамтамасыз ету үшін сенсорларды, жетектерді және басқару жүйелерін
                біріктіретін жүйелерді жобалау мен енгізуді қамтиды. Мехатроника сонымен қатар
                мехатроникалық жүйелерді басқару және бағдарламалау үшін қажетті бағдарламалық
                қамтамасыз етуді біріктіру және әзірлеумен айналысады. Бағдарламалық қамтамасыз ету
                жүйенің механикалық және электрондық құрамдас бөліктерінің өзара әрекеттесуіне және
                байланысына мүмкіндік беру арқылы жүйенің үйлесімді жұмысын қамтамасыз етеді.
              </p>
            </>
          )}
          {add === 4 && (
            <>
              <h2 className="readRight__title">
                2.1 Мехатрондық жүйелердің құрылымы және жіктелуі
              </h2>
              <p>
                «Жүйе» мағынасы əртүрлі контексте (мағына жағынан тыянақты текстінің бөлігі)
                қолданылатын жəне ғылымның əртүрлі саласында кең таралған ұғым болып табылады.
                Жүйені белгілі бір мақсатқа қызмет ететін, олардың арасында тұрақты қатынаста
                болатын және бір-біріне әсер ететін элементтер тобы ретінде анықтауға болады. •
                Жүйеге оның ортасындағы өзгерістер әсер етуі мүмкін. • Модельдеу жүйелерінде жүйенің
                шекарасы мен периметрі туралы шешім қабылдау қажет. • Бұл шешім зерттеу мақсатына
                байланысты болуы мүмкін. «Жүйе» – система, белгілі тəртіп, біркелкі деген мағынаны
                білдіреді. Бұл жағдайда нəтижесінде материя,энергия жəне информация берілетін
                (жылжытылатын, қозғалатын), жыйналатын, бірігіп белгілі бір операцияны(іс-əрекетті)
                орындауға қабілетті, құраушылардың белгілі түрде өзара байланысқан жинағы (жиынтығы)
                жүйе деп аталады.Кей жағдайда жүйені құраушы бөлшектер табиғаты жағынан əртүрлі
                болады,мысалы, электрлік, химиялық, механикалық немесе биологиялық. Жапония
                мехатроника ғылымының қалыптасуы мен дамуында маңызды рөл атқарды. Алғаш рет 1969
                жылы жапондық Yasukawa Electric компаниясының инженері «мехатроника» сөзін
                механикалық және электронды инженерия салаларының қосындысын білдіреді. Мехатроника
                1980 жылдардың басына дейін электрлендірілген механизмді білдіреді. 1980 жылдардың
                ортасында ол механика мен электроника арасындағы шекараны белгілей бастады және
                жылдар өте келе ол микроконтроллерлер механикалық жүйелерге олардың өнімділігін
                арттыру, олардың өлшемдерін азайту және шығындарын азайту үшін қосылатын жалпы пәнге
                айналды. Осы онжылдықта қолданбалардағы мехатрониканың қарқынды дамуы дискеттік
                дискілерді, сандық басқарылатын машиналарды, өнеркәсіптік роботтарды, автомобиль
                қозғалтқыштарын және тежеуге қарсы жүйелерді (ABS) қамтиды. 1990 жылдардың маңызды
                ерекшелігі болған телекоммуникациялық технологияларды қолданудың артуына байланысты
                үлкен желілерге қосылған жүйелерді құру мүмкін болды. Басқаша айтқанда, мехатрондық
                жүйелер қорғаныс өнеркәсібі, қауіпсіздік жүйелері, машина жасау өнеркәсібі,
                өнеркәсіптік автоматтандыру жүйелері, медицина, ауыл шаруашылығы, банк ісі және
                тау-кен өнеркәсібі сияқты әртүрлі салаларда қолданылады және олардың қолдану аясы
                күн санап кеңейіп келеді. Мехатрониканың ғылым саласы ретінде дамуы негізінен
                роботтық жүйелерден басталғанымен, бүгінгі күні мехатрониканың қосымшаларын көптеген
                салаларда табуға болады. Өнеркәсіптік роботтар, түнгі көру жүйелері, мина тазалаушы
                роботтар, автоматты шұлықтар, камералар, бейнелер, кір жуу, ыдыс жуғыш машиналар
                және банкоматтар сияқты жүйелер мен өнімдер негізінен мехатрондық жүйелер болып
                табылады. Сәйкесінше 1 және 2-суретте көрсетілген бір қолды бекітілген және екі
                қолды жылжымалы робот қол жүйелері өнеркәсіптің көптеген салаларында, әсіресе
                автомобиль өнеркәсібінде әлі де қолданылатын мехатрондық жүйелердің қатарына жатады.
                <p style={{ textAlign: 'center' }}>
                  <img src="/img/img2.png" />
                </p>
                2.1 - cурет. Kuka KR16 типті өнеркәсіптік робот қолы
                <p style={{ textAlign: 'center' }}>
                  <img src="/img/img3.png" />
                </p>
                2.2 - cурет. Көп қолды мобильді робот жүйесі
                <br />
                <p>
                  Жоғарыда аталған жалпы мақсаттағы классикалық робот жүйелерінен басқа, гуманоид
                  роботтар да әзірленді, олар қазіргі уақытта тек демонстрациялық мақсатта
                  әзірленгенімен, мина тазалау, мина тазалау сияқты қауіпті және уақытты қажет
                  ететін жұмыстарда адам күші орнына пайдалану жоспарлануда. жақын болашақта
                  өндіріс, интеграция және тасымалдау.
                </p>
              </p>
            </>
          )}
          {add === 5 && (
            <>
              <h2 className="readRight__title">
                Мехатронды құрылғылардың құрылым әдістері. Мехатрондық және робототехникалық
                жүйелердің басқару жүйелері
              </h2>
              <p>
                Мехатроника - механикалық, электроника, бағдарламалық қамтамасыз ету және басқару
                инженериясына негізделген инженерияның жоғары басқарылатын саласы. Мехатроника
                құрылғысы қоршаған ортаны қабылдайды, алған ақпарат негізінде тиісті шешімдер
                қабылдайды және шешімді жүзеге асырады. Мехатроника пәнін құрайтын ғылым салаларының
                өзара байланысын 3-суреттегі сызбада келтірілгендей қорытындылауға болады. 3.1 –
                сурет. Мехатрониканы құрайтын ғылым салаларының өзара байланысы. Тиісінше, жоғарыда
                аталған салалардың арасында механиканың электроника және бағдарламалық қамтамасыз
                етумен қиылысулары сәйкесінше электромеханика және CAD/CAM (компьютерлік
                дизайн/компьютерлік өндіріс), ал электроника және бағдарламалық қамтамасыз етумен
                басқару компонентінің ортақ жиынтығы болып табылады. Сонымен қатар, суретте
                көрсетілген жүйені модельдеу; механиканы, бағдарламалық қамтамасыз етуді және
                электрониканы модельдеу; механика, бағдарламалық қамтамасыз ету және басқару,
                микроконтроллерлер; Электроника, басқару және бағдарламалық қамтамасыз ету және
                сайып келгенде, сенсорлар механикалық, электронды және басқару өрістерінің ортақ
                өнімдері болып табылады. Аталған төрт негізгі пәннің тоғысуы мехатрониканы құрайды.
                Мехатроника өнімдер мен өндірістік процестерді жобалауда дәлме-дәл механикалық,
                электронды, басқару және жүйелік инженерияның синергетикалық үйлесімі ретінде
                анықталады. Ол негізгі механикалық құрылым мен оны жалпы басқару арасындағы оңтайлы
                тепе-теңдікке қол жеткізуге бағытталған жүйелерді, құрылғыларды және өнімдерді
                жобалауға қатысты. Мехатроника бүгінгі күннің күрделі инженерлік мәселелеріне
                оңтайлы шешімдер үшін технологиялардың дұрыс комбинациясын анықтау және пайдалану
                үшін тар инженерлік пәндердің шекарасында жұмыс істей алатын инженерлерге
                өнеркәсіптің өсіп келе жатқан сұранысына жауап береді. Пәндер арасындағы синергияны
                түсіну инженерлік студенттерді пәнаралық салаларда жұмыс істей алатын жақсы
                коммуникаторларға және маман инженерлерден, сондай-ақ жалпы мамандардан тұруы мүмкін
                дизайнерлік топтарға жетекшілік етеді. Мехатроника қолданбалы салалардың кең ауқымын
                қамтиды, соның ішінде тұтынушылық өнім дизайнын, аспаптық құралдарды, өндіріс
                әдістерін, қозғалысты басқару жүйелерін, компьютерлік интеграцияны, процестер мен
                құрылғыларды басқаруды, кірістірілген микропроцессорлық басқарумен функционалдылықты
                біріктіруді және дәрежесі бар машиналарды, құрылғыларды және жүйелерді жобалау.
                компьютерге негізделген интеллект. Робототтық манипуляторлар, ұшақ тренажерлары,
                тартқышты басқарудың электронды жүйелері, бейімделгіш аспалар, қону шассилері, анық
                емес логикалық басқарудағы кондиционерлер, автоматтандырылған диагностикалық
                жүйелер, микро электромеханикалық жүйелер (MEMS), бейнемагнитофондар, жүргізушісіз
                көліктер сияқты тұтынушылық өнімдер - мехатрониканың мысалдары. жүйелер. Бұл жүйелер
                талап етілетін спецификацияларды қанағаттандыру, механикалық жабдыққа «интеллект»
                енгізу, әмбебаптық пен техникалық қызмет көрсету мүмкіндігін қосу және шығындарды
                азайту үшін механикалық, басқару және компьютерлік жүйелерді біріктіруге байланысты.
              </p>
            </>
          )}
          {add === 6 && (
            <>
              <h2 className="readRight__title">
                Интелектуалды басқару технологиясы. Нейроторлы құрылым технологиясы.
              </h2>
              <p>
                Қазіргі заманда роботтар бізді таңқалдырудан жалықпайды, олар біздің өмірімізде
                қалыпты нарсе секілді. Олар адам денсаулығына зиян келтіретін жерлерде жұмыс
                атқарады (мысалға, робот сапер), немесе адам қолы жетпейтін жерлерде жұмыс істейді.
                Әрине, өнеркәсіптік роботтар адам шаруашылығындағы кеңістігінде де орын алған. Осы
                роботтардың қажеттілігі екі мәселемен іске асырылады. Бірінші мәселе - өндіріске
                қажеттілігі. Оларға мыналар жатады: • құрылғылардың өндірілуінің жоғарлауы; •
                өңделген бұйымның сапасының жоғарлауы; • технологиялық және өндірістік прцестердің
                жақсаруы; • еңбектің төмендетілуі. Екінші мәселе - социалды қажеттілік. •
                роботтандырылған кешендер жұмысшыларды ұзақ жұмыс уақытынан және ауыр физикалық
                еңбектен босатады; • өндірістің нашар жағдайын жояды; • жұмыс күшін үнемдетеді.
                Роботтандырудың негізгі сатылары: • роботтандыру объектісін таңдау; •
                роботтандырылған кешеннің жобалау кезіндегі жүйені реттеу; • өндіріс; • кешеннің
                енуі. Өнеркәсіптік роботтың түрлері Орындау сипаты бойынша олар былай бөлінеді: •
                Өндірістік (технологиялық). Технологиялық процестердің негізінде жататын
                операцияларды орындау үшін жасалған. • Транспортты-көтергіш. Осындай түрлері олар
                мысалға алғанда бір нәрсенің орынын ауыстыру, қою және алу үшін қолданады. •
                Универсалды өнеркәсіптік роботтар. Бұндай роботтар өте қиын операцияларды орындау
                үшін қолданылады.
              </p>
            </>
          )}
          {add === 7 && (
            <>
              <h2 className="readRight__title">4.1 Өнеркәсіптік роботтардың структурасы</h2>
              <p>
                Өнеркәсіптік роботтар манипулятор секілді орындайтын құрылғылардан және программалық
                басқару құрылғысынан тұрады. Өнеркәсіптік роботтың манипуляторы объектілердің
                кеңістіктегі қозғалысы кезіндегі функцияларды орындауға арналған және жабық
                кинематикалық жұбы бар көп буынды механизмі болып табылады. Конструктивті механизм
                алып жүретін конструкциядан, орындайтын механизмдерден, ұстап тұратын ұүрылғыдан,
                беріліс механизмнің жетектерінен және орын ауыстыру құрылғысынан тұрады.
                Өнеркәсіптік роботтың басқару құрылғысы басқару программасымен байланысты
                манипуляторға басқарудың әсерін шығару үшін және реттеу үшін қажет және
                конструктивті өзінің басқару жүйесінен, кері байланыс құрылғысы бар
                ақпаратты­өлшейтін жүйеден және байланыс жүйесінен тұрады. Алып жүретін конструкция
                өнеркәсіптік роботттардың агрегаттарды және барлық құрылғыларды орналастыру үшін,
                сонымен бірге манипулятордың қажетті қаттылығы мен беріктігін қамтамасыз ету үшін
                қолданады. Алып жүретін конструкция корпустарды, тіректерді, рамаларды,
                телешкаларды, порталдарды негіздеу түрінде іске асырылады. Орындаушы механизм ­
                манипулятордың қозғалысты біріктірілген буындарының тұтастығы, ол объектіге
                манипуляция жасауға немесе орындалған ортаның әсері үшін жасалған. Ұсталынатын
                механизм ­ манипулятордың аяғындағы түйіні, объектінің манипуляция жасау кезіндегі
                белгілі жағдайда ұстап тұруға және ұстауды қамтамасыз етеді. Басқару құрылғысынан
                келіп түсекен, сигналмен сәйкес орындаушы механизмнің буынының энергиясын
                механикалық қозғалысқа түрлендіру үшін арналған. Қозғалыс құрылғысы манипуляторды
                немесе өнеркәсіптік роботты керекті жұмыс орнына орын ауыстыру үшін арналған және
                конструктивті жүріс бөлігінен және жетекті құрылғылардан тұрады. Басқару жүйесі
                басқаратын сигналдарды беру және реттеу үшін қажет және басқаратын пульттан, есте
                сақтау құрылғысынан, есептеуіш құрылғысынан, манипулятордың жетектерін басқару
                блогынан және технологиялық құралдардан тұрады. Ақпаратты ­ өлшеуіш жүйесі
                өнеркәсіптік роботтардың басқару жүйесінің информациясын жинауға және біріншілік
                өңдеу арналған, ол өзі кері байланыс құрылғысынан, сигналдарды салыстыру
                құрылғысынан және кері байланыс датчигінен тұрады. Байланыс жүйесін өнеркәсіптік
                роботтардың және операторды немесе басқа да роботтарды және тапсырманы реттеу
                мақсатында технологиялық құрылғылар арасындағы ақпаратты алмасуын қамтамасыз ету
                үшін, өнеркәсіптік роботтың функционалды жүйесін қадағалау және технологиялық
                құалдар үшін, бұзылған жайлы диагностика үшін, регламентті тексіру үшін қолданады.
              </p>
            </>
          )}
          {add === 8 && (
            <>
              <h2 className="readRight__title">
                Роботтардың тағайындалуы жəне қолданылу салалары.
              </h2>
              <p>
                Роботтардың көпшілігі тұрақты және механикаландырылған жұмыстарды атқару үшін
                зауыттарда пайдаланылады. Роботтардың біз жиі еститін көптеген түрі бар. Бүгінде
                роботтар зауыттар мен фабрикаларда, зертханаларда, тауар қоймасында, ауруханаларда
                және басқа да көптеген өндіріс орындарында сан түрлі жұмыстар атқаруда,яғни роботтар
                өндіріс орындарында көбірек пайдаланылады. Зауыттардағы роботтар дәнекерлеу, сурет
                салу, машиналарды жүктеу, өнімдерді құрастыру, қауіпті материалдармен жұмыс істеу,
                химикаттарды бүру, бөлшектерді тексеру сияқты, т.б түрлі қызметтерді атқарады.
                Әлемдегі роботтардың жартысына жуығы автокөліктер жасауда қолданылады. a) Дәнекерлеу
                б) Сурет салу c) Өңдеу д) Кесу 5.1- сурет. Роботтардың өнеркәсіпте қолдану
                қызметтері Роботтар бірлескен құрылымына, қолдану аймағына, функционалдық
                ерекшеліктеріне, басқару әдістеріне және жұмыс істеу принциптеріне қарай әртүрлі
                тәсілдермен жіктеледі. Бұл классификацияны бүгінгі күнге дейінгі тарихи даму
                тұрғысынан қарастырсақ, ол өнеркәсіптік және мобильді роботтар ретінде көрінеді.
                Өнеркәсіптік роботтар буындар санына және функционалдық ерекшеліктеріне қарай
                жіктелсе, мобильді роботтар әдетте жұмыс принциптеріне, сандарына, өлшемдеріне және
                қолдану аймағына қарай жіктеледі. Сонымен қатар, осы жіктеулерден басқа,
                өнеркәсіптік және мобильді роботтарда әртүрлі құрылғылармен адам мен роботтың өзара
                әрекеттесуін қашықтықтан орындауға мүмкіндік беретін гаптикалық жүйелер басқа
                классификация ретінде пайда болады. Мобильді роботтар; Олар гуманоидты роботтар,
                мультироботтар, басқарылатын роботтар, микро нано роботтар, биологиялық роботтар,
                бірлескен роботтар және сенсорлар ретінде жіктеледі. ISO 8373 стандартымен
                анықталған ерекшеліктерге сәйкес өнеркәсіптік робот «үш немесе одан да көп
                бағдарламаланатын осі бар, бір жерде бекітілген немесе дөңгелектері бар өнеркәсіптік
                қолданбаларда қолданылатын автоматты басқарылатын, бағдарламаланатын, көп мақсатты
                манипулятор» ретінде анықталады. Бағдарламалану және жұмысты өздігінен орындау
                мүмкіндігі өнеркәсіптік роботтарға өндіру, кесу, тасымалдау және құрастыру сияқты
                көптеген тапсырмаларды орындауға мүмкіндік берді. Өнеркәсіп өндірісі жеделдеді,
                еңбек шығындары азайып, өнім көлемі бірнеше есе артты. Адамның қателіктері маңызды
                болып табылатын, адам өміріне қауіп төндіретін, назар мен дәлдікті талап ететін
                жұмыстарда тұрақты, қайталанатын, жоғары өнімділік нәтижелеріне қол жеткізілді.
                Өнеркәсіптік роботтар функцияларына, өлшемдеріне, сезімталдығына, қуатына,
                қолданылатын энергиясына, басқару әдісіне, қозғалыс қабілетіне және буын құрылымына
                қарай әртүрлі тәсілдермен жіктеледі. Дегенмен, ол негізінен алғашқы үш мүшенің
                белгілеріне қарай жіктеледі және концептуалды түрде осылай көрсетіледі.
                Аяқ-қолдарының құрылысына қарай декарттық, цилиндрлік, сфералық, айналмалы буынды
                және скара тәрізді роботтар болып жіктеледі. Робот қоршаған әлеммен әрекеттескен
                кезде адамның (жануарлардың) қызметтері мен ісәрекеттерін ішінара немесе толық
                атқарады. Алғашқы роботтар адамның қозғалысы мен сырт пішінін қайталады. Олар
                ойын-сауық мақсаттарында пайдаланылды.Қазіргі кезде тұрмыстағы көптеген қызметтерді
                атқаратын, қадағалайтын, мүгедектер мен сәбилерге көмекші, көңілін аулайтын, т.б.
                Роботтар жасалынды, интеллектуалдық роботтар да пайда бола бастады.
              </p>
            </>
          )}
          {add === 9 && (
            <>
              <h2 className="readRight__title">5.1 Робот түрлері</h2>
              <p>
                <br />
                <img className="ic" src="img/ic6.png" alt="" /> Соңғы 17 жылда «da Vinci» хирург
                роботтарының көмегімен әлем бойынша 3 миллионға жуық науқасқа ота жасалды. Da Vinci
                – дәрігерге ота жасау аймағын HDсапада көруге мүмкіндік беретін хирургиялық жүйе. Ол
                ота аймағында кедергісіз жұмыс жасау үшін кішкентай пішінмен жасалды. 5.2- сурет.
                Хирург робот Аспазшы робот - құрылғыны жеке робот емес, тұтастай асхана деп санауға
                болады. Аспазшының орнын басатын роботтың адамға сәйкестендірген екі қолы бар. Осы
                екі қолының көмгімен ақылды құрылғы мәзірде тапсырыс берген пәрмен бойынша бұйрықты
                орындайды. Адам қанша уақытта дәмді ас әзірлей алса, робот та дәл сол уақытта және
                дәмді тамақ жасауға қауқарлы. Бұл робоасхана сатылымға 2018 жылдан бастап шығады.
                5.3- сурет. Аспазшы робот Бақташы робот – құрылғы қазіргі уақытта енді
                құрастырылуда. Соңғы сынақ кезеңінің нәтижесі бойынша, SwagBot мал бағуға, заттарды
                орынынан жылжытуға, бау-бақшаға қарауға өте тиімді робот. Бұл құрылғыны жасау үшін
                Сидней Университетінің ұстаздары аянбай тер төгуде. 5.4- сурет. Бақташы робот
                Киберфермер - фермерлік шаруашылықты жандандыру үшін бұл салада роботтардың бірнеше
                түрі дайындалған. Бау-бақша жемістерін егіп, оны баптап, жемісін теріп алуға жағдай
                жасайтын ол бүгінгі күннің таптырмас құрылғысы. Баубақша техникаларының қатарына
                қосылған тағы бір робот – AgBot. Оның қызметі – бақшаны химиялық және механикалық
                тәсілмен барлық арамшөптен арылту. Сонымен қоса, егін топырағын тыңайтады. 5.5-
                сурет. Баубақша робот Қойма роботы - қоймадағы жүкті бір орыннан екінші орынға
                қозғалту үшін ойлап табылған құрылғы. Жұмысшыларға айлық төлегеннен гөрі осындай
                құрылғыларды сатып алып өз жұмыстарын ілгері жүргізіп жатқан компаниялар көп.
                Мысалы, 2015 жылы Қытайдың Everwin Precision Technology компаниясы жұмысшыларының
                90% дәл осындай роботтарға ауыстырды. 5.6- сурет. Қойма роботы Тасымалдаушы дрон -
                жүктерді жеткізу қызметі үшін таптырмас құрылғы. Адамдардың қызметтік орнын басқан
                роботты биылғы жылдан бастап қолдана бастады. Жаңа Зеландияның Domino’s Pizza
                қызметкерлері жұмыстарына көмек ретінде осы құрылғының көмегімен пицца жеткізуді
                бастап кетті. 5.7- сурет. Тасымалдаушы дрон Күзетші робот - шетелдік ойын-сауық
                орталықтарының көлік тұрақтарында қарауылдың қызметін осындай арнайы роботтар
                атқарады. Жартыметрлік күзетшінің кеудесіне камера орнатылып, GPS қойылады. Бұл
                аппараттар Сан-Франциско және Калифорния қалаларында өз қызметін бастап кетті. 5.8-
                сурет. Күзетші робот
              </p>
            </>
          )}
          {add === 10 && (
            <>
              <h2 className="readRight__title">LEGO MİNDSTORMS EV3 Education жинағы.</h2>
              <p>
                LEGO MİNDSTORMS EV3 Education жинағы – бұл жай конструктор емес, ол көптеген күрделі
                электронды кұрамдас бөліктерден тұратын роботтардың конструкторы болып табылады.
                Бөлшектер 4 топты құрайды: 1. Электронды құрамдас бөліктер: - EV3 модулі. -
                Датчиктер. - Моторлар. - Байланыстырушы кабельдер. 2. Тегершіктер, дөңгелектер және
                белдіктер. 3. Байланыстырушы элементтер. 4. Құрастырымдылық элементтер 6.1- сурет.
                LEGO MİNDSTORMS EV3 Education жинағы LEGO® MINDSTORMS® EV3 жинағының құрамына 541
                бөлшек кіреді. LEGO® (жанындағы көрінісі) жинағы бөлшектерін сенімді сақтауды
                қамтамасыз ету үшін төзімді пластикалық қорапта ұсынылып отыр. Қораптың жоғарыдан
                қарағандағы көрінісі. Қораптың қақпағын ашқанда Базалық Жинақ (Core Set) атауы бар
                картонды мұқабаны көресіздер. Картонның астында қызыл түсті сұрыпталған жаймада
                LEGO® бөлшектері жинақталған. Бұл өз кезегінде құрастыру үрдісін оңтайландыруды және
                бөлшектердің дұрыс тәртіпте сақталуын қамтамасыз етеді. 6.2 - сурет. LEGO MİNDSTORMS
                EV3 Education жинағының бөлшектері 1. Табан шынжырлардың жинағы; 2. Түрлі
                ұзындықтағы және түрдегі бөренелер; 3. Байланыстырушы сымдар; 4. Декорға арналған
                элементтер; 5. Түрлі байланыстырушы элементтер; 6. Түрлі көлемдегі тегершіктер; 7.
                Түрлі көлемдегі дөңгелектердің жинағы; 8. Түрлі ұзындықтағы белдіктердің жинағы; 9.
                Компьютерге қосылуға арналған USB кабель; 10. Бағдарламасы жазылған CD-диск; 11. Қос
                иіндер; 12. Қайта қуаттандырылатын Li-Ion аккумуляторлық батареясы; 13. EV3
                микроконтроллері; 14. 2 үлкен мотор; 15. Орташа мотор; 16. Ультрадыбысты датчик; 17.
                Гироскопиялық датчик; 18. Жанасу датчигі; 19. Түс датчигі; 20. Қуаттандыру
                құрылғысы. LEGO MINDSTOMS EV3 көмегімен робот жасауды бастамас бұрын,
                компьютерімізге бағдарламалық құралды орнату керек. Бұл бағдарламалық құрал арқылы
                біз компьютер арқылы бағдарламалай аламыз. Ол үшін төмендегі сілтемені басу арқылы
                «LEGO Mindstorms Education EV3» бағдарламалық құралын компьютеріңіздің
                мүмкіндіктеріне сәйкес және қалаған тілде жүктеп алуға болады.
                https://education.lego.com/en-us/downloads/mindstorms-ev3/software/ 6.3 - сурет.
                LEGO MİNDSTORMS EV3 Education бағдарламалық құралы Бұл бөлімде біз келесі мәзір
                тақырыптарын бір-бірден көреміз. 1. Start Here 2. New Project 3. Tutorials (Robot
                Educator) 4. Building Instructions 5. Design Engineering Projects 6. Space Challenge
                7. Science “Start Here” мәзірінде; Preapre Try Use Next Steps - сияқты ішкі мәзірлер
                бар. Біз осы мәзірлердегі қадамдарды орындау арқылы «LEGO Mindstorms EV3»
                бағдарламалауды оңай бастай аламыз. Бірінші қадамнан бірге бастайық. 6.4 - сурет.
                Бағдарламаның алғашқы беті «Prepare» ішкі мәзірін басқан кезде біз үшін жасалған
                кейбір қадамдарды көреміз. Жаңа жобамен жұмыс істеу кезінде жоғарыда көрсеткен 1
                немесе 2 бөлімдерді басу арқылы төменде жаңа жоба бетін және жаңа бағдарлама
                беттерін жасауға болады.
              </p>
            </>
          )}
          {add === 12 && (
            <>
              <h2 className="readRight__title">LEGO датчиктері және олардың параметрлері.</h2>
              <p>
                Lego Education Mindstorms EV3 - бұл оқу орындары үшін арнайы әзірленген білім беру
                робототехника платформасы. Оның көмегімен студент бірінші сабақта өзінің алғашқы
                роботын жасай алады. 7.1-сурет. Lego Education Mindstorms EV3 жинағы Датчиктердің
                көмегімен робот айналасындағы әлемді қабылдайды және қозғалтқыштардың арқасында
                бағдарламаланған бағдарламаға сәйкес оған әрекет етеді. LEGO Mindstorms EV3 негізгі
                жиынтығы – роботтық жобаларды әзірлеуге қажетті негізгі құрамдастарды қамтитын
                жиынтық. Бұл жинақ төмендегі кестеде көрсетілген жабдықпен бірге жеткізіледі. Кесте
                7.1. LEGO Mindstorms EV3 негізгі жиынтығы – № Құрал атаулары Саны 1 EV3 контроллер 1
                2 Түс сенсоры 1 3 Жанасу сенсоры 2 4 Ультрадыбыстық сенсор 1 5 Гиродатчик 1 6 Үлкен
                қозғалтқыш 2 7 Орташа қозғалтқыш 1 8 Батарея 1 9 Кабель, 25 см 4 10 Кабель, 35 см 2
                11 Кабель, 50 см 1 LEGO® MINDSTORMS® EV3 жинағының құрамына 541 бөлшек кіреді. LEGO®
                (жанындағы көрінісі) жинағы бөлшектерін сенімді сақтауды қамтамасыз ету үшін төзімді
                пластикалық қорапта ұсынылып отыр. Қораптың жоғарыдан қарағандағы көрінісі. Қораптың
                қақпағын ашқанда Базалық Жинақ (Core Set) атауы бар картонды мұқабаны көресіздер.
                Картонның астында қызыл түсті сұрыпталған жаймада LEGO® бөлшектері жинақталған. Бұл
                өз кезегінде құрастыру үрдісін оңтайландыруды және бөлшектердің дұрыс тәртіпте
                сақталуын қамтамасыз етеді.
              </p>
            </>
          )}
        </div>
      </div>
    </div>
  );
}

export default Read;
